josuah/mcu-stm32f411/registers.h
#ifndef REGISTERS_H
#define REGISTERS_H


#define ADC_COMMON ((struct mcu_adc_common *)0x40012300)

struct mcu_adc_common {

	/* 0x00 */
	uint8_t RESERVED0[0x04u-0x00u];

	/* 0x04: ADC common control register */
	uint32_t volatile CCR;
	/* Temperature sensor and VREFINT */
#define ADC_COMMON_CCR_TSVREFE					(1u << 23)
	/* VBAT enable */
#define ADC_COMMON_CCR_VBATE					(1u << 22)
	/* ADC prescaler */
#define ADC_COMMON_CCR_ADCPRE_Msk				(0x3u << 16)
#define ADC_COMMON_CCR_ADCPRE_Pos				16
#define ADC_COMMON_CCR_ADCPRE_DIV2				(0x0u << 16)
#define ADC_COMMON_CCR_ADCPRE_DIV4				(0x1u << 16)
#define ADC_COMMON_CCR_ADCPRE_DIV6				(0x2u << 16)
#define ADC_COMMON_CCR_ADCPRE_DIV8				(0x3u << 16)

};


#define ADC1 ((struct mcu_adc1 *)0x40012000)

struct mcu_adc1 {

	/* 0x00: status register */
	uint32_t volatile SR;
	/* Overrun */
#define ADC_SR_OVR						(1u << 5)
#define ADC_SR_OVR_NOOVERRUN					(0x0u << 5)
#define ADC_SR_OVR_OVERRUN					(0x1u << 5)
	/* Regular channel start flag */
#define ADC_SR_STRT						(1u << 4)
#define ADC_SR_STRT_NOTSTARTED					(0x0u << 4)
#define ADC_SR_STRT_STARTED					(0x1u << 4)
	/* Injected channel start */
#define ADC_SR_JSTRT						(1u << 3)
#define ADC_SR_JSTRT_NOTSTARTED					(0x0u << 3)
#define ADC_SR_JSTRT_STARTED					(0x1u << 3)
	/* Injected channel end of */
#define ADC_SR_JEOC						(1u << 2)
#define ADC_SR_JEOC_NOTCOMPLETE					(0x0u << 2)
#define ADC_SR_JEOC_COMPLETE					(0x1u << 2)
	/* Regular channel end of */
#define ADC_SR_EOC						(1u << 1)
#define ADC_SR_EOC_NOTCOMPLETE					(0x0u << 1)
#define ADC_SR_EOC_COMPLETE					(0x1u << 1)
	/* Analog watchdog flag */
#define ADC_SR_AWD						(1u << 0)
#define ADC_SR_AWD_NOEVENT					(0x0u << 0)
#define ADC_SR_AWD_EVENT					(0x1u << 0)

	/* 0x04: control register 1 */
	uint32_t volatile CR1;
	/* Overrun interrupt enable */
#define ADC_CR1_OVRIE						(1u << 26)
	/* Resolution */
#define ADC_CR1_RES_Msk						(0x3u << 24)
#define ADC_CR1_RES_Pos						24
#define ADC_CR1_RES_TWELVEBIT					(0x0u << 24)
#define ADC_CR1_RES_TENBIT					(0x1u << 24)
#define ADC_CR1_RES_EIGHTBIT					(0x2u << 24)
#define ADC_CR1_RES_SIXBIT					(0x3u << 24)
	/* Analog watchdog enable on regular */
#define ADC_CR1_AWDEN						(1u << 23)
	/* Analog watchdog enable on injected */
#define ADC_CR1_JAWDEN						(1u << 22)
	/* Discontinuous mode channel */
#define ADC_CR1_DISCNUM_Msk					(0x7u << 13)
#define ADC_CR1_DISCNUM_Pos					13
	/* Discontinuous mode on injected */
#define ADC_CR1_JDISCEN						(1u << 12)
	/* Discontinuous mode on regular */
#define ADC_CR1_DISCEN						(1u << 11)
	/* Automatic injected group */
#define ADC_CR1_JAUTO						(1u << 10)
	/* Enable the watchdog on a single channel */
#define ADC_CR1_AWDSGL						(1u << 9)
#define ADC_CR1_AWDSGL_ALLCHANNELS				(0x0u << 9)
#define ADC_CR1_AWDSGL_SINGLECHANNEL				(0x1u << 9)
	/* Scan mode */
#define ADC_CR1_SCAN						(1u << 8)
	/* Interrupt enable for injected */
#define ADC_CR1_JEOCIE						(1u << 7)
	/* Analog watchdog interrupt */
#define ADC_CR1_AWDIE						(1u << 6)
	/* Interrupt enable for EOC */
#define ADC_CR1_EOCIE						(1u << 5)
	/* Analog watchdog channel select */
#define ADC_CR1_AWDCH_Msk					(0x1Fu << 0)
#define ADC_CR1_AWDCH_Pos					0

	/* 0x08: control register 2 */
	uint32_t volatile CR2;
	/* Start conversion of regular */
#define ADC_CR2_SWSTART						(1u << 30)
#define ADC_CR2_SWSTART_START					(0x1u << 30)
	/* External trigger enable for regular */
#define ADC_CR2_EXTEN_Msk					(0x3u << 28)
#define ADC_CR2_EXTEN_Pos					28
#define ADC_CR2_EXTEN_DISABLED					(0x0u << 28)
#define ADC_CR2_EXTEN_RISINGEDGE				(0x1u << 28)
#define ADC_CR2_EXTEN_FALLINGEDGE				(0x2u << 28)
#define ADC_CR2_EXTEN_BOTHEDGES					(0x3u << 28)
	/* External event select for regular */
#define ADC_CR2_EXTSEL_Msk					(0xFu << 24)
#define ADC_CR2_EXTSEL_Pos					24
#define ADC_CR2_EXTSEL_TIM1CC1					(0x0u << 24)
#define ADC_CR2_EXTSEL_TIM1CC2					(0x1u << 24)
#define ADC_CR2_EXTSEL_TIM1CC3					(0x2u << 24)
#define ADC_CR2_EXTSEL_TIM2CC2					(0x3u << 24)
#define ADC_CR2_EXTSEL_TIM2CC3					(0x4u << 24)
#define ADC_CR2_EXTSEL_TIM2CC4					(0x5u << 24)
#define ADC_CR2_EXTSEL_TIM2TRGO					(0x6u << 24)
	/* Start conversion of injected */
#define ADC_CR2_JSWSTART					(1u << 22)
#define ADC_CR2_JSWSTART_START					(0x1u << 22)
	/* External trigger enable for injected */
#define ADC_CR2_JEXTEN_Msk					(0x3u << 20)
#define ADC_CR2_JEXTEN_Pos					20
#define ADC_CR2_JEXTEN_DISABLED					(0x0u << 20)
#define ADC_CR2_JEXTEN_RISINGEDGE				(0x1u << 20)
#define ADC_CR2_JEXTEN_FALLINGEDGE				(0x2u << 20)
#define ADC_CR2_JEXTEN_BOTHEDGES				(0x3u << 20)
	/* External event select for injected */
#define ADC_CR2_JEXTSEL_Msk					(0xFu << 16)
#define ADC_CR2_JEXTSEL_Pos					16
#define ADC_CR2_JEXTSEL_TIM1TRGO				(0x0u << 16)
#define ADC_CR2_JEXTSEL_TIM1CC4					(0x1u << 16)
#define ADC_CR2_JEXTSEL_TIM2TRGO				(0x2u << 16)
#define ADC_CR2_JEXTSEL_TIM2CC1					(0x3u << 16)
#define ADC_CR2_JEXTSEL_TIM3CC4					(0x4u << 16)
#define ADC_CR2_JEXTSEL_TIM4TRGO				(0x5u << 16)
#define ADC_CR2_JEXTSEL_TIM8CC4					(0x7u << 16)
#define ADC_CR2_JEXTSEL_TIM1TRGO2				(0x8u << 16)
#define ADC_CR2_JEXTSEL_TIM8TRGO				(0x9u << 16)
#define ADC_CR2_JEXTSEL_TIM8TRGO2				(0xAu << 16)
#define ADC_CR2_JEXTSEL_TIM3CC3					(0xBu << 16)
#define ADC_CR2_JEXTSEL_TIM5TRGO				(0xCu << 16)
#define ADC_CR2_JEXTSEL_TIM3CC1					(0xDu << 16)
#define ADC_CR2_JEXTSEL_TIM6TRGO				(0xEu << 16)
	/* Data alignment */
#define ADC_CR2_ALIGN						(1u << 11)
#define ADC_CR2_ALIGN_RIGHT					(0x0u << 11)
#define ADC_CR2_ALIGN_LEFT					(0x1u << 11)
	/* End of conversion */
#define ADC_CR2_EOCS						(1u << 10)
#define ADC_CR2_EOCS_EACHSEQUENCE				(0x0u << 10)
#define ADC_CR2_EOCS_EACHCONVERSION				(0x1u << 10)
	/* DMA disable selection (for single ADC */
#define ADC_CR2_DDS						(1u << 9)
#define ADC_CR2_DDS_SINGLE					(0x0u << 9)
#define ADC_CR2_DDS_CONTINUOUS					(0x1u << 9)
	/* Direct memory access mode (for single */
#define ADC_CR2_DMA						(1u << 8)
	/* Continuous conversion */
#define ADC_CR2_CONT						(1u << 1)
#define ADC_CR2_CONT_SINGLE					(0x0u << 1)
#define ADC_CR2_CONT_CONTINUOUS					(0x1u << 1)
	/* A/D Converter ON / OFF */
#define ADC_CR2_ADON						(1u << 0)

	/* 0x0C: sample time register 1 */
	uint32_t volatile SMPR1;
	/* Channel 18 sampling time selection */
#define ADC_SMPR1_SMP18_Msk					(0x7u << 24)
#define ADC_SMPR1_SMP18_Pos					24
#define ADC_SMPR1_SMP18_CYCLES3					(0x0u << 24)
#define ADC_SMPR1_SMP18_CYCLES15				(0x1u << 24)
#define ADC_SMPR1_SMP18_CYCLES28				(0x2u << 24)
#define ADC_SMPR1_SMP18_CYCLES56				(0x3u << 24)
#define ADC_SMPR1_SMP18_CYCLES84				(0x4u << 24)
#define ADC_SMPR1_SMP18_CYCLES112				(0x5u << 24)
#define ADC_SMPR1_SMP18_CYCLES144				(0x6u << 24)
#define ADC_SMPR1_SMP18_CYCLES480				(0x7u << 24)
	/* Channel 17 sampling time selection */
#define ADC_SMPR1_SMP17_Msk					(0x7u << 21)
#define ADC_SMPR1_SMP17_Pos					21
	/* Channel 16 sampling time selection */
#define ADC_SMPR1_SMP16_Msk					(0x7u << 18)
#define ADC_SMPR1_SMP16_Pos					18
	/* Channel 15 sampling time selection */
#define ADC_SMPR1_SMP15_Msk					(0x7u << 15)
#define ADC_SMPR1_SMP15_Pos					15
	/* Channel 14 sampling time selection */
#define ADC_SMPR1_SMP14_Msk					(0x7u << 12)
#define ADC_SMPR1_SMP14_Pos					12
	/* Channel 13 sampling time selection */
#define ADC_SMPR1_SMP13_Msk					(0x7u << 9)
#define ADC_SMPR1_SMP13_Pos					9
	/* Channel 12 sampling time selection */
#define ADC_SMPR1_SMP12_Msk					(0x7u << 6)
#define ADC_SMPR1_SMP12_Pos					6
	/* Channel 11 sampling time selection */
#define ADC_SMPR1_SMP11_Msk					(0x7u << 3)
#define ADC_SMPR1_SMP11_Pos					3
	/* Channel 10 sampling time selection */
#define ADC_SMPR1_SMP10_Msk					(0x7u << 0)
#define ADC_SMPR1_SMP10_Pos					0

	/* 0x10: sample time register 2 */
	uint32_t volatile SMPR2;
	/* Channel 9 sampling time selection */
#define ADC_SMPR2_SMP9_Msk					(0x7u << 27)
#define ADC_SMPR2_SMP9_Pos					27
#define ADC_SMPR2_SMP9_CYCLES3					(0x0u << 27)
#define ADC_SMPR2_SMP9_CYCLES15					(0x1u << 27)
#define ADC_SMPR2_SMP9_CYCLES28					(0x2u << 27)
#define ADC_SMPR2_SMP9_CYCLES56					(0x3u << 27)
#define ADC_SMPR2_SMP9_CYCLES84					(0x4u << 27)
#define ADC_SMPR2_SMP9_CYCLES112				(0x5u << 27)
#define ADC_SMPR2_SMP9_CYCLES144				(0x6u << 27)
#define ADC_SMPR2_SMP9_CYCLES480				(0x7u << 27)
	/* Channel 8 sampling time selection */
#define ADC_SMPR2_SMP8_Msk					(0x7u << 24)
#define ADC_SMPR2_SMP8_Pos					24
	/* Channel 7 sampling time selection */
#define ADC_SMPR2_SMP7_Msk					(0x7u << 21)
#define ADC_SMPR2_SMP7_Pos					21
	/* Channel 6 sampling time selection */
#define ADC_SMPR2_SMP6_Msk					(0x7u << 18)
#define ADC_SMPR2_SMP6_Pos					18
	/* Channel 5 sampling time selection */
#define ADC_SMPR2_SMP5_Msk					(0x7u << 15)
#define ADC_SMPR2_SMP5_Pos					15
	/* Channel 4 sampling time selection */
#define ADC_SMPR2_SMP4_Msk					(0x7u << 12)
#define ADC_SMPR2_SMP4_Pos					12
	/* Channel 3 sampling time selection */
#define ADC_SMPR2_SMP3_Msk					(0x7u << 9)
#define ADC_SMPR2_SMP3_Pos					9
	/* Channel 2 sampling time selection */
#define ADC_SMPR2_SMP2_Msk					(0x7u << 6)
#define ADC_SMPR2_SMP2_Pos					6
	/* Channel 1 sampling time selection */
#define ADC_SMPR2_SMP1_Msk					(0x7u << 3)
#define ADC_SMPR2_SMP1_Pos					3
	/* Channel 0 sampling time selection */
#define ADC_SMPR2_SMP0_Msk					(0x7u << 0)
#define ADC_SMPR2_SMP0_Pos					0

