josuah/mcu-stm32f411/registers.h
	/* 0x14: injected channel data offset register */
	uint32_t volatile JOFR[4];
	/* Data offset for injected channel */
#define ADC_JOFR_JOFFSET_Msk					(0xFFFu << 0)
#define ADC_JOFR_JOFFSET_Pos					0

	/* 0x18 */
	uint8_t RESERVED0[0x24u-0x18u];

	/* 0x24: watchdog higher threshold */
	uint32_t volatile HTR;
	/* Analog watchdog higher */
#define ADC_HTR_HT_Msk						(0xFFFu << 0)
#define ADC_HTR_HT_Pos						0

	/* 0x28: watchdog lower threshold */
	uint32_t volatile LTR;
	/* Analog watchdog lower */
#define ADC_LTR_LT_Msk						(0xFFFu << 0)
#define ADC_LTR_LT_Pos						0

	/* 0x2C: regular sequence register 1 */
	uint32_t volatile SQR1;
	/* Regular channel sequence */
#define ADC_SQR1_L_Msk						(0xFu << 20)
#define ADC_SQR1_L_Pos						20
	/* 16th conversion in regular */
#define ADC_SQR1_SQ16_Msk					(0x1Fu << 15)
#define ADC_SQR1_SQ16_Pos					15
	/* 15th conversion in regular */
#define ADC_SQR1_SQ15_Msk					(0x1Fu << 10)
#define ADC_SQR1_SQ15_Pos					10
	/* 14th conversion in regular */
#define ADC_SQR1_SQ14_Msk					(0x1Fu << 5)
#define ADC_SQR1_SQ14_Pos					5
	/* 13th conversion in regular */
#define ADC_SQR1_SQ13_Msk					(0x1Fu << 0)
#define ADC_SQR1_SQ13_Pos					0

	/* 0x30: regular sequence register 2 */
	uint32_t volatile SQR2;
	/* 12th conversion in regular */
#define ADC_SQR2_SQ12_Msk					(0x1Fu << 25)
#define ADC_SQR2_SQ12_Pos					25
	/* 11th conversion in regular */
#define ADC_SQR2_SQ11_Msk					(0x1Fu << 20)
#define ADC_SQR2_SQ11_Pos					20
	/* 10th conversion in regular */
#define ADC_SQR2_SQ10_Msk					(0x1Fu << 15)
#define ADC_SQR2_SQ10_Pos					15
	/* 9th conversion in regular */
#define ADC_SQR2_SQ9_Msk					(0x1Fu << 10)
#define ADC_SQR2_SQ9_Pos					10
	/* 8th conversion in regular */
#define ADC_SQR2_SQ8_Msk					(0x1Fu << 5)
#define ADC_SQR2_SQ8_Pos					5
	/* 7th conversion in regular */
#define ADC_SQR2_SQ7_Msk					(0x1Fu << 0)
#define ADC_SQR2_SQ7_Pos					0

	/* 0x34: regular sequence register 3 */
	uint32_t volatile SQR3;
	/* 6th conversion in regular */
#define ADC_SQR3_SQ6_Msk					(0x1Fu << 25)
#define ADC_SQR3_SQ6_Pos					25
	/* 5th conversion in regular */
#define ADC_SQR3_SQ5_Msk					(0x1Fu << 20)
#define ADC_SQR3_SQ5_Pos					20
	/* 4th conversion in regular */
#define ADC_SQR3_SQ4_Msk					(0x1Fu << 15)
#define ADC_SQR3_SQ4_Pos					15
	/* 3rd conversion in regular */
#define ADC_SQR3_SQ3_Msk					(0x1Fu << 10)
#define ADC_SQR3_SQ3_Pos					10
	/* 2nd conversion in regular */
#define ADC_SQR3_SQ2_Msk					(0x1Fu << 5)
#define ADC_SQR3_SQ2_Pos					5
	/* 1st conversion in regular */
#define ADC_SQR3_SQ1_Msk					(0x1Fu << 0)
#define ADC_SQR3_SQ1_Pos					0

	/* 0x38: injected sequence register */
	uint32_t volatile JSQR;
	/* Injected sequence length */
#define ADC_JSQR_JL_Msk						(0x3u << 20)
#define ADC_JSQR_JL_Pos						20
	/* 4th conversion in injected */
#define ADC_JSQR_JSQ4_Msk					(0x1Fu << 15)
#define ADC_JSQR_JSQ4_Pos					15
	/* 3rd conversion in injected */
#define ADC_JSQR_JSQ3_Msk					(0x1Fu << 10)
#define ADC_JSQR_JSQ3_Pos					10
	/* 2nd conversion in injected */
#define ADC_JSQR_JSQ2_Msk					(0x1Fu << 5)
#define ADC_JSQR_JSQ2_Pos					5
	/* 1st conversion in injected */
#define ADC_JSQR_JSQ1_Msk					(0x1Fu << 0)
#define ADC_JSQR_JSQ1_Pos					0

	/* 0x3C: injected data register x */
	uint32_t volatile const JDR[4];
	/* Injected data */
#define ADC_JDR_JDATA_Msk					(0xFFFFu << 0)
#define ADC_JDR_JDATA_Pos					0

	/* 0x40 */
	uint8_t RESERVED1[0x4Cu-0x40u];

	/* 0x4C: regular data register */
	uint32_t volatile const DR;
	/* Regular data */
#define ADC_DR_DATA_Msk						(0xFFFFu << 0)
#define ADC_DR_DATA_Pos						0

};


#define CRC ((struct mcu_crc *)0x40023000)

struct mcu_crc {

	/* 0x00: Data register */
	uint32_t volatile DR;
	/* Data Register */
#define CRC_DR_DR_Msk						(0xFFFFFFFFu << 0)
#define CRC_DR_DR_Pos						0

	/* 0x04: Independent Data register */
	uint32_t volatile IDR;
	/* Independent Data register */
#define CRC_IDR_IDR_Msk						(0xFFu << 0)
#define CRC_IDR_IDR_Pos						0

	/* 0x08: Control register */
	uint32_t volatile CR;
	/* Control regidter */
#define CRC_CR_RESET						(1u << 0)
#define CRC_CR_RESET_RESET					(0x1u << 0)

};


#define DBGMCU ((struct mcu_dbgmcu *)0xE0042000)

struct mcu_dbgmcu {

	/* 0x00: IDCODE */
	uint32_t volatile const IDCODE;
	/* DEV_ID */
#define DBGMCU_IDCODE_DEV_ID_Msk				(0xFFFu << 0)
#define DBGMCU_IDCODE_DEV_ID_Pos				0
	/* REV_ID */
#define DBGMCU_IDCODE_REV_ID_Msk				(0xFFFFu << 16)
#define DBGMCU_IDCODE_REV_ID_Pos				16

	/* 0x04: Control Register */
	uint32_t volatile CR;
	/* DBG_SLEEP */
#define DBGMCU_CR_DBG_SLEEP					(1u << 0)
	/* DBG_STOP */
#define DBGMCU_CR_DBG_STOP					(1u << 1)
	/* DBG_STANDBY */
#define DBGMCU_CR_DBG_STANDBY					(1u << 2)
	/* TRACE_IOEN */
#define DBGMCU_CR_TRACE_IOEN					(1u << 5)
	/* TRACE_MODE */
#define DBGMCU_CR_TRACE_MODE_Msk				(0x3u << 6)
#define DBGMCU_CR_TRACE_MODE_Pos				6

	/* 0x08: Debug MCU APB1 Freeze registe */
	uint32_t volatile APB1_FZ;
	/* DBG_TIM2_STOP */
#define DBGMCU_APB1_FZ_DBG_TIM2_STOP				(1u << 0)
	/* DBG_TIM3 _STOP */
#define DBGMCU_APB1_FZ_DBG_TIM3_STOP				(1u << 1)
	/* DBG_TIM4_STOP */
#define DBGMCU_APB1_FZ_DBG_TIM4_STOP				(1u << 2)
	/* DBG_TIM5_STOP */
#define DBGMCU_APB1_FZ_DBG_TIM5_STOP				(1u << 3)
	/* RTC stopped when Core is */
#define DBGMCU_APB1_FZ_DBG_RTC_STOP				(1u << 10)
	/* DBG_WWDG_STOP */
#define DBGMCU_APB1_FZ_DBG_WWDG_STOP				(1u << 11)
	/* DBG_IWDEG_STOP */
#define DBGMCU_APB1_FZ_DBG_IWDG_STOP				(1u << 12)
	/* DBG_J2C1_SMBUS_TIMEOUT */
#define DBGMCU_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT			(1u << 21)
	/* DBG_J2C2_SMBUS_TIMEOUT */
#define DBGMCU_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT			(1u << 22)
	/* DBG_J2C3SMBUS_TIMEOUT */
#define DBGMCU_APB1_FZ_DBG_I2C3SMBUS_TIMEOUT			(1u << 23)

	/* 0x0C: Debug MCU APB2 Freeze registe */
	uint32_t volatile APB2_FZ;
	/* TIM1 counter stopped when core is */
#define DBGMCU_APB2_FZ_DBG_TIM1_STOP				(1u << 0)
	/* TIM9 counter stopped when core is */
#define DBGMCU_APB2_FZ_DBG_TIM9_STOP				(1u << 16)
	/* TIM10 counter stopped when core is */
#define DBGMCU_APB2_FZ_DBG_TIM10_STOP				(1u << 17)
	/* TIM11 counter stopped when core is */
#define DBGMCU_APB2_FZ_DBG_TIM11_STOP				(1u << 18)

