josuah/mcu-stm32f411/registers.h
};


#define EXTI ((struct mcu_exti *)0x40013C00)

struct mcu_exti {

	/* 0x00: Interrupt mask register */
	uint32_t volatile IMR;
	/* Interrupt Mask on line 0 */
#define EXTI_IMR_MR0						(1u << 0)
#define EXTI_IMR_MR0_MASKED					(0x0u << 0)
#define EXTI_IMR_MR0_UNMASKED					(0x1u << 0)
	/* Interrupt Mask on line 1 */
#define EXTI_IMR_MR1						(1u << 1)
	/* Interrupt Mask on line 2 */
#define EXTI_IMR_MR2						(1u << 2)
	/* Interrupt Mask on line 3 */
#define EXTI_IMR_MR3						(1u << 3)
	/* Interrupt Mask on line 4 */
#define EXTI_IMR_MR4						(1u << 4)
	/* Interrupt Mask on line 5 */
#define EXTI_IMR_MR5						(1u << 5)
	/* Interrupt Mask on line 6 */
#define EXTI_IMR_MR6						(1u << 6)
	/* Interrupt Mask on line 7 */
#define EXTI_IMR_MR7						(1u << 7)
	/* Interrupt Mask on line 8 */
#define EXTI_IMR_MR8						(1u << 8)
	/* Interrupt Mask on line 9 */
#define EXTI_IMR_MR9						(1u << 9)
	/* Interrupt Mask on line 10 */
#define EXTI_IMR_MR10						(1u << 10)
	/* Interrupt Mask on line 11 */
#define EXTI_IMR_MR11						(1u << 11)
	/* Interrupt Mask on line 12 */
#define EXTI_IMR_MR12						(1u << 12)
	/* Interrupt Mask on line 13 */
#define EXTI_IMR_MR13						(1u << 13)
	/* Interrupt Mask on line 14 */
#define EXTI_IMR_MR14						(1u << 14)
	/* Interrupt Mask on line 15 */
#define EXTI_IMR_MR15						(1u << 15)
	/* Interrupt Mask on line 16 */
#define EXTI_IMR_MR16						(1u << 16)
	/* Interrupt Mask on line 17 */
#define EXTI_IMR_MR17						(1u << 17)
	/* Interrupt Mask on line 18 */
#define EXTI_IMR_MR18						(1u << 18)
	/* Interrupt Mask on line 19 */
#define EXTI_IMR_MR19						(1u << 19)
	/* Interrupt Mask on line 20 */
#define EXTI_IMR_MR20						(1u << 20)
	/* Interrupt Mask on line 21 */
#define EXTI_IMR_MR21						(1u << 21)
	/* Interrupt Mask on line 22 */
#define EXTI_IMR_MR22						(1u << 22)

	/* 0x04: Event mask register (EXTI_EMR) */
	uint32_t volatile EMR;
	/* Event Mask on line 0 */
#define EXTI_EMR_MR0						(1u << 0)
#define EXTI_EMR_MR0_MASKED					(0x0u << 0)
#define EXTI_EMR_MR0_UNMASKED					(0x1u << 0)
	/* Event Mask on line 1 */
#define EXTI_EMR_MR1						(1u << 1)
	/* Event Mask on line 2 */
#define EXTI_EMR_MR2						(1u << 2)
	/* Event Mask on line 3 */
#define EXTI_EMR_MR3						(1u << 3)
	/* Event Mask on line 4 */
#define EXTI_EMR_MR4						(1u << 4)
	/* Event Mask on line 5 */
#define EXTI_EMR_MR5						(1u << 5)
	/* Event Mask on line 6 */
#define EXTI_EMR_MR6						(1u << 6)
	/* Event Mask on line 7 */
#define EXTI_EMR_MR7						(1u << 7)
	/* Event Mask on line 8 */
#define EXTI_EMR_MR8						(1u << 8)
	/* Event Mask on line 9 */
#define EXTI_EMR_MR9						(1u << 9)
	/* Event Mask on line 10 */
#define EXTI_EMR_MR10						(1u << 10)
	/* Event Mask on line 11 */
#define EXTI_EMR_MR11						(1u << 11)
	/* Event Mask on line 12 */
#define EXTI_EMR_MR12						(1u << 12)
	/* Event Mask on line 13 */
#define EXTI_EMR_MR13						(1u << 13)
	/* Event Mask on line 14 */
#define EXTI_EMR_MR14						(1u << 14)
	/* Event Mask on line 15 */
#define EXTI_EMR_MR15						(1u << 15)
	/* Event Mask on line 16 */
#define EXTI_EMR_MR16						(1u << 16)
	/* Event Mask on line 17 */
#define EXTI_EMR_MR17						(1u << 17)
	/* Event Mask on line 18 */
#define EXTI_EMR_MR18						(1u << 18)
	/* Event Mask on line 19 */
#define EXTI_EMR_MR19						(1u << 19)
	/* Event Mask on line 20 */
#define EXTI_EMR_MR20						(1u << 20)
	/* Event Mask on line 21 */
#define EXTI_EMR_MR21						(1u << 21)
	/* Event Mask on line 22 */
#define EXTI_EMR_MR22						(1u << 22)

	/* 0x08: Rising Trigger selection register */
	uint32_t volatile RTSR;
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR0						(1u << 0)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR1						(1u << 1)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR2						(1u << 2)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR3						(1u << 3)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR4						(1u << 4)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR5						(1u << 5)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR6						(1u << 6)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR7						(1u << 7)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR8						(1u << 8)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR9						(1u << 9)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR10						(1u << 10)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR11						(1u << 11)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR12						(1u << 12)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR13						(1u << 13)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR14						(1u << 14)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR15						(1u << 15)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR16						(1u << 16)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR17						(1u << 17)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR18						(1u << 18)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR19						(1u << 19)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR20						(1u << 20)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR21						(1u << 21)
	/* Rising trigger event configuration of */
#define EXTI_RTSR_TR22						(1u << 22)

	/* 0x0C: Falling Trigger selection register */
	uint32_t volatile FTSR;
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR0						(1u << 0)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR1						(1u << 1)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR2						(1u << 2)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR3						(1u << 3)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR4						(1u << 4)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR5						(1u << 5)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR6						(1u << 6)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR7						(1u << 7)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR8						(1u << 8)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR9						(1u << 9)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR10						(1u << 10)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR11						(1u << 11)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR12						(1u << 12)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR13						(1u << 13)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR14						(1u << 14)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR15						(1u << 15)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR16						(1u << 16)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR17						(1u << 17)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR18						(1u << 18)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR19						(1u << 19)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR20						(1u << 20)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR21						(1u << 21)
	/* Falling trigger event configuration of */
#define EXTI_FTSR_TR22						(1u << 22)

	/* 0x10: Software interrupt event register */
	uint32_t volatile SWIER;
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER0					(1u << 0)
#define EXTI_SWIER_SWIER0_PEND					(0x1u << 0)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER1					(1u << 1)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER2					(1u << 2)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER3					(1u << 3)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER4					(1u << 4)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER5					(1u << 5)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER6					(1u << 6)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER7					(1u << 7)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER8					(1u << 8)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER9					(1u << 9)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER10					(1u << 10)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER11					(1u << 11)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER12					(1u << 12)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER13					(1u << 13)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER14					(1u << 14)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER15					(1u << 15)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER16					(1u << 16)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER17					(1u << 17)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER18					(1u << 18)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER19					(1u << 19)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER20					(1u << 20)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER21					(1u << 21)
	/* Software Interrupt on line */
#define EXTI_SWIER_SWIER22					(1u << 22)

	/* 0x14: Pending register (EXTI_PR) */
	uint32_t volatile PR;
	/* Pending bit 0 */
#define EXTI_PR_PR0						(1u << 0)
#define EXTI_PR_PR0_NOTPENDING					(0x0u << 0)
#define EXTI_PR_PR0_PENDING					(0x1u << 0)
#define EXTI_PR_PR0_CLEAR					(0x1u << 0)
	/* Pending bit 1 */
#define EXTI_PR_PR1						(1u << 1)
	/* Pending bit 2 */
#define EXTI_PR_PR2						(1u << 2)
	/* Pending bit 3 */
#define EXTI_PR_PR3						(1u << 3)
	/* Pending bit 4 */
#define EXTI_PR_PR4						(1u << 4)
	/* Pending bit 5 */
#define EXTI_PR_PR5						(1u << 5)
	/* Pending bit 6 */
#define EXTI_PR_PR6						(1u << 6)
	/* Pending bit 7 */
#define EXTI_PR_PR7						(1u << 7)
	/* Pending bit 8 */
#define EXTI_PR_PR8						(1u << 8)
	/* Pending bit 9 */
#define EXTI_PR_PR9						(1u << 9)
	/* Pending bit 10 */
#define EXTI_PR_PR10						(1u << 10)
	/* Pending bit 11 */
#define EXTI_PR_PR11						(1u << 11)
	/* Pending bit 12 */
#define EXTI_PR_PR12						(1u << 12)
	/* Pending bit 13 */
#define EXTI_PR_PR13						(1u << 13)
	/* Pending bit 14 */
#define EXTI_PR_PR14						(1u << 14)
	/* Pending bit 15 */
#define EXTI_PR_PR15						(1u << 15)
	/* Pending bit 16 */
#define EXTI_PR_PR16						(1u << 16)
	/* Pending bit 17 */
#define EXTI_PR_PR17						(1u << 17)
	/* Pending bit 18 */
#define EXTI_PR_PR18						(1u << 18)
	/* Pending bit 19 */
#define EXTI_PR_PR19						(1u << 19)
	/* Pending bit 20 */
#define EXTI_PR_PR20						(1u << 20)
	/* Pending bit 21 */
#define EXTI_PR_PR21						(1u << 21)
	/* Pending bit 22 */
#define EXTI_PR_PR22						(1u << 22)

