josuah/mcu-stm32f411/registers.h
};


#define FLASH ((struct mcu_flash *)0x40023C00)

struct mcu_flash {

	/* 0x00: Flash access control register */
	uint32_t volatile ACR;
	/* Latency */
#define FLASH_ACR_LATENCY_Msk					(0xFu << 0)
#define FLASH_ACR_LATENCY_Pos					0
#define FLASH_ACR_LATENCY_WS0					(0x0u << 0)
#define FLASH_ACR_LATENCY_WS1					(0x1u << 0)
#define FLASH_ACR_LATENCY_WS2					(0x2u << 0)
#define FLASH_ACR_LATENCY_WS3					(0x3u << 0)
#define FLASH_ACR_LATENCY_WS4					(0x4u << 0)
#define FLASH_ACR_LATENCY_WS5					(0x5u << 0)
#define FLASH_ACR_LATENCY_WS6					(0x6u << 0)
#define FLASH_ACR_LATENCY_WS7					(0x7u << 0)
#define FLASH_ACR_LATENCY_WS8					(0x8u << 0)
#define FLASH_ACR_LATENCY_WS9					(0x9u << 0)
#define FLASH_ACR_LATENCY_WS10					(0xAu << 0)
#define FLASH_ACR_LATENCY_WS11					(0xBu << 0)
#define FLASH_ACR_LATENCY_WS12					(0xCu << 0)
#define FLASH_ACR_LATENCY_WS13					(0xDu << 0)
#define FLASH_ACR_LATENCY_WS14					(0xEu << 0)
#define FLASH_ACR_LATENCY_WS15					(0xFu << 0)
	/* Prefetch enable */
#define FLASH_ACR_PRFTEN					(1u << 8)
	/* Instruction cache enable */
#define FLASH_ACR_ICEN						(1u << 9)
	/* Data cache enable */
#define FLASH_ACR_DCEN						(1u << 10)
	/* Instruction cache reset */
#define FLASH_ACR_ICRST						(1u << 11)
#define FLASH_ACR_ICRST_NOTRESET				(0x0u << 11)
#define FLASH_ACR_ICRST_RESET					(0x1u << 11)
	/* Data cache reset */
#define FLASH_ACR_DCRST						(1u << 12)
#define FLASH_ACR_DCRST_NOTRESET				(0x0u << 12)
#define FLASH_ACR_DCRST_RESET					(0x1u << 12)

	/* 0x04: Flash key register */
	uint32_t volatile KEYR;
	/* FPEC key */
#define FLASH_KEYR_KEY_Msk					(0xFFFFFFFFu << 0)
#define FLASH_KEYR_KEY_Pos					0

	/* 0x08: Flash option key register */
	uint32_t volatile OPTKEYR;
	/* Option byte key */
#define FLASH_OPTKEYR_OPTKEY_Msk				(0xFFFFFFFFu << 0)
#define FLASH_OPTKEYR_OPTKEY_Pos				0

	/* 0x0C: Status register */
	uint32_t volatile SR;
	/* End of operation */
#define FLASH_SR_EOP						(1u << 0)
	/* Operation error */
#define FLASH_SR_OPERR						(1u << 1)
	/* Write protection error */
#define FLASH_SR_WRPERR						(1u << 4)
	/* Programming alignment */
#define FLASH_SR_PGAERR						(1u << 5)
	/* Programming parallelism */
#define FLASH_SR_PGPERR						(1u << 6)
	/* Programming sequence error */
#define FLASH_SR_PGSERR						(1u << 7)
	/* Busy */
#define FLASH_SR_BSY						(1u << 16)

	/* 0x10: Control register */
	uint32_t volatile CR;
	/* Programming */
#define FLASH_CR_PG						(1u << 0)
#define FLASH_CR_PG_PROGRAM					(0x1u << 0)
	/* Sector Erase */
#define FLASH_CR_SER						(1u << 1)
#define FLASH_CR_SER_SECTORERASE				(0x1u << 1)
	/* Mass Erase */
#define FLASH_CR_MER						(1u << 2)
#define FLASH_CR_MER_MASSERASE					(0x1u << 2)
	/* Sector number */
#define FLASH_CR_SNB_Msk					(0xFu << 3)
#define FLASH_CR_SNB_Pos					3
	/* Program size */
#define FLASH_CR_PSIZE_Msk					(0x3u << 8)
#define FLASH_CR_PSIZE_Pos					8
#define FLASH_CR_PSIZE_PSIZE8					(0x0u << 8)
#define FLASH_CR_PSIZE_PSIZE16					(0x1u << 8)
#define FLASH_CR_PSIZE_PSIZE32					(0x2u << 8)
#define FLASH_CR_PSIZE_PSIZE64					(0x3u << 8)
	/* Start */
#define FLASH_CR_STRT						(1u << 16)
#define FLASH_CR_STRT_START					(0x1u << 16)
	/* End of operation interrupt */
#define FLASH_CR_EOPIE						(1u << 24)
	/* Error interrupt enable */
#define FLASH_CR_ERRIE						(1u << 25)
	/* Lock */
#define FLASH_CR_LOCK						(1u << 31)
#define FLASH_CR_LOCK_UNLOCKED					(0x0u << 31)
#define FLASH_CR_LOCK_LOCKED					(0x1u << 31)

	/* 0x14: Flash option control register */
	uint32_t volatile OPTCR;
	/* Option lock */
#define FLASH_OPTCR_OPTLOCK					(1u << 0)
	/* Option start */
#define FLASH_OPTCR_OPTSTRT					(1u << 1)
	/* BOR reset Level */
#define FLASH_OPTCR_BOR_LEV_Msk					(0x3u << 2)
#define FLASH_OPTCR_BOR_LEV_Pos					2
	/* WDG_SW User option bytes */
#define FLASH_OPTCR_WDG_SW					(1u << 5)
	/* nRST_STOP User option */
#define FLASH_OPTCR_NRST_STOP					(1u << 6)
	/* nRST_STDBY User option */
#define FLASH_OPTCR_NRST_STDBY					(1u << 7)
	/* Read protect */
#define FLASH_OPTCR_RDP_Msk					(0xFFu << 8)
#define FLASH_OPTCR_RDP_Pos					8
	/* Not write protect */
#define FLASH_OPTCR_NWRP_Msk					(0xFFFu << 16)
#define FLASH_OPTCR_NWRP_Pos					16

};


#define IWDG ((struct mcu_iwdg *)0x40003000)

struct mcu_iwdg {

	/* 0x00: Key register */
	uint32_t volatile KR;
	/* Key value */
#define IWDG_KR_KEY_Msk						(0xFFFFu << 0)
#define IWDG_KR_KEY_Pos						0
#define IWDG_KR_KEY_ENABLE					(0x5555u << 0)
#define IWDG_KR_KEY_RESET					(0xAAAAu << 0)
#define IWDG_KR_KEY_START					(0xCCCCu << 0)

	/* 0x04: Prescaler register */
	uint32_t volatile PR;
	/* Prescaler divider */
#define IWDG_PR_PR_Msk						(0x7u << 0)
#define IWDG_PR_PR_Pos						0
#define IWDG_PR_PR_DIVIDEBY4					(0x0u << 0)
#define IWDG_PR_PR_DIVIDEBY8					(0x1u << 0)
#define IWDG_PR_PR_DIVIDEBY16					(0x2u << 0)
#define IWDG_PR_PR_DIVIDEBY32					(0x3u << 0)
#define IWDG_PR_PR_DIVIDEBY64					(0x4u << 0)
#define IWDG_PR_PR_DIVIDEBY128					(0x5u << 0)
#define IWDG_PR_PR_DIVIDEBY256					(0x6u << 0)
#define IWDG_PR_PR_DIVIDEBY256BIS				(0x7u << 0)

	/* 0x08: Reload register */
	uint32_t volatile RLR;
	/* Watchdog counter reload */
#define IWDG_RLR_RL_Msk						(0xFFFu << 0)
#define IWDG_RLR_RL_Pos						0

	/* 0x0C: Status register */
	uint32_t volatile const SR;
	/* Watchdog counter reload value */
#define IWDG_SR_RVU						(1u << 1)
	/* Watchdog prescaler value */
#define IWDG_SR_PVU						(1u << 0)

};


#define OTG_FS_DEVICE ((struct mcu_otg_fs_device *)0x50000800)

struct mcu_otg_fs_device {

	/* 0x00: OTG_FS device configuration register */
	uint32_t volatile DCFG;
	/* Device speed */
#define OTG_FS_DEVICE_DCFG_DSPD_Msk				(0x3u << 0)
#define OTG_FS_DEVICE_DCFG_DSPD_Pos				0
	/* Non-zero-length status OUT */
#define OTG_FS_DEVICE_DCFG_NZLSOHSK				(1u << 2)
	/* Device address */
#define OTG_FS_DEVICE_DCFG_DAD_Msk				(0x7Fu << 4)
#define OTG_FS_DEVICE_DCFG_DAD_Pos				4
	/* Periodic frame interval */
#define OTG_FS_DEVICE_DCFG_PFIVL_Msk				(0x3u << 11)
#define OTG_FS_DEVICE_DCFG_PFIVL_Pos				11

	/* 0x04: OTG_FS device control register */
	uint32_t volatile DCTL;
	/* Remote wakeup signaling */
#define OTG_FS_DEVICE_DCTL_RWUSIG				(1u << 0)
	/* Soft disconnect */
#define OTG_FS_DEVICE_DCTL_SDIS					(1u << 1)
	/* Global IN NAK status */
#define OTG_FS_DEVICE_DCTL_GINSTS				(1u << 2)
	/* Global OUT NAK status */
#define OTG_FS_DEVICE_DCTL_GONSTS				(1u << 3)
	/* Test control */
#define OTG_FS_DEVICE_DCTL_TCTL_Msk				(0x7u << 4)
#define OTG_FS_DEVICE_DCTL_TCTL_Pos				4
	/* Set global IN NAK */
#define OTG_FS_DEVICE_DCTL_SGINAK				(1u << 7)
	/* Clear global IN NAK */
#define OTG_FS_DEVICE_DCTL_CGINAK				(1u << 8)
	/* Set global OUT NAK */
#define OTG_FS_DEVICE_DCTL_SGONAK				(1u << 9)
	/* Clear global OUT NAK */
#define OTG_FS_DEVICE_DCTL_CGONAK				(1u << 10)
	/* Power-on programming done */
#define OTG_FS_DEVICE_DCTL_POPRGDNE				(1u << 11)

	/* 0x08: OTG_FS device status register */
	uint32_t volatile const DSTS;
	/* Suspend status */
#define OTG_FS_DEVICE_DSTS_SUSPSTS				(1u << 0)
	/* Enumerated speed */
#define OTG_FS_DEVICE_DSTS_ENUMSPD_Msk				(0x3u << 1)
#define OTG_FS_DEVICE_DSTS_ENUMSPD_Pos				1
	/* Erratic error */
#define OTG_FS_DEVICE_DSTS_EERR					(1u << 3)
	/* Frame number of the received */
#define OTG_FS_DEVICE_DSTS_FNSOF_Msk				(0x3FFFu << 8)
#define OTG_FS_DEVICE_DSTS_FNSOF_Pos				8

	/* 0x0C */
	uint8_t RESERVED0[0x10u-0x0Cu];

	/* 0x10: OTG_FS device IN endpoint common interrupt */
	uint32_t volatile DIEPMSK;
	/* Transfer completed interrupt */
#define OTG_FS_DEVICE_DIEPMSK_XFRCM				(1u << 0)
	/* Endpoint disabled interrupt */
#define OTG_FS_DEVICE_DIEPMSK_EPDM				(1u << 1)
	/* Timeout condition mask (Non-isochronous */
#define OTG_FS_DEVICE_DIEPMSK_TOM				(1u << 3)
	/* IN token received when TxFIFO empty */
#define OTG_FS_DEVICE_DIEPMSK_ITTXFEMSK				(1u << 4)
	/* IN token received with EP mismatch */
#define OTG_FS_DEVICE_DIEPMSK_INEPNMM				(1u << 5)
	/* IN endpoint NAK effective */
#define OTG_FS_DEVICE_DIEPMSK_INEPNEM				(1u << 6)

	/* 0x14: OTG_FS device OUT endpoint common interrupt */
	uint32_t volatile DOEPMSK;
	/* Transfer completed interrupt */
#define OTG_FS_DEVICE_DOEPMSK_XFRCM				(1u << 0)
	/* Endpoint disabled interrupt */
#define OTG_FS_DEVICE_DOEPMSK_EPDM				(1u << 1)
	/* SETUP phase done mask */
#define OTG_FS_DEVICE_DOEPMSK_STUPM				(1u << 3)
	/* OUT token received when endpoint */
#define OTG_FS_DEVICE_DOEPMSK_OTEPDM				(1u << 4)

	/* 0x18: OTG_FS device all endpoints interrupt */
	uint32_t volatile const DAINT;
	/* IN endpoint interrupt bits */
#define OTG_FS_DEVICE_DAINT_IEPINT_Msk				(0xFFFFu << 0)
#define OTG_FS_DEVICE_DAINT_IEPINT_Pos				0
	/* OUT endpoint interrupt */
#define OTG_FS_DEVICE_DAINT_OEPINT_Msk				(0xFFFFu << 16)
#define OTG_FS_DEVICE_DAINT_OEPINT_Pos				16

	/* 0x1C: OTG_FS all endpoints interrupt mask register */
	uint32_t volatile DAINTMSK;
	/* IN EP interrupt mask bits */
#define OTG_FS_DEVICE_DAINTMSK_IEPM_Msk				(0xFFFFu << 0)
#define OTG_FS_DEVICE_DAINTMSK_IEPM_Pos				0
	/* OUT EP interrupt mask bits */
#define OTG_FS_DEVICE_DAINTMSK_OEPM_Msk				(0xFFFFu << 16)
#define OTG_FS_DEVICE_DAINTMSK_OEPM_Pos				16

