josuah/mcu-stm32f411/registers.h
	/* 0x20 */
	uint8_t RESERVED1[0x28u-0x20u];

	/* 0x28: OTG_FS device VBUS discharge time */
	uint32_t volatile DVBUSDIS;
	/* Device VBUS discharge time */
#define OTG_FS_DEVICE_DVBUSDIS_VBUSDT_Msk			(0xFFFFu << 0)
#define OTG_FS_DEVICE_DVBUSDIS_VBUSDT_Pos			0

	/* 0x2C: OTG_FS device VBUS pulsing time */
	uint32_t volatile DVBUSPULSE;
	/* Device VBUS pulsing time */
#define OTG_FS_DEVICE_DVBUSPULSE_DVBUSP_Msk			(0xFFFu << 0)
#define OTG_FS_DEVICE_DVBUSPULSE_DVBUSP_Pos			0

	/* 0x30 */
	uint8_t RESERVED2[0x34u-0x30u];

	/* 0x34: OTG_FS device IN endpoint FIFO empty */
	uint32_t volatile DIEPEMPMSK;
	/* IN EP Tx FIFO empty interrupt mask */
#define OTG_FS_DEVICE_DIEPEMPMSK_INEPTXFEM_Msk			(0xFFFFu << 0)
#define OTG_FS_DEVICE_DIEPEMPMSK_INEPTXFEM_Pos			0

	/* 0x38 */
	uint8_t RESERVED3[0x100u-0x38u];

	/* 0x100: OTG_FS device control IN endpoint 0 control */
	uint32_t volatile DIEPCTL0;
	/* Maximum packet size */
#define OTG_FS_DEVICE_DIEPCTL0_MPSIZ_Msk			(0x3u << 0)
#define OTG_FS_DEVICE_DIEPCTL0_MPSIZ_Pos			0
	/* USB active endpoint */
#define OTG_FS_DEVICE_DIEPCTL0_USBAEP				(1u << 15)
	/* NAK status */
#define OTG_FS_DEVICE_DIEPCTL0_NAKSTS				(1u << 17)
	/* Endpoint type */
#define OTG_FS_DEVICE_DIEPCTL0_EPTYP_Msk			(0x3u << 18)
#define OTG_FS_DEVICE_DIEPCTL0_EPTYP_Pos			18
	/* STALL handshake */
#define OTG_FS_DEVICE_DIEPCTL0_STALL				(1u << 21)
	/* TxFIFO number */
#define OTG_FS_DEVICE_DIEPCTL0_TXFNUM_Msk			(0xFu << 22)
#define OTG_FS_DEVICE_DIEPCTL0_TXFNUM_Pos			22
	/* Clear NAK */
#define OTG_FS_DEVICE_DIEPCTL0_CNAK				(1u << 26)
	/* Set NAK */
#define OTG_FS_DEVICE_DIEPCTL0_SNAK				(1u << 27)
	/* Endpoint disable */
#define OTG_FS_DEVICE_DIEPCTL0_EPDIS				(1u << 30)
	/* Endpoint enable */
#define OTG_FS_DEVICE_DIEPCTL0_EPENA				(1u << 31)

	/* 0x104 */
	uint8_t RESERVED4[0x120u-0x104u];

	/* 0x120: OTG device endpoint-1 control */
	uint32_t volatile DIEPCTL1;
	/* EPENA */
#define OTG_FS_DEVICE_DIEPCTL1_EPENA				(1u << 31)
	/* EPDIS */
#define OTG_FS_DEVICE_DIEPCTL1_EPDIS				(1u << 30)
	/* SODDFRM/SD1PID */
#define OTG_FS_DEVICE_DIEPCTL1_SODDFRM_SD1PID			(1u << 29)
	/* SD0PID/SEVNFRM */
#define OTG_FS_DEVICE_DIEPCTL1_SD0PID_SEVNFRM			(1u << 28)
	/* SNAK */
#define OTG_FS_DEVICE_DIEPCTL1_SNAK				(1u << 27)
	/* CNAK */
#define OTG_FS_DEVICE_DIEPCTL1_CNAK				(1u << 26)
	/* TXFNUM */
#define OTG_FS_DEVICE_DIEPCTL1_TXFNUM_Msk			(0xFu << 22)
#define OTG_FS_DEVICE_DIEPCTL1_TXFNUM_Pos			22
	/* STALL */
#define OTG_FS_DEVICE_DIEPCTL1_STALL				(1u << 21)
	/* EPTYP */
#define OTG_FS_DEVICE_DIEPCTL1_EPTYP_Msk			(0x3u << 18)
#define OTG_FS_DEVICE_DIEPCTL1_EPTYP_Pos			18
	/* NAKSTS */
#define OTG_FS_DEVICE_DIEPCTL1_NAKSTS				(1u << 17)
	/* EONUM/DPID */
#define OTG_FS_DEVICE_DIEPCTL1_EONUM_DPID			(1u << 16)
	/* USBAEP */
#define OTG_FS_DEVICE_DIEPCTL1_USBAEP				(1u << 15)
	/* MPSIZ */
#define OTG_FS_DEVICE_DIEPCTL1_MPSIZ_Msk			(0x7FFu << 0)
#define OTG_FS_DEVICE_DIEPCTL1_MPSIZ_Pos			0

	/* 0x124 */
	uint8_t RESERVED5[0x300u-0x124u];

	/* 0x300: device endpoint-0 control */
	uint32_t volatile DOEPCTL0;
	/* EPENA */
#define OTG_FS_DEVICE_DOEPCTL0_EPENA				(1u << 31)
	/* EPDIS */
#define OTG_FS_DEVICE_DOEPCTL0_EPDIS				(1u << 30)
	/* SNAK */
#define OTG_FS_DEVICE_DOEPCTL0_SNAK				(1u << 27)
	/* CNAK */
#define OTG_FS_DEVICE_DOEPCTL0_CNAK				(1u << 26)
	/* STALL */
#define OTG_FS_DEVICE_DOEPCTL0_STALL				(1u << 21)
	/* SNPM */
#define OTG_FS_DEVICE_DOEPCTL0_SNPM				(1u << 20)
	/* EPTYP */
#define OTG_FS_DEVICE_DOEPCTL0_EPTYP_Msk			(0x3u << 18)
#define OTG_FS_DEVICE_DOEPCTL0_EPTYP_Pos			18
	/* NAKSTS */
#define OTG_FS_DEVICE_DOEPCTL0_NAKSTS				(1u << 17)
	/* USBAEP */
#define OTG_FS_DEVICE_DOEPCTL0_USBAEP				(1u << 15)
	/* MPSIZ */
#define OTG_FS_DEVICE_DOEPCTL0_MPSIZ_Msk			(0x3u << 0)
#define OTG_FS_DEVICE_DOEPCTL0_MPSIZ_Pos			0

	/* 0x304 */
	uint8_t RESERVED6[0x320u-0x304u];

	/* 0x320: device endpoint-1 control */
	uint32_t volatile DOEPCTL1;
	/* EPENA */
#define OTG_FS_DEVICE_DOEPCTL1_EPENA				(1u << 31)
	/* EPDIS */
#define OTG_FS_DEVICE_DOEPCTL1_EPDIS				(1u << 30)
	/* SODDFRM */
#define OTG_FS_DEVICE_DOEPCTL1_SODDFRM				(1u << 29)
	/* SD0PID/SEVNFRM */
#define OTG_FS_DEVICE_DOEPCTL1_SD0PID_SEVNFRM			(1u << 28)
	/* SNAK */
#define OTG_FS_DEVICE_DOEPCTL1_SNAK				(1u << 27)
	/* CNAK */
#define OTG_FS_DEVICE_DOEPCTL1_CNAK				(1u << 26)
	/* STALL */
#define OTG_FS_DEVICE_DOEPCTL1_STALL				(1u << 21)
	/* SNPM */
#define OTG_FS_DEVICE_DOEPCTL1_SNPM				(1u << 20)
	/* EPTYP */
#define OTG_FS_DEVICE_DOEPCTL1_EPTYP_Msk			(0x3u << 18)
#define OTG_FS_DEVICE_DOEPCTL1_EPTYP_Pos			18
	/* NAKSTS */
#define OTG_FS_DEVICE_DOEPCTL1_NAKSTS				(1u << 17)
	/* EONUM/DPID */
#define OTG_FS_DEVICE_DOEPCTL1_EONUM_DPID			(1u << 16)
	/* USBAEP */
#define OTG_FS_DEVICE_DOEPCTL1_USBAEP				(1u << 15)
	/* MPSIZ */
#define OTG_FS_DEVICE_DOEPCTL1_MPSIZ_Msk			(0x7FFu << 0)
#define OTG_FS_DEVICE_DOEPCTL1_MPSIZ_Pos			0

	/* 0x108: device endpoint-x interrupt */
	uint32_t volatile DIEPINT0;
	/* TXFE */
#define OTG_FS_DEVICE_DIEPINT0_TXFE				(1u << 7)
	/* INEPNE */
#define OTG_FS_DEVICE_DIEPINT0_INEPNE				(1u << 6)
	/* ITTXFE */
#define OTG_FS_DEVICE_DIEPINT0_ITTXFE				(1u << 4)
	/* TOC */
#define OTG_FS_DEVICE_DIEPINT0_TOC				(1u << 3)
	/* EPDISD */
#define OTG_FS_DEVICE_DIEPINT0_EPDISD				(1u << 1)
	/* XFRC */
#define OTG_FS_DEVICE_DIEPINT0_XFRC				(1u << 0)

	/* 0x10C */
	uint8_t RESERVED7[0x128u-0x10Cu];

	/* 0x128: device endpoint-1 interrupt */
	uint32_t volatile DIEPINT1;
	/* TXFE */
#define OTG_FS_DEVICE_DIEPINT1_TXFE				(1u << 7)
	/* INEPNE */
#define OTG_FS_DEVICE_DIEPINT1_INEPNE				(1u << 6)
	/* ITTXFE */
#define OTG_FS_DEVICE_DIEPINT1_ITTXFE				(1u << 4)
	/* TOC */
#define OTG_FS_DEVICE_DIEPINT1_TOC				(1u << 3)
	/* EPDISD */
#define OTG_FS_DEVICE_DIEPINT1_EPDISD				(1u << 1)
	/* XFRC */
#define OTG_FS_DEVICE_DIEPINT1_XFRC				(1u << 0)

	/* 0x12C */
	uint8_t RESERVED8[0x148u-0x12Cu];

	/* 0x148: device endpoint-2 interrupt */
	uint32_t volatile DIEPINT2;
	/* TXFE */
#define OTG_FS_DEVICE_DIEPINT2_TXFE				(1u << 7)
	/* INEPNE */
#define OTG_FS_DEVICE_DIEPINT2_INEPNE				(1u << 6)
	/* ITTXFE */
#define OTG_FS_DEVICE_DIEPINT2_ITTXFE				(1u << 4)
	/* TOC */
#define OTG_FS_DEVICE_DIEPINT2_TOC				(1u << 3)
	/* EPDISD */
#define OTG_FS_DEVICE_DIEPINT2_EPDISD				(1u << 1)
	/* XFRC */
#define OTG_FS_DEVICE_DIEPINT2_XFRC				(1u << 0)

	/* 0x14C */
	uint8_t RESERVED9[0x168u-0x14Cu];

	/* 0x168: device endpoint-3 interrupt */
	uint32_t volatile DIEPINT3;
	/* TXFE */
#define OTG_FS_DEVICE_DIEPINT3_TXFE				(1u << 7)
	/* INEPNE */
#define OTG_FS_DEVICE_DIEPINT3_INEPNE				(1u << 6)
	/* ITTXFE */
#define OTG_FS_DEVICE_DIEPINT3_ITTXFE				(1u << 4)
	/* TOC */
#define OTG_FS_DEVICE_DIEPINT3_TOC				(1u << 3)
	/* EPDISD */
#define OTG_FS_DEVICE_DIEPINT3_EPDISD				(1u << 1)
	/* XFRC */
#define OTG_FS_DEVICE_DIEPINT3_XFRC				(1u << 0)

	/* 0x16C */
	uint8_t RESERVED10[0x308u-0x16Cu];

	/* 0x308: device endpoint-0 interrupt */
	uint32_t volatile DOEPINT0;
	/* B2BSTUP */
#define OTG_FS_DEVICE_DOEPINT0_B2BSTUP				(1u << 6)
	/* OTEPDIS */
#define OTG_FS_DEVICE_DOEPINT0_OTEPDIS				(1u << 4)
	/* STUP */
#define OTG_FS_DEVICE_DOEPINT0_STUP				(1u << 3)
	/* EPDISD */
#define OTG_FS_DEVICE_DOEPINT0_EPDISD				(1u << 1)
	/* XFRC */
#define OTG_FS_DEVICE_DOEPINT0_XFRC				(1u << 0)

	/* 0x30C */
	uint8_t RESERVED11[0x328u-0x30Cu];

	/* 0x328: device endpoint-1 interrupt */
	uint32_t volatile DOEPINT1;
	/* B2BSTUP */
#define OTG_FS_DEVICE_DOEPINT1_B2BSTUP				(1u << 6)
	/* OTEPDIS */
#define OTG_FS_DEVICE_DOEPINT1_OTEPDIS				(1u << 4)
	/* STUP */
#define OTG_FS_DEVICE_DOEPINT1_STUP				(1u << 3)
	/* EPDISD */
#define OTG_FS_DEVICE_DOEPINT1_EPDISD				(1u << 1)
	/* XFRC */
#define OTG_FS_DEVICE_DOEPINT1_XFRC				(1u << 0)

	/* 0x32C */
	uint8_t RESERVED12[0x348u-0x32Cu];

	/* 0x348: device endpoint-2 interrupt */
	uint32_t volatile DOEPINT2;
	/* B2BSTUP */
#define OTG_FS_DEVICE_DOEPINT2_B2BSTUP				(1u << 6)
	/* OTEPDIS */
#define OTG_FS_DEVICE_DOEPINT2_OTEPDIS				(1u << 4)
	/* STUP */
#define OTG_FS_DEVICE_DOEPINT2_STUP				(1u << 3)
	/* EPDISD */
#define OTG_FS_DEVICE_DOEPINT2_EPDISD				(1u << 1)
	/* XFRC */
#define OTG_FS_DEVICE_DOEPINT2_XFRC				(1u << 0)

	/* 0x34C */
	uint8_t RESERVED13[0x368u-0x34Cu];

