josuah/mcu-stm32f411/registers.h
	/* 0x368: device endpoint-3 interrupt */
	uint32_t volatile DOEPINT3;
	/* B2BSTUP */
#define OTG_FS_DEVICE_DOEPINT3_B2BSTUP				(1u << 6)
	/* OTEPDIS */
#define OTG_FS_DEVICE_DOEPINT3_OTEPDIS				(1u << 4)
	/* STUP */
#define OTG_FS_DEVICE_DOEPINT3_STUP				(1u << 3)
	/* EPDISD */
#define OTG_FS_DEVICE_DOEPINT3_EPDISD				(1u << 1)
	/* XFRC */
#define OTG_FS_DEVICE_DOEPINT3_XFRC				(1u << 0)

	/* 0x110: device endpoint-0 transfer size */
	uint32_t volatile DIEPTSIZ0;
	/* Packet count */
#define OTG_FS_DEVICE_DIEPTSIZ0_PKTCNT_Msk			(0x3u << 19)
#define OTG_FS_DEVICE_DIEPTSIZ0_PKTCNT_Pos			19
	/* Transfer size */
#define OTG_FS_DEVICE_DIEPTSIZ0_XFRSIZ_Msk			(0x7Fu << 0)
#define OTG_FS_DEVICE_DIEPTSIZ0_XFRSIZ_Pos			0

	/* 0x114 */
	uint8_t RESERVED14[0x310u-0x114u];

	/* 0x310: device OUT endpoint-0 transfer size */
	uint32_t volatile DOEPTSIZ0;
	/* SETUP packet count */
#define OTG_FS_DEVICE_DOEPTSIZ0_STUPCNT_Msk			(0x3u << 29)
#define OTG_FS_DEVICE_DOEPTSIZ0_STUPCNT_Pos			29
	/* Packet count */
#define OTG_FS_DEVICE_DOEPTSIZ0_PKTCNT				(1u << 19)
	/* Transfer size */
#define OTG_FS_DEVICE_DOEPTSIZ0_XFRSIZ_Msk			(0x7Fu << 0)
#define OTG_FS_DEVICE_DOEPTSIZ0_XFRSIZ_Pos			0

	/* 0x130: device endpoint-1 transfer size */
	uint32_t volatile DIEPTSIZ1;
	/* Multi count */
#define OTG_FS_DEVICE_DIEPTSIZ1_MCNT_Msk			(0x3u << 29)
#define OTG_FS_DEVICE_DIEPTSIZ1_MCNT_Pos			29
	/* Packet count */
#define OTG_FS_DEVICE_DIEPTSIZ1_PKTCNT_Msk			(0x3FFu << 19)
#define OTG_FS_DEVICE_DIEPTSIZ1_PKTCNT_Pos			19
	/* Transfer size */
#define OTG_FS_DEVICE_DIEPTSIZ1_XFRSIZ_Msk			(0x7FFFFu << 0)
#define OTG_FS_DEVICE_DIEPTSIZ1_XFRSIZ_Pos			0

	/* 0x134 */
	uint8_t RESERVED15[0x150u-0x134u];

	/* 0x150: device endpoint-2 transfer size */
	uint32_t volatile DIEPTSIZ2;
	/* Multi count */
#define OTG_FS_DEVICE_DIEPTSIZ2_MCNT_Msk			(0x3u << 29)
#define OTG_FS_DEVICE_DIEPTSIZ2_MCNT_Pos			29
	/* Packet count */
#define OTG_FS_DEVICE_DIEPTSIZ2_PKTCNT_Msk			(0x3FFu << 19)
#define OTG_FS_DEVICE_DIEPTSIZ2_PKTCNT_Pos			19
	/* Transfer size */
#define OTG_FS_DEVICE_DIEPTSIZ2_XFRSIZ_Msk			(0x7FFFFu << 0)
#define OTG_FS_DEVICE_DIEPTSIZ2_XFRSIZ_Pos			0

	/* 0x154 */
	uint8_t RESERVED16[0x170u-0x154u];

	/* 0x170: device endpoint-3 transfer size */
	uint32_t volatile DIEPTSIZ3;
	/* Multi count */
#define OTG_FS_DEVICE_DIEPTSIZ3_MCNT_Msk			(0x3u << 29)
#define OTG_FS_DEVICE_DIEPTSIZ3_MCNT_Pos			29
	/* Packet count */
#define OTG_FS_DEVICE_DIEPTSIZ3_PKTCNT_Msk			(0x3FFu << 19)
#define OTG_FS_DEVICE_DIEPTSIZ3_PKTCNT_Pos			19
	/* Transfer size */
#define OTG_FS_DEVICE_DIEPTSIZ3_XFRSIZ_Msk			(0x7FFFFu << 0)
#define OTG_FS_DEVICE_DIEPTSIZ3_XFRSIZ_Pos			0

	/* 0x118: OTG_FS device IN endpoint transmit FIFO */
	uint32_t volatile const DTXFSTS0;
	/* IN endpoint TxFIFO space */
#define OTG_FS_DEVICE_DTXFSTS0_INEPTFSAV_Msk			(0xFFFFu << 0)
#define OTG_FS_DEVICE_DTXFSTS0_INEPTFSAV_Pos			0

	/* 0x11C */
	uint8_t RESERVED17[0x138u-0x11Cu];

	/* 0x138: OTG_FS device IN endpoint transmit FIFO */
	uint32_t volatile const DTXFSTS1;
	/* IN endpoint TxFIFO space */
#define OTG_FS_DEVICE_DTXFSTS1_INEPTFSAV_Msk			(0xFFFFu << 0)
#define OTG_FS_DEVICE_DTXFSTS1_INEPTFSAV_Pos			0

	/* 0x13C */
	uint8_t RESERVED18[0x158u-0x13Cu];

	/* 0x158: OTG_FS device IN endpoint transmit FIFO */
	uint32_t volatile const DTXFSTS2;
	/* IN endpoint TxFIFO space */
#define OTG_FS_DEVICE_DTXFSTS2_INEPTFSAV_Msk			(0xFFFFu << 0)
#define OTG_FS_DEVICE_DTXFSTS2_INEPTFSAV_Pos			0

	/* 0x15C */
	uint8_t RESERVED19[0x178u-0x15Cu];

	/* 0x178: OTG_FS device IN endpoint transmit FIFO */
	uint32_t volatile const DTXFSTS3;
	/* IN endpoint TxFIFO space */
#define OTG_FS_DEVICE_DTXFSTS3_INEPTFSAV_Msk			(0xFFFFu << 0)
#define OTG_FS_DEVICE_DTXFSTS3_INEPTFSAV_Pos			0

	/* 0x17C */
	uint8_t RESERVED20[0x330u-0x17Cu];

	/* 0x330: device OUT endpoint-1 transfer size */
	uint32_t volatile DOEPTSIZ1;
	/* Received data PID/SETUP packet */
#define OTG_FS_DEVICE_DOEPTSIZ1_RXDPID_STUPCNT_Msk		(0x3u << 29)
#define OTG_FS_DEVICE_DOEPTSIZ1_RXDPID_STUPCNT_Pos		29
	/* Packet count */
#define OTG_FS_DEVICE_DOEPTSIZ1_PKTCNT_Msk			(0x3FFu << 19)
#define OTG_FS_DEVICE_DOEPTSIZ1_PKTCNT_Pos			19
	/* Transfer size */
#define OTG_FS_DEVICE_DOEPTSIZ1_XFRSIZ_Msk			(0x7FFFFu << 0)
#define OTG_FS_DEVICE_DOEPTSIZ1_XFRSIZ_Pos			0

	/* 0x334 */
	uint8_t RESERVED21[0x350u-0x334u];

	/* 0x350: device OUT endpoint-2 transfer size */
	uint32_t volatile DOEPTSIZ2;
	/* Received data PID/SETUP packet */
#define OTG_FS_DEVICE_DOEPTSIZ2_RXDPID_STUPCNT_Msk		(0x3u << 29)
#define OTG_FS_DEVICE_DOEPTSIZ2_RXDPID_STUPCNT_Pos		29
	/* Packet count */
#define OTG_FS_DEVICE_DOEPTSIZ2_PKTCNT_Msk			(0x3FFu << 19)
#define OTG_FS_DEVICE_DOEPTSIZ2_PKTCNT_Pos			19
	/* Transfer size */
#define OTG_FS_DEVICE_DOEPTSIZ2_XFRSIZ_Msk			(0x7FFFFu << 0)
#define OTG_FS_DEVICE_DOEPTSIZ2_XFRSIZ_Pos			0

	/* 0x354 */
	uint8_t RESERVED22[0x370u-0x354u];

	/* 0x370: device OUT endpoint-3 transfer size */
	uint32_t volatile DOEPTSIZ3;
	/* Received data PID/SETUP packet */
#define OTG_FS_DEVICE_DOEPTSIZ3_RXDPID_STUPCNT_Msk		(0x3u << 29)
#define OTG_FS_DEVICE_DOEPTSIZ3_RXDPID_STUPCNT_Pos		29
	/* Packet count */
#define OTG_FS_DEVICE_DOEPTSIZ3_PKTCNT_Msk			(0x3FFu << 19)
#define OTG_FS_DEVICE_DOEPTSIZ3_PKTCNT_Pos			19
	/* Transfer size */
#define OTG_FS_DEVICE_DOEPTSIZ3_XFRSIZ_Msk			(0x7FFFFu << 0)
#define OTG_FS_DEVICE_DOEPTSIZ3_XFRSIZ_Pos			0

};


#define OTG_FS_GLOBAL ((struct mcu_otg_fs_global *)0x50000000)

struct mcu_otg_fs_global {

	/* 0x00: OTG_FS control and status register */
	uint32_t volatile GOTGCTL;
	/* Session request success */
#define OTG_FS_GLOBAL_GOTGCTL_SRQSCS				(1u << 0)
	/* Session request */
#define OTG_FS_GLOBAL_GOTGCTL_SRQ				(1u << 1)
	/* Host negotiation success */
#define OTG_FS_GLOBAL_GOTGCTL_HNGSCS				(1u << 8)
	/* HNP request */
#define OTG_FS_GLOBAL_GOTGCTL_HNPRQ				(1u << 9)
	/* Host set HNP enable */
#define OTG_FS_GLOBAL_GOTGCTL_HSHNPEN				(1u << 10)
	/* Device HNP enabled */
#define OTG_FS_GLOBAL_GOTGCTL_DHNPEN				(1u << 11)
	/* Connector ID status */
#define OTG_FS_GLOBAL_GOTGCTL_CIDSTS				(1u << 16)
	/* Long/short debounce time */
#define OTG_FS_GLOBAL_GOTGCTL_DBCT				(1u << 17)
	/* A-session valid */
#define OTG_FS_GLOBAL_GOTGCTL_ASVLD				(1u << 18)
	/* B-session valid */
#define OTG_FS_GLOBAL_GOTGCTL_BSVLD				(1u << 19)

	/* 0x04: OTG_FS interrupt register */
	uint32_t volatile GOTGINT;
	/* Session end detected */
#define OTG_FS_GLOBAL_GOTGINT_SEDET				(1u << 2)
	/* Session request success status */
#define OTG_FS_GLOBAL_GOTGINT_SRSSCHG				(1u << 8)
	/* Host negotiation success status */
#define OTG_FS_GLOBAL_GOTGINT_HNSSCHG				(1u << 9)
	/* Host negotiation detected */
#define OTG_FS_GLOBAL_GOTGINT_HNGDET				(1u << 17)
	/* A-device timeout change */
#define OTG_FS_GLOBAL_GOTGINT_ADTOCHG				(1u << 18)
	/* Debounce done */
#define OTG_FS_GLOBAL_GOTGINT_DBCDNE				(1u << 19)

	/* 0x08: OTG_FS AHB configuration register */
	uint32_t volatile GAHBCFG;
	/* Global interrupt mask */
#define OTG_FS_GLOBAL_GAHBCFG_GINT				(1u << 0)
	/* TxFIFO empty level */
#define OTG_FS_GLOBAL_GAHBCFG_TXFELVL				(1u << 7)
	/* Periodic TxFIFO empty */
#define OTG_FS_GLOBAL_GAHBCFG_PTXFELVL				(1u << 8)

	/* 0x0C: OTG_FS USB configuration register */
	uint32_t volatile GUSBCFG;
	/* FS timeout calibration */
#define OTG_FS_GLOBAL_GUSBCFG_TOCAL_Msk				(0x7u << 0)
#define OTG_FS_GLOBAL_GUSBCFG_TOCAL_Pos				0
	/* Full Speed serial transceiver */
#define OTG_FS_GLOBAL_GUSBCFG_PHYSEL				(1u << 6)
	/* SRP-capable */
#define OTG_FS_GLOBAL_GUSBCFG_SRPCAP				(1u << 8)
	/* HNP-capable */
#define OTG_FS_GLOBAL_GUSBCFG_HNPCAP				(1u << 9)
	/* USB turnaround time */
#define OTG_FS_GLOBAL_GUSBCFG_TRDT_Msk				(0xFu << 10)
#define OTG_FS_GLOBAL_GUSBCFG_TRDT_Pos				10
	/* Force host mode */
#define OTG_FS_GLOBAL_GUSBCFG_FHMOD				(1u << 29)
	/* Force device mode */
#define OTG_FS_GLOBAL_GUSBCFG_FDMOD				(1u << 30)
	/* Corrupt Tx packet */
#define OTG_FS_GLOBAL_GUSBCFG_CTXPKT				(1u << 31)

	/* 0x10: OTG_FS reset register */
	uint32_t volatile GRSTCTL;
	/* Core soft reset */
#define OTG_FS_GLOBAL_GRSTCTL_CSRST				(1u << 0)
	/* HCLK soft reset */
#define OTG_FS_GLOBAL_GRSTCTL_HSRST				(1u << 1)
	/* Host frame counter reset */
#define OTG_FS_GLOBAL_GRSTCTL_FCRST				(1u << 2)
	/* RxFIFO flush */
#define OTG_FS_GLOBAL_GRSTCTL_RXFFLSH				(1u << 4)
	/* TxFIFO flush */
#define OTG_FS_GLOBAL_GRSTCTL_TXFFLSH				(1u << 5)
	/* TxFIFO number */
#define OTG_FS_GLOBAL_GRSTCTL_TXFNUM_Msk			(0x1Fu << 6)
#define OTG_FS_GLOBAL_GRSTCTL_TXFNUM_Pos			6
	/* AHB master idle */
#define OTG_FS_GLOBAL_GRSTCTL_AHBIDL				(1u << 31)

	/* 0x14: OTG_FS core interrupt register */
	uint32_t volatile GINTSTS;
	/* Current mode of operation */
#define OTG_FS_GLOBAL_GINTSTS_CMOD				(1u << 0)
	/* Mode mismatch interrupt */
#define OTG_FS_GLOBAL_GINTSTS_MMIS				(1u << 1)
	/* OTG interrupt */
#define OTG_FS_GLOBAL_GINTSTS_OTGINT				(1u << 2)
	/* Start of frame */
#define OTG_FS_GLOBAL_GINTSTS_SOF				(1u << 3)
	/* RxFIFO non-empty */
#define OTG_FS_GLOBAL_GINTSTS_RXFLVL				(1u << 4)
	/* Non-periodic TxFIFO empty */
#define OTG_FS_GLOBAL_GINTSTS_NPTXFE				(1u << 5)
	/* Global IN non-periodic NAK */
#define OTG_FS_GLOBAL_GINTSTS_GINAKEFF				(1u << 6)
	/* Global OUT NAK effective */
#define OTG_FS_GLOBAL_GINTSTS_GOUTNAKEFF			(1u << 7)
	/* Early suspend */
#define OTG_FS_GLOBAL_GINTSTS_ESUSP				(1u << 10)
	/* USB suspend */
#define OTG_FS_GLOBAL_GINTSTS_USBSUSP				(1u << 11)
	/* USB reset */
#define OTG_FS_GLOBAL_GINTSTS_USBRST				(1u << 12)
	/* Enumeration done */
#define OTG_FS_GLOBAL_GINTSTS_ENUMDNE				(1u << 13)
	/* Isochronous OUT packet dropped */
#define OTG_FS_GLOBAL_GINTSTS_ISOODRP				(1u << 14)
	/* End of periodic frame */
#define OTG_FS_GLOBAL_GINTSTS_EOPF				(1u << 15)
	/* IN endpoint interrupt */
#define OTG_FS_GLOBAL_GINTSTS_IEPINT				(1u << 18)
	/* OUT endpoint interrupt */
#define OTG_FS_GLOBAL_GINTSTS_OEPINT				(1u << 19)
	/* Incomplete isochronous IN */
#define OTG_FS_GLOBAL_GINTSTS_IISOIXFR				(1u << 20)
	/* Incomplete periodic transfer(Host */
#define OTG_FS_GLOBAL_GINTSTS_IPXFR_INCOMPISOOUT		(1u << 21)
	/* Host port interrupt */
#define OTG_FS_GLOBAL_GINTSTS_HPRTINT				(1u << 24)
	/* Host channels interrupt */
#define OTG_FS_GLOBAL_GINTSTS_HCINT				(1u << 25)
	/* Periodic TxFIFO empty */
#define OTG_FS_GLOBAL_GINTSTS_PTXFE				(1u << 26)
	/* Connector ID status change */
#define OTG_FS_GLOBAL_GINTSTS_CIDSCHG				(1u << 28)
	/* Disconnect detected */
#define OTG_FS_GLOBAL_GINTSTS_DISCINT				(1u << 29)
	/* Session request/new session detected */
#define OTG_FS_GLOBAL_GINTSTS_SRQINT				(1u << 30)
	/* Resume/remote wakeup detected */
#define OTG_FS_GLOBAL_GINTSTS_WKUPINT				(1u << 31)

	/* 0x18: OTG_FS interrupt mask register */
	uint32_t volatile GINTMSK;
	/* Mode mismatch interrupt */
#define OTG_FS_GLOBAL_GINTMSK_MMISM				(1u << 1)
	/* OTG interrupt mask */
#define OTG_FS_GLOBAL_GINTMSK_OTGINT				(1u << 2)
	/* Start of frame mask */
#define OTG_FS_GLOBAL_GINTMSK_SOFM				(1u << 3)
	/* Receive FIFO non-empty */
#define OTG_FS_GLOBAL_GINTMSK_RXFLVLM				(1u << 4)
	/* Non-periodic TxFIFO empty */
#define OTG_FS_GLOBAL_GINTMSK_NPTXFEM				(1u << 5)
	/* Global non-periodic IN NAK effective */
#define OTG_FS_GLOBAL_GINTMSK_GINAKEFFM				(1u << 6)
	/* Global OUT NAK effective */
#define OTG_FS_GLOBAL_GINTMSK_GONAKEFFM				(1u << 7)
	/* Early suspend mask */
#define OTG_FS_GLOBAL_GINTMSK_ESUSPM				(1u << 10)
	/* USB suspend mask */
#define OTG_FS_GLOBAL_GINTMSK_USBSUSPM				(1u << 11)
	/* USB reset mask */
#define OTG_FS_GLOBAL_GINTMSK_USBRST				(1u << 12)
	/* Enumeration done mask */
#define OTG_FS_GLOBAL_GINTMSK_ENUMDNEM				(1u << 13)
	/* Isochronous OUT packet dropped interrupt */
#define OTG_FS_GLOBAL_GINTMSK_ISOODRPM				(1u << 14)
	/* End of periodic frame interrupt */
#define OTG_FS_GLOBAL_GINTMSK_EOPFM				(1u << 15)
	/* Endpoint mismatch interrupt */
#define OTG_FS_GLOBAL_GINTMSK_EPMISM				(1u << 17)
	/* IN endpoints interrupt */
#define OTG_FS_GLOBAL_GINTMSK_IEPINT				(1u << 18)
	/* OUT endpoints interrupt */
#define OTG_FS_GLOBAL_GINTMSK_OEPINT				(1u << 19)
	/* Incomplete isochronous IN transfer */
#define OTG_FS_GLOBAL_GINTMSK_IISOIXFRM				(1u << 20)
	/* Incomplete periodic transfer mask(Host */
#define OTG_FS_GLOBAL_GINTMSK_IPXFRM_IISOOXFRM			(1u << 21)
	/* Host port interrupt mask */
#define OTG_FS_GLOBAL_GINTMSK_PRTIM				(1u << 24)
	/* Host channels interrupt */
#define OTG_FS_GLOBAL_GINTMSK_HCIM				(1u << 25)
	/* Periodic TxFIFO empty mask */
#define OTG_FS_GLOBAL_GINTMSK_PTXFEM				(1u << 26)
	/* Connector ID status change */
#define OTG_FS_GLOBAL_GINTMSK_CIDSCHGM				(1u << 28)
	/* Disconnect detected interrupt */
#define OTG_FS_GLOBAL_GINTMSK_DISCINT				(1u << 29)
	/* Session request/new session detected */
#define OTG_FS_GLOBAL_GINTMSK_SRQIM				(1u << 30)
	/* Resume/remote wakeup detected interrupt */
#define OTG_FS_GLOBAL_GINTMSK_WUIM				(1u << 31)

	/* 0x1C: OTG_FS Receive status debug read(Device */
	uint32_t volatile const GRXSTSR_DEVICE;
	/* Endpoint number */
#define OTG_FS_GLOBAL_GRXSTSR_DEVICE_EPNUM_Msk			(0xFu << 0)
#define OTG_FS_GLOBAL_GRXSTSR_DEVICE_EPNUM_Pos			0
	/* Byte count */
#define OTG_FS_GLOBAL_GRXSTSR_DEVICE_BCNT_Msk			(0x7FFu << 4)
#define OTG_FS_GLOBAL_GRXSTSR_DEVICE_BCNT_Pos			4
	/* Data PID */
#define OTG_FS_GLOBAL_GRXSTSR_DEVICE_DPID_Msk			(0x3u << 15)
#define OTG_FS_GLOBAL_GRXSTSR_DEVICE_DPID_Pos			15
	/* Packet status */
#define OTG_FS_GLOBAL_GRXSTSR_DEVICE_PKTSTS_Msk			(0xFu << 17)
#define OTG_FS_GLOBAL_GRXSTSR_DEVICE_PKTSTS_Pos			17
	/* Frame number */
#define OTG_FS_GLOBAL_GRXSTSR_DEVICE_FRMNUM_Msk			(0xFu << 21)
#define OTG_FS_GLOBAL_GRXSTSR_DEVICE_FRMNUM_Pos			21

	/* 0x1C: OTG_FS Receive status debug read(Host */
	uint32_t volatile const GRXSTSR_HOST;
	/* Endpoint number */
#define OTG_FS_GLOBAL_GRXSTSR_HOST_EPNUM_Msk			(0xFu << 0)
#define OTG_FS_GLOBAL_GRXSTSR_HOST_EPNUM_Pos			0
	/* Byte count */
#define OTG_FS_GLOBAL_GRXSTSR_HOST_BCNT_Msk			(0x7FFu << 4)
#define OTG_FS_GLOBAL_GRXSTSR_HOST_BCNT_Pos			4
	/* Data PID */
#define OTG_FS_GLOBAL_GRXSTSR_HOST_DPID_Msk			(0x3u << 15)
#define OTG_FS_GLOBAL_GRXSTSR_HOST_DPID_Pos			15
	/* Packet status */
#define OTG_FS_GLOBAL_GRXSTSR_HOST_PKTSTS_Msk			(0xFu << 17)
#define OTG_FS_GLOBAL_GRXSTSR_HOST_PKTSTS_Pos			17
	/* Frame number */
#define OTG_FS_GLOBAL_GRXSTSR_HOST_FRMNUM_Msk			(0xFu << 21)
#define OTG_FS_GLOBAL_GRXSTSR_HOST_FRMNUM_Pos			21

