josuah/mcu-stm32f411/registers.h
	/* 0x20 */
	uint8_t RESERVED0[0x24u-0x20u];

	/* 0x24: OTG_FS Receive FIFO size register */
	uint32_t volatile GRXFSIZ;
	/* RxFIFO depth */
#define OTG_FS_GLOBAL_GRXFSIZ_RXFD_Msk				(0xFFFFu << 0)
#define OTG_FS_GLOBAL_GRXFSIZ_RXFD_Pos				0

	/* 0x28: OTG_FS non-periodic transmit FIFO size */
	uint32_t volatile DIEPTXF0;
	/* Endpoint 0 transmit RAM start */
#define OTG_FS_GLOBAL_DIEPTXF0_TX0FSA_Msk			(0xFFFFu << 0)
#define OTG_FS_GLOBAL_DIEPTXF0_TX0FSA_Pos			0
	/* Endpoint 0 TxFIFO depth */
#define OTG_FS_GLOBAL_DIEPTXF0_TX0FD_Msk			(0xFFFFu << 16)
#define OTG_FS_GLOBAL_DIEPTXF0_TX0FD_Pos			16

	/* 0x28: OTG_FS non-periodic transmit FIFO size */
	uint32_t volatile HNPTXFSIZ;
	/* Non-periodic transmit RAM start */
#define OTG_FS_GLOBAL_HNPTXFSIZ_NPTXFSA_Msk			(0xFFFFu << 0)
#define OTG_FS_GLOBAL_HNPTXFSIZ_NPTXFSA_Pos			0
	/* Non-periodic TxFIFO depth */
#define OTG_FS_GLOBAL_HNPTXFSIZ_NPTXFD_Msk			(0xFFFFu << 16)
#define OTG_FS_GLOBAL_HNPTXFSIZ_NPTXFD_Pos			16

	/* 0x2C: OTG_FS non-periodic transmit FIFO/queue */
	uint32_t volatile const GNPTXSTS;
	/* Non-periodic TxFIFO space */
#define OTG_FS_GLOBAL_GNPTXSTS_NPTXFSAV_Msk			(0xFFFFu << 0)
#define OTG_FS_GLOBAL_GNPTXSTS_NPTXFSAV_Pos			0
	/* Non-periodic transmit request queue */
#define OTG_FS_GLOBAL_GNPTXSTS_NPTQXSAV_Msk			(0xFFu << 16)
#define OTG_FS_GLOBAL_GNPTXSTS_NPTQXSAV_Pos			16
	/* Top of the non-periodic transmit request */
#define OTG_FS_GLOBAL_GNPTXSTS_NPTXQTOP_Msk			(0x7Fu << 24)
#define OTG_FS_GLOBAL_GNPTXSTS_NPTXQTOP_Pos			24

	/* 0x30 */
	uint8_t RESERVED1[0x38u-0x30u];

	/* 0x38: OTG_FS general core configuration register */
	uint32_t volatile GCCFG;
	/* Power down */
#define OTG_FS_GLOBAL_GCCFG_PWRDWN				(1u << 16)
	/* Enable the VBUS sensing */
#define OTG_FS_GLOBAL_GCCFG_VBUSASEN				(1u << 18)
	/* Enable the VBUS sensing */
#define OTG_FS_GLOBAL_GCCFG_VBUSBSEN				(1u << 19)
	/* SOF output enable */
#define OTG_FS_GLOBAL_GCCFG_SOFOUTEN				(1u << 20)

	/* 0x3C: core ID register */
	uint32_t volatile CID;
	/* Product ID field */
#define OTG_FS_GLOBAL_CID_PRODUCT_ID_Msk			(0xFFFFFFFFu << 0)
#define OTG_FS_GLOBAL_CID_PRODUCT_ID_Pos			0

	/* 0x40 */
	uint8_t RESERVED2[0x100u-0x40u];

	/* 0x100: OTG_FS Host periodic transmit FIFO size */
	uint32_t volatile HPTXFSIZ;
	/* Host periodic TxFIFO start */
#define OTG_FS_GLOBAL_HPTXFSIZ_PTXSA_Msk			(0xFFFFu << 0)
#define OTG_FS_GLOBAL_HPTXFSIZ_PTXSA_Pos			0
	/* Host periodic TxFIFO depth */
#define OTG_FS_GLOBAL_HPTXFSIZ_PTXFSIZ_Msk			(0xFFFFu << 16)
#define OTG_FS_GLOBAL_HPTXFSIZ_PTXFSIZ_Pos			16

	/* 0x104: OTG_FS device IN endpoint transmit FIFO size */
	uint32_t volatile DIEPTXF[3];
	/* IN endpoint FIFO2 transmit RAM start */
#define OTG_FS_GLOBAL_DIEPTXF_INEPTXSA_Msk			(0xFFFFu << 0)
#define OTG_FS_GLOBAL_DIEPTXF_INEPTXSA_Pos			0
	/* IN endpoint TxFIFO depth */
#define OTG_FS_GLOBAL_DIEPTXF_INEPTXFD_Msk			(0xFFFFu << 16)
#define OTG_FS_GLOBAL_DIEPTXF_INEPTXFD_Pos			16

	/* 0x20: OTG status read and pop (device mode) */
	uint32_t volatile const GRXSTSP_DEVICE;
	/* Status phase start */
#define OTG_FS_GLOBAL_GRXSTSP_DEVICE_STSPHST			(1u << 27)
	/* Frame number */
#define OTG_FS_GLOBAL_GRXSTSP_DEVICE_FRMNUM_Msk			(0xFu << 21)
#define OTG_FS_GLOBAL_GRXSTSP_DEVICE_FRMNUM_Pos			21
	/* Packet status */
#define OTG_FS_GLOBAL_GRXSTSP_DEVICE_PKTSTS_Msk			(0xFu << 17)
#define OTG_FS_GLOBAL_GRXSTSP_DEVICE_PKTSTS_Pos			17
	/* Data PID */
#define OTG_FS_GLOBAL_GRXSTSP_DEVICE_DPID_Msk			(0x3u << 15)
#define OTG_FS_GLOBAL_GRXSTSP_DEVICE_DPID_Pos			15
	/* Byte count */
#define OTG_FS_GLOBAL_GRXSTSP_DEVICE_BCNT_Msk			(0x7FFu << 4)
#define OTG_FS_GLOBAL_GRXSTSP_DEVICE_BCNT_Pos			4
	/* Endpoint number */
#define OTG_FS_GLOBAL_GRXSTSP_DEVICE_EPNUM_Msk			(0xFu << 0)
#define OTG_FS_GLOBAL_GRXSTSP_DEVICE_EPNUM_Pos			0

	/* 0x20: OTG status read and pop (host mode) */
	uint32_t volatile const GRXSTSP_HOST;
	/* Packet status */
#define OTG_FS_GLOBAL_GRXSTSP_HOST_PKTSTS_Msk			(0xFu << 17)
#define OTG_FS_GLOBAL_GRXSTSP_HOST_PKTSTS_Pos			17
	/* Data PID */
#define OTG_FS_GLOBAL_GRXSTSP_HOST_DPID_Msk			(0x3u << 15)
#define OTG_FS_GLOBAL_GRXSTSP_HOST_DPID_Pos			15
	/* Byte count */
#define OTG_FS_GLOBAL_GRXSTSP_HOST_BCNT_Msk			(0x7FFu << 4)
#define OTG_FS_GLOBAL_GRXSTSP_HOST_BCNT_Pos			4
	/* Channel number */
#define OTG_FS_GLOBAL_GRXSTSP_HOST_CHNUM_Msk			(0xFu << 0)
#define OTG_FS_GLOBAL_GRXSTSP_HOST_CHNUM_Pos			0

};


#define OTG_FS_HOST ((struct mcu_otg_fs_host *)0x50000400)

struct mcu_otg_fs_host {

	/* 0x00: OTG_FS host configuration register */
	uint32_t volatile HCFG;
	/* FS/LS PHY clock select */
#define OTG_FS_HOST_HCFG_FSLSPCS_Msk				(0x3u << 0)
#define OTG_FS_HOST_HCFG_FSLSPCS_Pos				0
	/* FS- and LS-only support */
#define OTG_FS_HOST_HCFG_FSLSS					(1u << 2)

	/* 0x04: OTG_FS Host frame interval */
	uint32_t volatile HFIR;
	/* Frame interval */
#define OTG_FS_HOST_HFIR_FRIVL_Msk				(0xFFFFu << 0)
#define OTG_FS_HOST_HFIR_FRIVL_Pos				0

	/* 0x08: OTG_FS host frame number/frame time */
	uint32_t volatile const HFNUM;
	/* Frame number */
#define OTG_FS_HOST_HFNUM_FRNUM_Msk				(0xFFFFu << 0)
#define OTG_FS_HOST_HFNUM_FRNUM_Pos				0
	/* Frame time remaining */
#define OTG_FS_HOST_HFNUM_FTREM_Msk				(0xFFFFu << 16)
#define OTG_FS_HOST_HFNUM_FTREM_Pos				16

	/* 0x0C */
	uint8_t RESERVED0[0x10u-0x0Cu];

	/* 0x10: OTG_FS_Host periodic transmit FIFO/queue */
	uint32_t volatile HPTXSTS;
	/* Periodic transmit data FIFO space */
#define OTG_FS_HOST_HPTXSTS_PTXFSAVL_Msk			(0xFFFFu << 0)
#define OTG_FS_HOST_HPTXSTS_PTXFSAVL_Pos			0
	/* Periodic transmit request queue space */
#define OTG_FS_HOST_HPTXSTS_PTXQSAV_Msk				(0xFFu << 16)
#define OTG_FS_HOST_HPTXSTS_PTXQSAV_Pos				16
	/* Top of the periodic transmit request */
#define OTG_FS_HOST_HPTXSTS_PTXQTOP_Msk				(0xFFu << 24)
#define OTG_FS_HOST_HPTXSTS_PTXQTOP_Pos				24

	/* 0x14: OTG_FS Host all channels interrupt */
	uint32_t volatile const HAINT;
	/* Channel interrupts */
#define OTG_FS_HOST_HAINT_HAINT_Msk				(0xFFFFu << 0)
#define OTG_FS_HOST_HAINT_HAINT_Pos				0

	/* 0x18: OTG_FS host all channels interrupt mask */
	uint32_t volatile HAINTMSK;
	/* Channel interrupt mask */
#define OTG_FS_HOST_HAINTMSK_HAINTM_Msk				(0xFFFFu << 0)
#define OTG_FS_HOST_HAINTMSK_HAINTM_Pos				0

	/* 0x1C */
	uint8_t RESERVED1[0x40u-0x1Cu];

	/* 0x40: OTG_FS host port control and status register */
	uint32_t volatile HPRT;
	/* Port connect status */
#define OTG_FS_HOST_HPRT_PCSTS					(1u << 0)
	/* Port connect detected */
#define OTG_FS_HOST_HPRT_PCDET					(1u << 1)
	/* Port enable */
#define OTG_FS_HOST_HPRT_PENA					(1u << 2)
	/* Port enable/disable change */
#define OTG_FS_HOST_HPRT_PENCHNG				(1u << 3)
	/* Port overcurrent active */
#define OTG_FS_HOST_HPRT_POCA					(1u << 4)
	/* Port overcurrent change */
#define OTG_FS_HOST_HPRT_POCCHNG				(1u << 5)
	/* Port resume */
#define OTG_FS_HOST_HPRT_PRES					(1u << 6)
	/* Port suspend */
#define OTG_FS_HOST_HPRT_PSUSP					(1u << 7)
	/* Port reset */
#define OTG_FS_HOST_HPRT_PRST					(1u << 8)
	/* Port line status */
#define OTG_FS_HOST_HPRT_PLSTS_Msk				(0x3u << 10)
#define OTG_FS_HOST_HPRT_PLSTS_Pos				10
	/* Port power */
#define OTG_FS_HOST_HPRT_PPWR					(1u << 12)
	/* Port test control */
#define OTG_FS_HOST_HPRT_PTCTL_Msk				(0xFu << 13)
#define OTG_FS_HOST_HPRT_PTCTL_Pos				13
	/* Port speed */
#define OTG_FS_HOST_HPRT_PSPD_Msk				(0x3u << 17)
#define OTG_FS_HOST_HPRT_PSPD_Pos				17

	/* 0x44 */
	uint8_t RESERVED2[0x100u-0x44u];

