josuah/mcu-stm32f411/registers.h
	/* 0x100: OTG_FS host channel-0 characteristics */
	uint32_t volatile HCCHAR0;
	/* Maximum packet size */
#define OTG_FS_HOST_HCCHAR0_MPSIZ_Msk				(0x7FFu << 0)
#define OTG_FS_HOST_HCCHAR0_MPSIZ_Pos				0
	/* Endpoint number */
#define OTG_FS_HOST_HCCHAR0_EPNUM_Msk				(0xFu << 11)
#define OTG_FS_HOST_HCCHAR0_EPNUM_Pos				11
	/* Endpoint direction */
#define OTG_FS_HOST_HCCHAR0_EPDIR				(1u << 15)
	/* Low-speed device */
#define OTG_FS_HOST_HCCHAR0_LSDEV				(1u << 17)
	/* Endpoint type */
#define OTG_FS_HOST_HCCHAR0_EPTYP_Msk				(0x3u << 18)
#define OTG_FS_HOST_HCCHAR0_EPTYP_Pos				18
	/* Multicount */
#define OTG_FS_HOST_HCCHAR0_MCNT_Msk				(0x3u << 20)
#define OTG_FS_HOST_HCCHAR0_MCNT_Pos				20
	/* Device address */
#define OTG_FS_HOST_HCCHAR0_DAD_Msk				(0x7Fu << 22)
#define OTG_FS_HOST_HCCHAR0_DAD_Pos				22
	/* Odd frame */
#define OTG_FS_HOST_HCCHAR0_ODDFRM				(1u << 29)
	/* Channel disable */
#define OTG_FS_HOST_HCCHAR0_CHDIS				(1u << 30)
	/* Channel enable */
#define OTG_FS_HOST_HCCHAR0_CHENA				(1u << 31)

	/* 0x104 */
	uint8_t RESERVED3[0x120u-0x104u];

	/* 0x120: OTG_FS host channel-1 characteristics */
	uint32_t volatile HCCHAR1;
	/* Maximum packet size */
#define OTG_FS_HOST_HCCHAR1_MPSIZ_Msk				(0x7FFu << 0)
#define OTG_FS_HOST_HCCHAR1_MPSIZ_Pos				0
	/* Endpoint number */
#define OTG_FS_HOST_HCCHAR1_EPNUM_Msk				(0xFu << 11)
#define OTG_FS_HOST_HCCHAR1_EPNUM_Pos				11
	/* Endpoint direction */
#define OTG_FS_HOST_HCCHAR1_EPDIR				(1u << 15)
	/* Low-speed device */
#define OTG_FS_HOST_HCCHAR1_LSDEV				(1u << 17)
	/* Endpoint type */
#define OTG_FS_HOST_HCCHAR1_EPTYP_Msk				(0x3u << 18)
#define OTG_FS_HOST_HCCHAR1_EPTYP_Pos				18
	/* Multicount */
#define OTG_FS_HOST_HCCHAR1_MCNT_Msk				(0x3u << 20)
#define OTG_FS_HOST_HCCHAR1_MCNT_Pos				20
	/* Device address */
#define OTG_FS_HOST_HCCHAR1_DAD_Msk				(0x7Fu << 22)
#define OTG_FS_HOST_HCCHAR1_DAD_Pos				22
	/* Odd frame */
#define OTG_FS_HOST_HCCHAR1_ODDFRM				(1u << 29)
	/* Channel disable */
#define OTG_FS_HOST_HCCHAR1_CHDIS				(1u << 30)
	/* Channel enable */
#define OTG_FS_HOST_HCCHAR1_CHENA				(1u << 31)

	/* 0x124 */
	uint8_t RESERVED4[0x140u-0x124u];

	/* 0x140: OTG_FS host channel-2 characteristics */
	uint32_t volatile HCCHAR2;
	/* Maximum packet size */
#define OTG_FS_HOST_HCCHAR2_MPSIZ_Msk				(0x7FFu << 0)
#define OTG_FS_HOST_HCCHAR2_MPSIZ_Pos				0
	/* Endpoint number */
#define OTG_FS_HOST_HCCHAR2_EPNUM_Msk				(0xFu << 11)
#define OTG_FS_HOST_HCCHAR2_EPNUM_Pos				11
	/* Endpoint direction */
#define OTG_FS_HOST_HCCHAR2_EPDIR				(1u << 15)
	/* Low-speed device */
#define OTG_FS_HOST_HCCHAR2_LSDEV				(1u << 17)
	/* Endpoint type */
#define OTG_FS_HOST_HCCHAR2_EPTYP_Msk				(0x3u << 18)
#define OTG_FS_HOST_HCCHAR2_EPTYP_Pos				18
	/* Multicount */
#define OTG_FS_HOST_HCCHAR2_MCNT_Msk				(0x3u << 20)
#define OTG_FS_HOST_HCCHAR2_MCNT_Pos				20
	/* Device address */
#define OTG_FS_HOST_HCCHAR2_DAD_Msk				(0x7Fu << 22)
#define OTG_FS_HOST_HCCHAR2_DAD_Pos				22
	/* Odd frame */
#define OTG_FS_HOST_HCCHAR2_ODDFRM				(1u << 29)
	/* Channel disable */
#define OTG_FS_HOST_HCCHAR2_CHDIS				(1u << 30)
	/* Channel enable */
#define OTG_FS_HOST_HCCHAR2_CHENA				(1u << 31)

	/* 0x144 */
	uint8_t RESERVED5[0x160u-0x144u];

	/* 0x160: OTG_FS host channel-3 characteristics */
	uint32_t volatile HCCHAR3;
	/* Maximum packet size */
#define OTG_FS_HOST_HCCHAR3_MPSIZ_Msk				(0x7FFu << 0)
#define OTG_FS_HOST_HCCHAR3_MPSIZ_Pos				0
	/* Endpoint number */
#define OTG_FS_HOST_HCCHAR3_EPNUM_Msk				(0xFu << 11)
#define OTG_FS_HOST_HCCHAR3_EPNUM_Pos				11
	/* Endpoint direction */
#define OTG_FS_HOST_HCCHAR3_EPDIR				(1u << 15)
	/* Low-speed device */
#define OTG_FS_HOST_HCCHAR3_LSDEV				(1u << 17)
	/* Endpoint type */
#define OTG_FS_HOST_HCCHAR3_EPTYP_Msk				(0x3u << 18)
#define OTG_FS_HOST_HCCHAR3_EPTYP_Pos				18
	/* Multicount */
#define OTG_FS_HOST_HCCHAR3_MCNT_Msk				(0x3u << 20)
#define OTG_FS_HOST_HCCHAR3_MCNT_Pos				20
	/* Device address */
#define OTG_FS_HOST_HCCHAR3_DAD_Msk				(0x7Fu << 22)
#define OTG_FS_HOST_HCCHAR3_DAD_Pos				22
	/* Odd frame */
#define OTG_FS_HOST_HCCHAR3_ODDFRM				(1u << 29)
	/* Channel disable */
#define OTG_FS_HOST_HCCHAR3_CHDIS				(1u << 30)
	/* Channel enable */
#define OTG_FS_HOST_HCCHAR3_CHENA				(1u << 31)

	/* 0x164 */
	uint8_t RESERVED6[0x180u-0x164u];

	/* 0x180: OTG_FS host channel-4 characteristics */
	uint32_t volatile HCCHAR4;
	/* Maximum packet size */
#define OTG_FS_HOST_HCCHAR4_MPSIZ_Msk				(0x7FFu << 0)
#define OTG_FS_HOST_HCCHAR4_MPSIZ_Pos				0
	/* Endpoint number */
#define OTG_FS_HOST_HCCHAR4_EPNUM_Msk				(0xFu << 11)
#define OTG_FS_HOST_HCCHAR4_EPNUM_Pos				11
	/* Endpoint direction */
#define OTG_FS_HOST_HCCHAR4_EPDIR				(1u << 15)
	/* Low-speed device */
#define OTG_FS_HOST_HCCHAR4_LSDEV				(1u << 17)
	/* Endpoint type */
#define OTG_FS_HOST_HCCHAR4_EPTYP_Msk				(0x3u << 18)
#define OTG_FS_HOST_HCCHAR4_EPTYP_Pos				18
	/* Multicount */
#define OTG_FS_HOST_HCCHAR4_MCNT_Msk				(0x3u << 20)
#define OTG_FS_HOST_HCCHAR4_MCNT_Pos				20
	/* Device address */
#define OTG_FS_HOST_HCCHAR4_DAD_Msk				(0x7Fu << 22)
#define OTG_FS_HOST_HCCHAR4_DAD_Pos				22
	/* Odd frame */
#define OTG_FS_HOST_HCCHAR4_ODDFRM				(1u << 29)
	/* Channel disable */
#define OTG_FS_HOST_HCCHAR4_CHDIS				(1u << 30)
	/* Channel enable */
#define OTG_FS_HOST_HCCHAR4_CHENA				(1u << 31)

	/* 0x184 */
	uint8_t RESERVED7[0x1A0u-0x184u];

	/* 0x1A0: OTG_FS host channel-5 characteristics */
	uint32_t volatile HCCHAR5;
	/* Maximum packet size */
#define OTG_FS_HOST_HCCHAR5_MPSIZ_Msk				(0x7FFu << 0)
#define OTG_FS_HOST_HCCHAR5_MPSIZ_Pos				0
	/* Endpoint number */
#define OTG_FS_HOST_HCCHAR5_EPNUM_Msk				(0xFu << 11)
#define OTG_FS_HOST_HCCHAR5_EPNUM_Pos				11
	/* Endpoint direction */
#define OTG_FS_HOST_HCCHAR5_EPDIR				(1u << 15)
	/* Low-speed device */
#define OTG_FS_HOST_HCCHAR5_LSDEV				(1u << 17)
	/* Endpoint type */
#define OTG_FS_HOST_HCCHAR5_EPTYP_Msk				(0x3u << 18)
#define OTG_FS_HOST_HCCHAR5_EPTYP_Pos				18
	/* Multicount */
#define OTG_FS_HOST_HCCHAR5_MCNT_Msk				(0x3u << 20)
#define OTG_FS_HOST_HCCHAR5_MCNT_Pos				20
	/* Device address */
#define OTG_FS_HOST_HCCHAR5_DAD_Msk				(0x7Fu << 22)
#define OTG_FS_HOST_HCCHAR5_DAD_Pos				22
	/* Odd frame */
#define OTG_FS_HOST_HCCHAR5_ODDFRM				(1u << 29)
	/* Channel disable */
#define OTG_FS_HOST_HCCHAR5_CHDIS				(1u << 30)
	/* Channel enable */
#define OTG_FS_HOST_HCCHAR5_CHENA				(1u << 31)

