josuah/mcu-stm32f411/registers.h
	/* 0x1A4 */
	uint8_t RESERVED8[0x1C0u-0x1A4u];

	/* 0x1C0: OTG_FS host channel-6 characteristics */
	uint32_t volatile HCCHAR6;
	/* Maximum packet size */
#define OTG_FS_HOST_HCCHAR6_MPSIZ_Msk				(0x7FFu << 0)
#define OTG_FS_HOST_HCCHAR6_MPSIZ_Pos				0
	/* Endpoint number */
#define OTG_FS_HOST_HCCHAR6_EPNUM_Msk				(0xFu << 11)
#define OTG_FS_HOST_HCCHAR6_EPNUM_Pos				11
	/* Endpoint direction */
#define OTG_FS_HOST_HCCHAR6_EPDIR				(1u << 15)
	/* Low-speed device */
#define OTG_FS_HOST_HCCHAR6_LSDEV				(1u << 17)
	/* Endpoint type */
#define OTG_FS_HOST_HCCHAR6_EPTYP_Msk				(0x3u << 18)
#define OTG_FS_HOST_HCCHAR6_EPTYP_Pos				18
	/* Multicount */
#define OTG_FS_HOST_HCCHAR6_MCNT_Msk				(0x3u << 20)
#define OTG_FS_HOST_HCCHAR6_MCNT_Pos				20
	/* Device address */
#define OTG_FS_HOST_HCCHAR6_DAD_Msk				(0x7Fu << 22)
#define OTG_FS_HOST_HCCHAR6_DAD_Pos				22
	/* Odd frame */
#define OTG_FS_HOST_HCCHAR6_ODDFRM				(1u << 29)
	/* Channel disable */
#define OTG_FS_HOST_HCCHAR6_CHDIS				(1u << 30)
	/* Channel enable */
#define OTG_FS_HOST_HCCHAR6_CHENA				(1u << 31)

	/* 0x1C4 */
	uint8_t RESERVED9[0x1E0u-0x1C4u];

	/* 0x1E0: OTG_FS host channel-7 characteristics */
	uint32_t volatile HCCHAR7;
	/* Maximum packet size */
#define OTG_FS_HOST_HCCHAR7_MPSIZ_Msk				(0x7FFu << 0)
#define OTG_FS_HOST_HCCHAR7_MPSIZ_Pos				0
	/* Endpoint number */
#define OTG_FS_HOST_HCCHAR7_EPNUM_Msk				(0xFu << 11)
#define OTG_FS_HOST_HCCHAR7_EPNUM_Pos				11
	/* Endpoint direction */
#define OTG_FS_HOST_HCCHAR7_EPDIR				(1u << 15)
	/* Low-speed device */
#define OTG_FS_HOST_HCCHAR7_LSDEV				(1u << 17)
	/* Endpoint type */
#define OTG_FS_HOST_HCCHAR7_EPTYP_Msk				(0x3u << 18)
#define OTG_FS_HOST_HCCHAR7_EPTYP_Pos				18
	/* Multicount */
#define OTG_FS_HOST_HCCHAR7_MCNT_Msk				(0x3u << 20)
#define OTG_FS_HOST_HCCHAR7_MCNT_Pos				20
	/* Device address */
#define OTG_FS_HOST_HCCHAR7_DAD_Msk				(0x7Fu << 22)
#define OTG_FS_HOST_HCCHAR7_DAD_Pos				22
	/* Odd frame */
#define OTG_FS_HOST_HCCHAR7_ODDFRM				(1u << 29)
	/* Channel disable */
#define OTG_FS_HOST_HCCHAR7_CHDIS				(1u << 30)
	/* Channel enable */
#define OTG_FS_HOST_HCCHAR7_CHENA				(1u << 31)

	/* 0x108: OTG_FS host channel-0 interrupt register */
	uint32_t volatile HCINT0;
	/* Transfer completed */
#define OTG_FS_HOST_HCINT0_XFRC					(1u << 0)
	/* Channel halted */
#define OTG_FS_HOST_HCINT0_CHH					(1u << 1)
	/* STALL response received */
#define OTG_FS_HOST_HCINT0_STALL				(1u << 3)
	/* NAK response received */
#define OTG_FS_HOST_HCINT0_NAK					(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINT0_ACK					(1u << 5)
	/* Transaction error */
#define OTG_FS_HOST_HCINT0_TXERR				(1u << 7)
	/* Babble error */
#define OTG_FS_HOST_HCINT0_BBERR				(1u << 8)
	/* Frame overrun */
#define OTG_FS_HOST_HCINT0_FRMOR				(1u << 9)
	/* Data toggle error */
#define OTG_FS_HOST_HCINT0_DTERR				(1u << 10)

	/* 0x10C */
	uint8_t RESERVED10[0x128u-0x10Cu];

	/* 0x128: OTG_FS host channel-1 interrupt register */
	uint32_t volatile HCINT1;
	/* Transfer completed */
#define OTG_FS_HOST_HCINT1_XFRC					(1u << 0)
	/* Channel halted */
#define OTG_FS_HOST_HCINT1_CHH					(1u << 1)
	/* STALL response received */
#define OTG_FS_HOST_HCINT1_STALL				(1u << 3)
	/* NAK response received */
#define OTG_FS_HOST_HCINT1_NAK					(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINT1_ACK					(1u << 5)
	/* Transaction error */
#define OTG_FS_HOST_HCINT1_TXERR				(1u << 7)
	/* Babble error */
#define OTG_FS_HOST_HCINT1_BBERR				(1u << 8)
	/* Frame overrun */
#define OTG_FS_HOST_HCINT1_FRMOR				(1u << 9)
	/* Data toggle error */
#define OTG_FS_HOST_HCINT1_DTERR				(1u << 10)

	/* 0x12C */
	uint8_t RESERVED11[0x148u-0x12Cu];

	/* 0x148: OTG_FS host channel-2 interrupt register */
	uint32_t volatile HCINT2;
	/* Transfer completed */
#define OTG_FS_HOST_HCINT2_XFRC					(1u << 0)
	/* Channel halted */
#define OTG_FS_HOST_HCINT2_CHH					(1u << 1)
	/* STALL response received */
#define OTG_FS_HOST_HCINT2_STALL				(1u << 3)
	/* NAK response received */
#define OTG_FS_HOST_HCINT2_NAK					(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINT2_ACK					(1u << 5)
	/* Transaction error */
#define OTG_FS_HOST_HCINT2_TXERR				(1u << 7)
	/* Babble error */
#define OTG_FS_HOST_HCINT2_BBERR				(1u << 8)
	/* Frame overrun */
#define OTG_FS_HOST_HCINT2_FRMOR				(1u << 9)
	/* Data toggle error */
#define OTG_FS_HOST_HCINT2_DTERR				(1u << 10)

	/* 0x14C */
	uint8_t RESERVED12[0x168u-0x14Cu];

	/* 0x168: OTG_FS host channel-3 interrupt register */
	uint32_t volatile HCINT3;
	/* Transfer completed */
#define OTG_FS_HOST_HCINT3_XFRC					(1u << 0)
	/* Channel halted */
#define OTG_FS_HOST_HCINT3_CHH					(1u << 1)
	/* STALL response received */
#define OTG_FS_HOST_HCINT3_STALL				(1u << 3)
	/* NAK response received */
#define OTG_FS_HOST_HCINT3_NAK					(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINT3_ACK					(1u << 5)
	/* Transaction error */
#define OTG_FS_HOST_HCINT3_TXERR				(1u << 7)
	/* Babble error */
#define OTG_FS_HOST_HCINT3_BBERR				(1u << 8)
	/* Frame overrun */
#define OTG_FS_HOST_HCINT3_FRMOR				(1u << 9)
	/* Data toggle error */
#define OTG_FS_HOST_HCINT3_DTERR				(1u << 10)

	/* 0x16C */
	uint8_t RESERVED13[0x188u-0x16Cu];

	/* 0x188: OTG_FS host channel-4 interrupt register */
	uint32_t volatile HCINT4;
	/* Transfer completed */
#define OTG_FS_HOST_HCINT4_XFRC					(1u << 0)
	/* Channel halted */
#define OTG_FS_HOST_HCINT4_CHH					(1u << 1)
	/* STALL response received */
#define OTG_FS_HOST_HCINT4_STALL				(1u << 3)
	/* NAK response received */
#define OTG_FS_HOST_HCINT4_NAK					(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINT4_ACK					(1u << 5)
	/* Transaction error */
#define OTG_FS_HOST_HCINT4_TXERR				(1u << 7)
	/* Babble error */
#define OTG_FS_HOST_HCINT4_BBERR				(1u << 8)
	/* Frame overrun */
#define OTG_FS_HOST_HCINT4_FRMOR				(1u << 9)
	/* Data toggle error */
#define OTG_FS_HOST_HCINT4_DTERR				(1u << 10)

	/* 0x18C */
	uint8_t RESERVED14[0x1A8u-0x18Cu];

	/* 0x1A8: OTG_FS host channel-5 interrupt register */
	uint32_t volatile HCINT5;
	/* Transfer completed */
#define OTG_FS_HOST_HCINT5_XFRC					(1u << 0)
	/* Channel halted */
#define OTG_FS_HOST_HCINT5_CHH					(1u << 1)
	/* STALL response received */
#define OTG_FS_HOST_HCINT5_STALL				(1u << 3)
	/* NAK response received */
#define OTG_FS_HOST_HCINT5_NAK					(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINT5_ACK					(1u << 5)
	/* Transaction error */
#define OTG_FS_HOST_HCINT5_TXERR				(1u << 7)
	/* Babble error */
#define OTG_FS_HOST_HCINT5_BBERR				(1u << 8)
	/* Frame overrun */
#define OTG_FS_HOST_HCINT5_FRMOR				(1u << 9)
	/* Data toggle error */
#define OTG_FS_HOST_HCINT5_DTERR				(1u << 10)

	/* 0x1AC */
	uint8_t RESERVED15[0x1C8u-0x1ACu];

	/* 0x1C8: OTG_FS host channel-6 interrupt register */
	uint32_t volatile HCINT6;
	/* Transfer completed */
#define OTG_FS_HOST_HCINT6_XFRC					(1u << 0)
	/* Channel halted */
#define OTG_FS_HOST_HCINT6_CHH					(1u << 1)
	/* STALL response received */
#define OTG_FS_HOST_HCINT6_STALL				(1u << 3)
	/* NAK response received */
#define OTG_FS_HOST_HCINT6_NAK					(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINT6_ACK					(1u << 5)
	/* Transaction error */
#define OTG_FS_HOST_HCINT6_TXERR				(1u << 7)
	/* Babble error */
#define OTG_FS_HOST_HCINT6_BBERR				(1u << 8)
	/* Frame overrun */
#define OTG_FS_HOST_HCINT6_FRMOR				(1u << 9)
	/* Data toggle error */
#define OTG_FS_HOST_HCINT6_DTERR				(1u << 10)

	/* 0x1CC */
	uint8_t RESERVED16[0x1E8u-0x1CCu];

	/* 0x1E8: OTG_FS host channel-7 interrupt register */
	uint32_t volatile HCINT7;
	/* Transfer completed */
#define OTG_FS_HOST_HCINT7_XFRC					(1u << 0)
	/* Channel halted */
#define OTG_FS_HOST_HCINT7_CHH					(1u << 1)
	/* STALL response received */
#define OTG_FS_HOST_HCINT7_STALL				(1u << 3)
	/* NAK response received */
#define OTG_FS_HOST_HCINT7_NAK					(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINT7_ACK					(1u << 5)
	/* Transaction error */
#define OTG_FS_HOST_HCINT7_TXERR				(1u << 7)
	/* Babble error */
#define OTG_FS_HOST_HCINT7_BBERR				(1u << 8)
	/* Frame overrun */
#define OTG_FS_HOST_HCINT7_FRMOR				(1u << 9)
	/* Data toggle error */
#define OTG_FS_HOST_HCINT7_DTERR				(1u << 10)

	/* 0x10C: OTG_FS host channel-0 mask register */
	uint32_t volatile HCINTMSK0;
	/* Transfer completed mask */
#define OTG_FS_HOST_HCINTMSK0_XFRCM				(1u << 0)
	/* Channel halted mask */
#define OTG_FS_HOST_HCINTMSK0_CHHM				(1u << 1)
	/* STALL response received interrupt */
#define OTG_FS_HOST_HCINTMSK0_STALLM				(1u << 3)
	/* NAK response received interrupt */
#define OTG_FS_HOST_HCINTMSK0_NAKM				(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINTMSK0_ACKM				(1u << 5)
	/* response received interrupt */
#define OTG_FS_HOST_HCINTMSK0_NYET				(1u << 6)
	/* Transaction error mask */
#define OTG_FS_HOST_HCINTMSK0_TXERRM				(1u << 7)
	/* Babble error mask */
#define OTG_FS_HOST_HCINTMSK0_BBERRM				(1u << 8)
	/* Frame overrun mask */
#define OTG_FS_HOST_HCINTMSK0_FRMORM				(1u << 9)
	/* Data toggle error mask */
#define OTG_FS_HOST_HCINTMSK0_DTERRM				(1u << 10)

