josuah/mcu-stm32f411/registers.h
	/* 0x110 */
	uint8_t RESERVED17[0x12Cu-0x110u];

	/* 0x12C: OTG_FS host channel-1 mask register */
	uint32_t volatile HCINTMSK1;
	/* Transfer completed mask */
#define OTG_FS_HOST_HCINTMSK1_XFRCM				(1u << 0)
	/* Channel halted mask */
#define OTG_FS_HOST_HCINTMSK1_CHHM				(1u << 1)
	/* STALL response received interrupt */
#define OTG_FS_HOST_HCINTMSK1_STALLM				(1u << 3)
	/* NAK response received interrupt */
#define OTG_FS_HOST_HCINTMSK1_NAKM				(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINTMSK1_ACKM				(1u << 5)
	/* response received interrupt */
#define OTG_FS_HOST_HCINTMSK1_NYET				(1u << 6)
	/* Transaction error mask */
#define OTG_FS_HOST_HCINTMSK1_TXERRM				(1u << 7)
	/* Babble error mask */
#define OTG_FS_HOST_HCINTMSK1_BBERRM				(1u << 8)
	/* Frame overrun mask */
#define OTG_FS_HOST_HCINTMSK1_FRMORM				(1u << 9)
	/* Data toggle error mask */
#define OTG_FS_HOST_HCINTMSK1_DTERRM				(1u << 10)

	/* 0x130 */
	uint8_t RESERVED18[0x14Cu-0x130u];

	/* 0x14C: OTG_FS host channel-2 mask register */
	uint32_t volatile HCINTMSK2;
	/* Transfer completed mask */
#define OTG_FS_HOST_HCINTMSK2_XFRCM				(1u << 0)
	/* Channel halted mask */
#define OTG_FS_HOST_HCINTMSK2_CHHM				(1u << 1)
	/* STALL response received interrupt */
#define OTG_FS_HOST_HCINTMSK2_STALLM				(1u << 3)
	/* NAK response received interrupt */
#define OTG_FS_HOST_HCINTMSK2_NAKM				(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINTMSK2_ACKM				(1u << 5)
	/* response received interrupt */
#define OTG_FS_HOST_HCINTMSK2_NYET				(1u << 6)
	/* Transaction error mask */
#define OTG_FS_HOST_HCINTMSK2_TXERRM				(1u << 7)
	/* Babble error mask */
#define OTG_FS_HOST_HCINTMSK2_BBERRM				(1u << 8)
	/* Frame overrun mask */
#define OTG_FS_HOST_HCINTMSK2_FRMORM				(1u << 9)
	/* Data toggle error mask */
#define OTG_FS_HOST_HCINTMSK2_DTERRM				(1u << 10)

	/* 0x150 */
	uint8_t RESERVED19[0x16Cu-0x150u];

	/* 0x16C: OTG_FS host channel-3 mask register */
	uint32_t volatile HCINTMSK3;
	/* Transfer completed mask */
#define OTG_FS_HOST_HCINTMSK3_XFRCM				(1u << 0)
	/* Channel halted mask */
#define OTG_FS_HOST_HCINTMSK3_CHHM				(1u << 1)
	/* STALL response received interrupt */
#define OTG_FS_HOST_HCINTMSK3_STALLM				(1u << 3)
	/* NAK response received interrupt */
#define OTG_FS_HOST_HCINTMSK3_NAKM				(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINTMSK3_ACKM				(1u << 5)
	/* response received interrupt */
#define OTG_FS_HOST_HCINTMSK3_NYET				(1u << 6)
	/* Transaction error mask */
#define OTG_FS_HOST_HCINTMSK3_TXERRM				(1u << 7)
	/* Babble error mask */
#define OTG_FS_HOST_HCINTMSK3_BBERRM				(1u << 8)
	/* Frame overrun mask */
#define OTG_FS_HOST_HCINTMSK3_FRMORM				(1u << 9)
	/* Data toggle error mask */
#define OTG_FS_HOST_HCINTMSK3_DTERRM				(1u << 10)

	/* 0x170 */
	uint8_t RESERVED20[0x18Cu-0x170u];

	/* 0x18C: OTG_FS host channel-4 mask register */
	uint32_t volatile HCINTMSK4;
	/* Transfer completed mask */
#define OTG_FS_HOST_HCINTMSK4_XFRCM				(1u << 0)
	/* Channel halted mask */
#define OTG_FS_HOST_HCINTMSK4_CHHM				(1u << 1)
	/* STALL response received interrupt */
#define OTG_FS_HOST_HCINTMSK4_STALLM				(1u << 3)
	/* NAK response received interrupt */
#define OTG_FS_HOST_HCINTMSK4_NAKM				(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINTMSK4_ACKM				(1u << 5)
	/* response received interrupt */
#define OTG_FS_HOST_HCINTMSK4_NYET				(1u << 6)
	/* Transaction error mask */
#define OTG_FS_HOST_HCINTMSK4_TXERRM				(1u << 7)
	/* Babble error mask */
#define OTG_FS_HOST_HCINTMSK4_BBERRM				(1u << 8)
	/* Frame overrun mask */
#define OTG_FS_HOST_HCINTMSK4_FRMORM				(1u << 9)
	/* Data toggle error mask */
#define OTG_FS_HOST_HCINTMSK4_DTERRM				(1u << 10)

	/* 0x190 */
	uint8_t RESERVED21[0x1ACu-0x190u];

	/* 0x1AC: OTG_FS host channel-5 mask register */
	uint32_t volatile HCINTMSK5;
	/* Transfer completed mask */
#define OTG_FS_HOST_HCINTMSK5_XFRCM				(1u << 0)
	/* Channel halted mask */
#define OTG_FS_HOST_HCINTMSK5_CHHM				(1u << 1)
	/* STALL response received interrupt */
#define OTG_FS_HOST_HCINTMSK5_STALLM				(1u << 3)
	/* NAK response received interrupt */
#define OTG_FS_HOST_HCINTMSK5_NAKM				(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINTMSK5_ACKM				(1u << 5)
	/* response received interrupt */
#define OTG_FS_HOST_HCINTMSK5_NYET				(1u << 6)
	/* Transaction error mask */
#define OTG_FS_HOST_HCINTMSK5_TXERRM				(1u << 7)
	/* Babble error mask */
#define OTG_FS_HOST_HCINTMSK5_BBERRM				(1u << 8)
	/* Frame overrun mask */
#define OTG_FS_HOST_HCINTMSK5_FRMORM				(1u << 9)
	/* Data toggle error mask */
#define OTG_FS_HOST_HCINTMSK5_DTERRM				(1u << 10)

	/* 0x1B0 */
	uint8_t RESERVED22[0x1CCu-0x1B0u];

	/* 0x1CC: OTG_FS host channel-6 mask register */
	uint32_t volatile HCINTMSK6;
	/* Transfer completed mask */
#define OTG_FS_HOST_HCINTMSK6_XFRCM				(1u << 0)
	/* Channel halted mask */
#define OTG_FS_HOST_HCINTMSK6_CHHM				(1u << 1)
	/* STALL response received interrupt */
#define OTG_FS_HOST_HCINTMSK6_STALLM				(1u << 3)
	/* NAK response received interrupt */
#define OTG_FS_HOST_HCINTMSK6_NAKM				(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINTMSK6_ACKM				(1u << 5)
	/* response received interrupt */
#define OTG_FS_HOST_HCINTMSK6_NYET				(1u << 6)
	/* Transaction error mask */
#define OTG_FS_HOST_HCINTMSK6_TXERRM				(1u << 7)
	/* Babble error mask */
#define OTG_FS_HOST_HCINTMSK6_BBERRM				(1u << 8)
	/* Frame overrun mask */
#define OTG_FS_HOST_HCINTMSK6_FRMORM				(1u << 9)
	/* Data toggle error mask */
#define OTG_FS_HOST_HCINTMSK6_DTERRM				(1u << 10)

	/* 0x1D0 */
	uint8_t RESERVED23[0x1ECu-0x1D0u];

	/* 0x1EC: OTG_FS host channel-7 mask register */
	uint32_t volatile HCINTMSK7;
	/* Transfer completed mask */
#define OTG_FS_HOST_HCINTMSK7_XFRCM				(1u << 0)
	/* Channel halted mask */
#define OTG_FS_HOST_HCINTMSK7_CHHM				(1u << 1)
	/* STALL response received interrupt */
#define OTG_FS_HOST_HCINTMSK7_STALLM				(1u << 3)
	/* NAK response received interrupt */
#define OTG_FS_HOST_HCINTMSK7_NAKM				(1u << 4)
	/* ACK response received/transmitted */
#define OTG_FS_HOST_HCINTMSK7_ACKM				(1u << 5)
	/* response received interrupt */
#define OTG_FS_HOST_HCINTMSK7_NYET				(1u << 6)
	/* Transaction error mask */
#define OTG_FS_HOST_HCINTMSK7_TXERRM				(1u << 7)
	/* Babble error mask */
#define OTG_FS_HOST_HCINTMSK7_BBERRM				(1u << 8)
	/* Frame overrun mask */
#define OTG_FS_HOST_HCINTMSK7_FRMORM				(1u << 9)
	/* Data toggle error mask */
#define OTG_FS_HOST_HCINTMSK7_DTERRM				(1u << 10)

	/* 0x110: OTG_FS host channel-0 transfer size */
	uint32_t volatile HCTSIZ0;
	/* Transfer size */
#define OTG_FS_HOST_HCTSIZ0_XFRSIZ_Msk				(0x7FFFFu << 0)
#define OTG_FS_HOST_HCTSIZ0_XFRSIZ_Pos				0
	/* Packet count */
#define OTG_FS_HOST_HCTSIZ0_PKTCNT_Msk				(0x3FFu << 19)
#define OTG_FS_HOST_HCTSIZ0_PKTCNT_Pos				19
	/* Data PID */
#define OTG_FS_HOST_HCTSIZ0_DPID_Msk				(0x3u << 29)
#define OTG_FS_HOST_HCTSIZ0_DPID_Pos				29

	/* 0x114 */
	uint8_t RESERVED24[0x130u-0x114u];

	/* 0x130: OTG_FS host channel-1 transfer size */
	uint32_t volatile HCTSIZ1;
	/* Transfer size */
#define OTG_FS_HOST_HCTSIZ1_XFRSIZ_Msk				(0x7FFFFu << 0)
#define OTG_FS_HOST_HCTSIZ1_XFRSIZ_Pos				0
	/* Packet count */
#define OTG_FS_HOST_HCTSIZ1_PKTCNT_Msk				(0x3FFu << 19)
#define OTG_FS_HOST_HCTSIZ1_PKTCNT_Pos				19
	/* Data PID */
#define OTG_FS_HOST_HCTSIZ1_DPID_Msk				(0x3u << 29)
#define OTG_FS_HOST_HCTSIZ1_DPID_Pos				29

	/* 0x134 */
	uint8_t RESERVED25[0x150u-0x134u];

	/* 0x150: OTG_FS host channel-2 transfer size */
	uint32_t volatile HCTSIZ2;
	/* Transfer size */
#define OTG_FS_HOST_HCTSIZ2_XFRSIZ_Msk				(0x7FFFFu << 0)
#define OTG_FS_HOST_HCTSIZ2_XFRSIZ_Pos				0
	/* Packet count */
#define OTG_FS_HOST_HCTSIZ2_PKTCNT_Msk				(0x3FFu << 19)
#define OTG_FS_HOST_HCTSIZ2_PKTCNT_Pos				19
	/* Data PID */
#define OTG_FS_HOST_HCTSIZ2_DPID_Msk				(0x3u << 29)
#define OTG_FS_HOST_HCTSIZ2_DPID_Pos				29

	/* 0x154 */
	uint8_t RESERVED26[0x170u-0x154u];

	/* 0x170: OTG_FS host channel-3 transfer size */
	uint32_t volatile HCTSIZ3;
	/* Transfer size */
#define OTG_FS_HOST_HCTSIZ3_XFRSIZ_Msk				(0x7FFFFu << 0)
#define OTG_FS_HOST_HCTSIZ3_XFRSIZ_Pos				0
	/* Packet count */
#define OTG_FS_HOST_HCTSIZ3_PKTCNT_Msk				(0x3FFu << 19)
#define OTG_FS_HOST_HCTSIZ3_PKTCNT_Pos				19
	/* Data PID */
#define OTG_FS_HOST_HCTSIZ3_DPID_Msk				(0x3u << 29)
#define OTG_FS_HOST_HCTSIZ3_DPID_Pos				29

	/* 0x174 */
	uint8_t RESERVED27[0x190u-0x174u];

	/* 0x190: OTG_FS host channel-x transfer size */
	uint32_t volatile HCTSIZ4;
	/* Transfer size */
#define OTG_FS_HOST_HCTSIZ4_XFRSIZ_Msk				(0x7FFFFu << 0)
#define OTG_FS_HOST_HCTSIZ4_XFRSIZ_Pos				0
	/* Packet count */
#define OTG_FS_HOST_HCTSIZ4_PKTCNT_Msk				(0x3FFu << 19)
#define OTG_FS_HOST_HCTSIZ4_PKTCNT_Pos				19
	/* Data PID */
#define OTG_FS_HOST_HCTSIZ4_DPID_Msk				(0x3u << 29)
#define OTG_FS_HOST_HCTSIZ4_DPID_Pos				29

	/* 0x194 */
	uint8_t RESERVED28[0x1B0u-0x194u];

