josuah/mcu-stm32f411/registers.h
	/* 0x1B0: OTG_FS host channel-5 transfer size */
	uint32_t volatile HCTSIZ5;
	/* Transfer size */
#define OTG_FS_HOST_HCTSIZ5_XFRSIZ_Msk				(0x7FFFFu << 0)
#define OTG_FS_HOST_HCTSIZ5_XFRSIZ_Pos				0
	/* Packet count */
#define OTG_FS_HOST_HCTSIZ5_PKTCNT_Msk				(0x3FFu << 19)
#define OTG_FS_HOST_HCTSIZ5_PKTCNT_Pos				19
	/* Data PID */
#define OTG_FS_HOST_HCTSIZ5_DPID_Msk				(0x3u << 29)
#define OTG_FS_HOST_HCTSIZ5_DPID_Pos				29

	/* 0x1B4 */
	uint8_t RESERVED29[0x1D0u-0x1B4u];

	/* 0x1D0: OTG_FS host channel-6 transfer size */
	uint32_t volatile HCTSIZ6;
	/* Transfer size */
#define OTG_FS_HOST_HCTSIZ6_XFRSIZ_Msk				(0x7FFFFu << 0)
#define OTG_FS_HOST_HCTSIZ6_XFRSIZ_Pos				0
	/* Packet count */
#define OTG_FS_HOST_HCTSIZ6_PKTCNT_Msk				(0x3FFu << 19)
#define OTG_FS_HOST_HCTSIZ6_PKTCNT_Pos				19
	/* Data PID */
#define OTG_FS_HOST_HCTSIZ6_DPID_Msk				(0x3u << 29)
#define OTG_FS_HOST_HCTSIZ6_DPID_Pos				29

	/* 0x1D4 */
	uint8_t RESERVED30[0x1F0u-0x1D4u];

	/* 0x1F0: OTG_FS host channel-7 transfer size */
	uint32_t volatile HCTSIZ7;
	/* Transfer size */
#define OTG_FS_HOST_HCTSIZ7_XFRSIZ_Msk				(0x7FFFFu << 0)
#define OTG_FS_HOST_HCTSIZ7_XFRSIZ_Pos				0
	/* Packet count */
#define OTG_FS_HOST_HCTSIZ7_PKTCNT_Msk				(0x3FFu << 19)
#define OTG_FS_HOST_HCTSIZ7_PKTCNT_Pos				19
	/* Data PID */
#define OTG_FS_HOST_HCTSIZ7_DPID_Msk				(0x3u << 29)
#define OTG_FS_HOST_HCTSIZ7_DPID_Pos				29

};


#define OTG_FS_PWRCLK ((struct mcu_otg_fs_pwrclk *)0x50000E00)

struct mcu_otg_fs_pwrclk {

	/* 0x00: OTG_FS power and clock gating control */
	uint32_t volatile PCGCCTL;
	/* Stop PHY clock */
#define OTG_FS_PWRCLK_PCGCCTL_STPPCLK				(1u << 0)
	/* Gate HCLK */
#define OTG_FS_PWRCLK_PCGCCTL_GATEHCLK				(1u << 1)
	/* PHY Suspended */
#define OTG_FS_PWRCLK_PCGCCTL_PHYSUSP				(1u << 4)

};


#define PWR ((struct mcu_pwr *)0x40007000)

struct mcu_pwr {

	/* 0x00: power control register */
	uint32_t volatile CR;
	/* Regulator voltage scaling output */
#define PWR_CR_VOS_Msk						(0x3u << 14)
#define PWR_CR_VOS_Pos						14
	/* ADCDC1 */
#define PWR_CR_ADCDC1						(1u << 13)
	/* Flash power down in Stop */
#define PWR_CR_FPDS						(1u << 9)
	/* Disable backup domain write */
#define PWR_CR_DBP						(1u << 8)
	/* PVD level selection */
#define PWR_CR_PLS_Msk						(0x7u << 5)
#define PWR_CR_PLS_Pos						5
	/* Power voltage detector */
#define PWR_CR_PVDE						(1u << 4)
	/* Clear standby flag */
#define PWR_CR_CSBF						(1u << 3)
	/* Clear wakeup flag */
#define PWR_CR_CWUF						(1u << 2)
	/* Power down deepsleep */
#define PWR_CR_PDDS						(1u << 1)
	/* Low-power deep sleep */
#define PWR_CR_LPDS						(1u << 0)

	/* 0x04: power control/status register */
	uint32_t volatile CSR;
	/* Wakeup flag */
#define PWR_CSR_WUF						(1u << 0)
	/* Standby flag */
#define PWR_CSR_SBF						(1u << 1)
	/* PVD output */
#define PWR_CSR_PVDO						(1u << 2)
	/* Backup regulator ready */
#define PWR_CSR_BRR						(1u << 3)
	/* Enable WKUP pin */
#define PWR_CSR_EWUP						(1u << 8)
	/* Backup regulator enable */
#define PWR_CSR_BRE						(1u << 9)
	/* Regulator voltage scaling output */
#define PWR_CSR_VOSRDY						(1u << 14)

};


#define RCC ((struct mcu_rcc *)0x40023800)

struct mcu_rcc {

	/* 0x00: clock control register */
	uint32_t volatile CR;
	/* PLLI2S clock ready flag */
#define RCC_CR_PLLI2SRDY					(1u << 27)
	/* PLLI2S enable */
#define RCC_CR_PLLI2SON						(1u << 26)
	/* Main PLL (PLL) clock ready */
#define RCC_CR_PLLRDY						(1u << 25)
	/* Main PLL (PLL) enable */
#define RCC_CR_PLLON						(1u << 24)
	/* Clock security system */
#define RCC_CR_CSSON						(1u << 19)
#define RCC_CR_CSSON_OFF					(0x0u << 19)
#define RCC_CR_CSSON_ON						(0x1u << 19)
	/* HSE clock bypass */
#define RCC_CR_HSEBYP						(1u << 18)
#define RCC_CR_HSEBYP_NOTBYPASSED				(0x0u << 18)
#define RCC_CR_HSEBYP_BYPASSED					(0x1u << 18)
	/* HSE clock ready flag */
#define RCC_CR_HSERDY						(1u << 17)
	/* HSE clock enable */
#define RCC_CR_HSEON						(1u << 16)
	/* Internal high-speed clock */
#define RCC_CR_HSICAL_Msk					(0xFFu << 8)
#define RCC_CR_HSICAL_Pos					8
	/* Internal high-speed clock */
#define RCC_CR_HSITRIM_Msk					(0x1Fu << 3)
#define RCC_CR_HSITRIM_Pos					3
	/* Internal high-speed clock ready */
#define RCC_CR_HSIRDY						(1u << 1)
#define RCC_CR_HSIRDY_NOTREADY					(0x0u << 1)
#define RCC_CR_HSIRDY_READY					(0x1u << 1)
	/* Internal high-speed clock */
#define RCC_CR_HSION						(1u << 0)
#define RCC_CR_HSION_OFF					(0x0u << 0)
#define RCC_CR_HSION_ON						(0x1u << 0)

	/* 0x04: PLL configuration register */
	uint32_t volatile PLLCFGR;
	/* Main PLL(PLL) and audio PLL (PLLI2S) */
#define RCC_PLLCFGR_PLLSRC					(1u << 22)
#define RCC_PLLCFGR_PLLSRC_HSI					(0x0u << 22)
#define RCC_PLLCFGR_PLLSRC_HSE					(0x1u << 22)
	/* Division factor for the main PLL (PLL) */
#define RCC_PLLCFGR_PLLM_Msk					(0x3Fu << 0)
#define RCC_PLLCFGR_PLLM_Pos					0
	/* Main PLL (PLL) multiplication factor for */
#define RCC_PLLCFGR_PLLN_Msk					(0x1FFu << 6)
#define RCC_PLLCFGR_PLLN_Pos					6
	/* Main PLL (PLL) division factor for main */
#define RCC_PLLCFGR_PLLP_Msk					(0x3u << 16)
#define RCC_PLLCFGR_PLLP_Pos					16
#define RCC_PLLCFGR_PLLP_DIV2					(0x0u << 16)
#define RCC_PLLCFGR_PLLP_DIV4					(0x1u << 16)
#define RCC_PLLCFGR_PLLP_DIV6					(0x2u << 16)
#define RCC_PLLCFGR_PLLP_DIV8					(0x3u << 16)
	/* Main PLL (PLL) division factor for USB */
#define RCC_PLLCFGR_PLLQ_Msk					(0xFu << 24)
#define RCC_PLLCFGR_PLLQ_Pos					24

	/* 0x08: clock configuration register */
	uint32_t volatile CFGR;
	/* Microcontroller clock output */
#define RCC_CFGR_MCO2_Msk					(0x3u << 30)
#define RCC_CFGR_MCO2_Pos					30
#define RCC_CFGR_MCO2_SYSCLK					(0x0u << 30)
#define RCC_CFGR_MCO2_PLLI2S					(0x1u << 30)
#define RCC_CFGR_MCO2_HSE					(0x2u << 30)
#define RCC_CFGR_MCO2_PLL					(0x3u << 30)
	/* MCO2 prescaler */
#define RCC_CFGR_MCO2PRE_Msk					(0x7u << 27)
#define RCC_CFGR_MCO2PRE_Pos					27
	/* MCO1 prescaler */
#define RCC_CFGR_MCO1PRE_Msk					(0x7u << 24)
#define RCC_CFGR_MCO1PRE_Pos					24
#define RCC_CFGR_MCO1PRE_DIV1					(0x0u << 24)
#define RCC_CFGR_MCO1PRE_DIV2					(0x4u << 24)
#define RCC_CFGR_MCO1PRE_DIV3					(0x5u << 24)
#define RCC_CFGR_MCO1PRE_DIV4					(0x6u << 24)
#define RCC_CFGR_MCO1PRE_DIV5					(0x7u << 24)
	/* I2S clock selection */
#define RCC_CFGR_I2SSRC						(1u << 23)
#define RCC_CFGR_I2SSRC_PLLI2S					(0x0u << 23)
#define RCC_CFGR_I2SSRC_CKIN					(0x1u << 23)
	/* Microcontroller clock output */
#define RCC_CFGR_MCO1_Msk					(0x3u << 21)
#define RCC_CFGR_MCO1_Pos					21
#define RCC_CFGR_MCO1_HSI					(0x0u << 21)
#define RCC_CFGR_MCO1_LSE					(0x1u << 21)
#define RCC_CFGR_MCO1_HSE					(0x2u << 21)
#define RCC_CFGR_MCO1_PLL					(0x3u << 21)
	/* HSE division factor for RTC */
#define RCC_CFGR_RTCPRE_Msk					(0x1Fu << 16)
#define RCC_CFGR_RTCPRE_Pos					16
	/* APB high-speed prescaler */
#define RCC_CFGR_PPRE2_Msk					(0x7u << 13)
#define RCC_CFGR_PPRE2_Pos					13
	/* APB Low speed prescaler */
#define RCC_CFGR_PPRE1_Msk					(0x7u << 10)
#define RCC_CFGR_PPRE1_Pos					10
#define RCC_CFGR_PPRE1_DIV1					(0x0u << 10)
#define RCC_CFGR_PPRE1_DIV2					(0x4u << 10)
#define RCC_CFGR_PPRE1_DIV4					(0x5u << 10)
#define RCC_CFGR_PPRE1_DIV8					(0x6u << 10)
#define RCC_CFGR_PPRE1_DIV16					(0x7u << 10)
	/* AHB prescaler */
#define RCC_CFGR_HPRE_Msk					(0xFu << 4)
#define RCC_CFGR_HPRE_Pos					4
#define RCC_CFGR_HPRE_DIV1					(0x0u << 4)
#define RCC_CFGR_HPRE_DIV2					(0x8u << 4)
#define RCC_CFGR_HPRE_DIV4					(0x9u << 4)
#define RCC_CFGR_HPRE_DIV8					(0xAu << 4)
#define RCC_CFGR_HPRE_DIV16					(0xBu << 4)
#define RCC_CFGR_HPRE_DIV64					(0xCu << 4)
#define RCC_CFGR_HPRE_DIV128					(0xDu << 4)
#define RCC_CFGR_HPRE_DIV256					(0xEu << 4)
#define RCC_CFGR_HPRE_DIV512					(0xFu << 4)
	/* System clock switch */
#define RCC_CFGR_SW_Msk						(0x3u << 0)
#define RCC_CFGR_SW_Pos						0
#define RCC_CFGR_SW_HSI						(0x0u << 0)
#define RCC_CFGR_SW_HSE						(0x1u << 0)
#define RCC_CFGR_SW_PLL						(0x2u << 0)
	/* System clock switch status */
#define RCC_CFGR_SWS_Msk					(0x3u << 2)
#define RCC_CFGR_SWS_Pos					2
#define RCC_CFGR_SWS_HSI					(0x0u << 2)
#define RCC_CFGR_SWS_HSE					(0x1u << 2)
#define RCC_CFGR_SWS_PLL					(0x2u << 2)

	/* 0x0C: clock interrupt register */
	uint32_t volatile CIR;
	/* Clock security system interrupt */
#define RCC_CIR_CSSC						(1u << 23)
#define RCC_CIR_CSSC_CLEAR					(0x1u << 23)
	/* PLLI2S ready interrupt */
#define RCC_CIR_PLLI2SRDYC					(1u << 21)
	/* Main PLL(PLL) ready interrupt */
#define RCC_CIR_PLLRDYC						(1u << 20)
	/* HSE ready interrupt clear */
#define RCC_CIR_HSERDYC						(1u << 19)
	/* HSI ready interrupt clear */
#define RCC_CIR_HSIRDYC						(1u << 18)
	/* LSE ready interrupt clear */
#define RCC_CIR_LSERDYC						(1u << 17)
	/* LSI ready interrupt clear */
#define RCC_CIR_LSIRDYC						(1u << 16)
#define RCC_CIR_LSIRDYC_CLEAR					(0x1u << 16)
	/* PLLI2S ready interrupt */
#define RCC_CIR_PLLI2SRDYIE					(1u << 13)
	/* Main PLL (PLL) ready interrupt */
#define RCC_CIR_PLLRDYIE					(1u << 12)
	/* HSE ready interrupt enable */
#define RCC_CIR_HSERDYIE					(1u << 11)
	/* HSI ready interrupt enable */
#define RCC_CIR_HSIRDYIE					(1u << 10)
	/* LSE ready interrupt enable */
#define RCC_CIR_LSERDYIE					(1u << 9)
	/* LSI ready interrupt enable */
#define RCC_CIR_LSIRDYIE					(1u << 8)
	/* Clock security system interrupt */
#define RCC_CIR_CSSF						(1u << 7)
#define RCC_CIR_CSSF_NOTINTERRUPTED				(0x0u << 7)
#define RCC_CIR_CSSF_INTERRUPTED				(0x1u << 7)
	/* PLLI2S ready interrupt */
#define RCC_CIR_PLLI2SRDYF					(1u << 5)
	/* Main PLL (PLL) ready interrupt */
#define RCC_CIR_PLLRDYF						(1u << 4)
	/* HSE ready interrupt flag */
#define RCC_CIR_HSERDYF						(1u << 3)
	/* HSI ready interrupt flag */
#define RCC_CIR_HSIRDYF						(1u << 2)
	/* LSE ready interrupt flag */
#define RCC_CIR_LSERDYF						(1u << 1)
	/* LSI ready interrupt flag */
#define RCC_CIR_LSIRDYF						(1u << 0)
#define RCC_CIR_LSIRDYF_NOTINTERRUPTED				(0x0u << 0)
#define RCC_CIR_LSIRDYF_INTERRUPTED				(0x1u << 0)

