josuah/mcu-stm32f411/registers.h
	/* 0x10: AHB1 peripheral reset register */
	uint32_t volatile AHB1RSTR;
	/* DMA2 reset */
#define RCC_AHB1RSTR_DMA2RST					(1u << 22)
	/* DMA2 reset */
#define RCC_AHB1RSTR_DMA1RST					(1u << 21)
	/* CRC reset */
#define RCC_AHB1RSTR_CRCRST					(1u << 12)
	/* IO port H reset */
#define RCC_AHB1RSTR_GPIOHRST					(1u << 7)
	/* IO port E reset */
#define RCC_AHB1RSTR_GPIOERST					(1u << 4)
	/* IO port D reset */
#define RCC_AHB1RSTR_GPIODRST					(1u << 3)
	/* IO port C reset */
#define RCC_AHB1RSTR_GPIOCRST					(1u << 2)
	/* IO port B reset */
#define RCC_AHB1RSTR_GPIOBRST					(1u << 1)
	/* IO port A reset */
#define RCC_AHB1RSTR_GPIOARST					(1u << 0)
#define RCC_AHB1RSTR_GPIOARST_RESET				(0x1u << 0)

	/* 0x14: AHB2 peripheral reset register */
	uint32_t volatile AHB2RSTR;
	/* USB OTG FS module reset */
#define RCC_AHB2RSTR_OTGFSRST					(1u << 7)
#define RCC_AHB2RSTR_OTGFSRST_RESET				(0x1u << 7)

	/* 0x18 */
	uint8_t RESERVED0[0x20u-0x18u];

	/* 0x20: APB1 peripheral reset register */
	uint32_t volatile APB1RSTR;
	/* Power interface reset */
#define RCC_APB1RSTR_PWRRST					(1u << 28)
	/* I2C3 reset */
#define RCC_APB1RSTR_I2C3RST					(1u << 23)
	/* I2C 2 reset */
#define RCC_APB1RSTR_I2C2RST					(1u << 22)
	/* I2C 1 reset */
#define RCC_APB1RSTR_I2C1RST					(1u << 21)
	/* USART 2 reset */
#define RCC_APB1RSTR_USART2RST					(1u << 17)
	/* SPI 3 reset */
#define RCC_APB1RSTR_SPI3RST					(1u << 15)
	/* SPI 2 reset */
#define RCC_APB1RSTR_SPI2RST					(1u << 14)
	/* Window watchdog reset */
#define RCC_APB1RSTR_WWDGRST					(1u << 11)
	/* TIM5 reset */
#define RCC_APB1RSTR_TIM5RST					(1u << 3)
	/* TIM4 reset */
#define RCC_APB1RSTR_TIM4RST					(1u << 2)
	/* TIM3 reset */
#define RCC_APB1RSTR_TIM3RST					(1u << 1)
	/* TIM2 reset */
#define RCC_APB1RSTR_TIM2RST					(1u << 0)
#define RCC_APB1RSTR_TIM2RST_RESET				(0x1u << 0)

	/* 0x24: APB2 peripheral reset register */
	uint32_t volatile APB2RSTR;
	/* TIM11 reset */
#define RCC_APB2RSTR_TIM11RST					(1u << 18)
	/* TIM10 reset */
#define RCC_APB2RSTR_TIM10RST					(1u << 17)
	/* TIM9 reset */
#define RCC_APB2RSTR_TIM9RST					(1u << 16)
	/* System configuration controller */
#define RCC_APB2RSTR_SYSCFGRST					(1u << 14)
	/* SPI 1 reset */
#define RCC_APB2RSTR_SPI1RST					(1u << 12)
	/* SDIO reset */
#define RCC_APB2RSTR_SDIORST					(1u << 11)
	/* ADC interface reset (common to all */
#define RCC_APB2RSTR_ADCRST					(1u << 8)
	/* USART6 reset */
#define RCC_APB2RSTR_USART6RST					(1u << 5)
	/* USART1 reset */
#define RCC_APB2RSTR_USART1RST					(1u << 4)
	/* TIM1 reset */
#define RCC_APB2RSTR_TIM1RST					(1u << 0)
#define RCC_APB2RSTR_TIM1RST_RESET				(0x1u << 0)
	/* SPI4 reset */
#define RCC_APB2RSTR_SPI4RST					(1u << 13)
	/* SPI5 reset */
#define RCC_APB2RSTR_SPI5RST					(1u << 20)

	/* 0x28 */
	uint8_t RESERVED1[0x30u-0x28u];

	/* 0x30: AHB1 peripheral clock register */
	uint32_t volatile AHB1ENR;
	/* DMA2 clock enable */
#define RCC_AHB1ENR_DMA2EN					(1u << 22)
	/* DMA1 clock enable */
#define RCC_AHB1ENR_DMA1EN					(1u << 21)
	/* CRC clock enable */
#define RCC_AHB1ENR_CRCEN					(1u << 12)
	/* IO port H clock enable */
#define RCC_AHB1ENR_GPIOHEN					(1u << 7)
	/* IO port E clock enable */
#define RCC_AHB1ENR_GPIOEEN					(1u << 4)
	/* IO port D clock enable */
#define RCC_AHB1ENR_GPIODEN					(1u << 3)
	/* IO port C clock enable */
#define RCC_AHB1ENR_GPIOCEN					(1u << 2)
	/* IO port B clock enable */
#define RCC_AHB1ENR_GPIOBEN					(1u << 1)
	/* IO port A clock enable */
#define RCC_AHB1ENR_GPIOAEN					(1u << 0)

	/* 0x34: AHB2 peripheral clock enable */
	uint32_t volatile AHB2ENR;
	/* USB OTG FS clock enable */
#define RCC_AHB2ENR_OTGFSEN					(1u << 7)

	/* 0x38 */
	uint8_t RESERVED2[0x40u-0x38u];

	/* 0x40: APB1 peripheral clock enable */
	uint32_t volatile APB1ENR;
	/* Power interface clock */
#define RCC_APB1ENR_PWREN					(1u << 28)
	/* I2C3 clock enable */
#define RCC_APB1ENR_I2C3EN					(1u << 23)
	/* I2C2 clock enable */
#define RCC_APB1ENR_I2C2EN					(1u << 22)
	/* I2C1 clock enable */
#define RCC_APB1ENR_I2C1EN					(1u << 21)
	/* USART 2 clock enable */
#define RCC_APB1ENR_USART2EN					(1u << 17)
	/* SPI3 clock enable */
#define RCC_APB1ENR_SPI3EN					(1u << 15)
	/* SPI2 clock enable */
#define RCC_APB1ENR_SPI2EN					(1u << 14)
	/* Window watchdog clock */
#define RCC_APB1ENR_WWDGEN					(1u << 11)
	/* TIM5 clock enable */
#define RCC_APB1ENR_TIM5EN					(1u << 3)
	/* TIM4 clock enable */
#define RCC_APB1ENR_TIM4EN					(1u << 2)
	/* TIM3 clock enable */
#define RCC_APB1ENR_TIM3EN					(1u << 1)
	/* TIM2 clock enable */
#define RCC_APB1ENR_TIM2EN					(1u << 0)

	/* 0x44: APB2 peripheral clock enable */
	uint32_t volatile APB2ENR;
	/* TIM1 clock enable */
#define RCC_APB2ENR_TIM1EN					(1u << 0)
	/* USART1 clock enable */
#define RCC_APB2ENR_USART1EN					(1u << 4)
	/* USART6 clock enable */
#define RCC_APB2ENR_USART6EN					(1u << 5)
	/* ADC1 clock enable */
#define RCC_APB2ENR_ADC1EN					(1u << 8)
	/* SDIO clock enable */
#define RCC_APB2ENR_SDIOEN					(1u << 11)
	/* SPI1 clock enable */
#define RCC_APB2ENR_SPI1EN					(1u << 12)
	/* SPI4 clock enable */
#define RCC_APB2ENR_SPI4EN					(1u << 13)
	/* System configuration controller clock */
#define RCC_APB2ENR_SYSCFGEN					(1u << 14)
	/* TIM9 clock enable */
#define RCC_APB2ENR_TIM9EN					(1u << 16)
	/* TIM10 clock enable */
#define RCC_APB2ENR_TIM10EN					(1u << 17)
	/* TIM11 clock enable */
#define RCC_APB2ENR_TIM11EN					(1u << 18)
	/* SPI5 clock enable */
#define RCC_APB2ENR_SPI5EN					(1u << 20)

	/* 0x48 */
	uint8_t RESERVED3[0x50u-0x48u];

	/* 0x50: AHB1 peripheral clock enable in low power */
	uint32_t volatile AHB1LPENR;
	/* DMA2 clock enable during Sleep */
#define RCC_AHB1LPENR_DMA2LPEN					(1u << 22)
	/* DMA1 clock enable during Sleep */
#define RCC_AHB1LPENR_DMA1LPEN					(1u << 21)
	/* SRAM 1interface clock enable during */
#define RCC_AHB1LPENR_SRAM1LPEN					(1u << 16)
	/* Flash interface clock enable during */
#define RCC_AHB1LPENR_FLITFLPEN					(1u << 15)
	/* CRC clock enable during Sleep */
#define RCC_AHB1LPENR_CRCLPEN					(1u << 12)
	/* IO port H clock enable during Sleep */
#define RCC_AHB1LPENR_GPIOHLPEN					(1u << 7)
	/* IO port E clock enable during Sleep */
#define RCC_AHB1LPENR_GPIOELPEN					(1u << 4)
	/* IO port D clock enable during Sleep */
#define RCC_AHB1LPENR_GPIODLPEN					(1u << 3)
	/* IO port C clock enable during Sleep */
#define RCC_AHB1LPENR_GPIOCLPEN					(1u << 2)
	/* IO port B clock enable during Sleep */
#define RCC_AHB1LPENR_GPIOBLPEN					(1u << 1)
	/* IO port A clock enable during sleep */
#define RCC_AHB1LPENR_GPIOALPEN					(1u << 0)
#define RCC_AHB1LPENR_GPIOALPEN_DISABLEDINSLEEP			(0x0u << 0)
#define RCC_AHB1LPENR_GPIOALPEN_ENABLEDINSLEEP			(0x1u << 0)

	/* 0x54: AHB2 peripheral clock enable in low power */
	uint32_t volatile AHB2LPENR;
	/* USB OTG FS clock enable during Sleep */
#define RCC_AHB2LPENR_OTGFSLPEN					(1u << 7)
#define RCC_AHB2LPENR_OTGFSLPEN_DISABLEDINSLEEP			(0x0u << 7)
#define RCC_AHB2LPENR_OTGFSLPEN_ENABLEDINSLEEP			(0x1u << 7)

	/* 0x58 */
	uint8_t RESERVED4[0x60u-0x58u];

