josuah/mcu-stm32f411/registers.h
	/* 0x60: APB1 peripheral clock enable in low power */
	uint32_t volatile APB1LPENR;
	/* Power interface clock enable during */
#define RCC_APB1LPENR_PWRLPEN					(1u << 28)
	/* I2C3 clock enable during Sleep */
#define RCC_APB1LPENR_I2C3LPEN					(1u << 23)
	/* I2C2 clock enable during Sleep */
#define RCC_APB1LPENR_I2C2LPEN					(1u << 22)
	/* I2C1 clock enable during Sleep */
#define RCC_APB1LPENR_I2C1LPEN					(1u << 21)
	/* USART2 clock enable during Sleep */
#define RCC_APB1LPENR_USART2LPEN				(1u << 17)
	/* SPI3 clock enable during Sleep */
#define RCC_APB1LPENR_SPI3LPEN					(1u << 15)
	/* SPI2 clock enable during Sleep */
#define RCC_APB1LPENR_SPI2LPEN					(1u << 14)
	/* Window watchdog clock enable during */
#define RCC_APB1LPENR_WWDGLPEN					(1u << 11)
	/* TIM5 clock enable during Sleep */
#define RCC_APB1LPENR_TIM5LPEN					(1u << 3)
	/* TIM4 clock enable during Sleep */
#define RCC_APB1LPENR_TIM4LPEN					(1u << 2)
	/* TIM3 clock enable during Sleep */
#define RCC_APB1LPENR_TIM3LPEN					(1u << 1)
	/* TIM2 clock enable during Sleep */
#define RCC_APB1LPENR_TIM2LPEN					(1u << 0)
#define RCC_APB1LPENR_TIM2LPEN_DISABLEDINSLEEP			(0x0u << 0)
#define RCC_APB1LPENR_TIM2LPEN_ENABLEDINSLEEP			(0x1u << 0)

	/* 0x64: APB2 peripheral clock enabled in low power */
	uint32_t volatile APB2LPENR;
	/* TIM1 clock enable during Sleep */
#define RCC_APB2LPENR_TIM1LPEN					(1u << 0)
#define RCC_APB2LPENR_TIM1LPEN_DISABLEDINSLEEP			(0x0u << 0)
#define RCC_APB2LPENR_TIM1LPEN_ENABLEDINSLEEP			(0x1u << 0)
	/* USART1 clock enable during Sleep */
#define RCC_APB2LPENR_USART1LPEN				(1u << 4)
	/* USART6 clock enable during Sleep */
#define RCC_APB2LPENR_USART6LPEN				(1u << 5)
	/* ADC1 clock enable during Sleep */
#define RCC_APB2LPENR_ADC1LPEN					(1u << 8)
	/* SDIO clock enable during Sleep */
#define RCC_APB2LPENR_SDIOLPEN					(1u << 11)
	/* SPI 1 clock enable during Sleep */
#define RCC_APB2LPENR_SPI1LPEN					(1u << 12)
	/* SPI4 clock enable during Sleep */
#define RCC_APB2LPENR_SPI4LPEN					(1u << 13)
	/* System configuration controller clock */
#define RCC_APB2LPENR_SYSCFGLPEN				(1u << 14)
	/* TIM9 clock enable during sleep */
#define RCC_APB2LPENR_TIM9LPEN					(1u << 16)
	/* TIM10 clock enable during Sleep */
#define RCC_APB2LPENR_TIM10LPEN					(1u << 17)
	/* TIM11 clock enable during Sleep */
#define RCC_APB2LPENR_TIM11LPEN					(1u << 18)
	/* SPI5 clock enable during Sleep mode */
#define RCC_APB2LPENR_SPI5LPEN					(1u << 20)

	/* 0x68 */
	uint8_t RESERVED5[0x70u-0x68u];

	/* 0x70: Backup domain control register */
	uint32_t volatile BDCR;
	/* Backup domain software */
#define RCC_BDCR_BDRST						(1u << 16)
	/* RTC clock enable */
#define RCC_BDCR_RTCEN						(1u << 15)
	/* External low-speed oscillator */
#define RCC_BDCR_LSEBYP						(1u << 2)
#define RCC_BDCR_LSEBYP_NOTBYPASSED				(0x0u << 2)
#define RCC_BDCR_LSEBYP_BYPASSED				(0x1u << 2)
	/* External low-speed oscillator */
#define RCC_BDCR_LSERDY						(1u << 1)
#define RCC_BDCR_LSERDY_NOTREADY				(0x0u << 1)
#define RCC_BDCR_LSERDY_READY					(0x1u << 1)
	/* External low-speed oscillator */
#define RCC_BDCR_LSEON						(1u << 0)
#define RCC_BDCR_LSEON_OFF					(0x0u << 0)
#define RCC_BDCR_LSEON_ON					(0x1u << 0)
	/* RTC clock source selection */
#define RCC_BDCR_RTCSEL_Msk					(0x3u << 8)
#define RCC_BDCR_RTCSEL_Pos					8
#define RCC_BDCR_RTCSEL_NOCLOCK					(0x0u << 8)
#define RCC_BDCR_RTCSEL_LSE					(0x1u << 8)
#define RCC_BDCR_RTCSEL_LSI					(0x2u << 8)
#define RCC_BDCR_RTCSEL_HSE					(0x3u << 8)

	/* 0x74: clock control & status */
	uint32_t volatile CSR;
	/* Low-power reset flag */
#define RCC_CSR_LPWRRSTF					(1u << 31)
	/* Window watchdog reset flag */
#define RCC_CSR_WWDGRSTF					(1u << 30)
	/* Independent watchdog reset */
#define RCC_CSR_WDGRSTF						(1u << 29)
	/* Software reset flag */
#define RCC_CSR_SFTRSTF						(1u << 28)
	/* POR/PDR reset flag */
#define RCC_CSR_PORRSTF						(1u << 27)
	/* PIN reset flag */
#define RCC_CSR_PADRSTF						(1u << 26)
	/* BOR reset flag */
#define RCC_CSR_BORRSTF						(1u << 25)
#define RCC_CSR_BORRSTF_NORESET					(0x0u << 25)
#define RCC_CSR_BORRSTF_RESET					(0x1u << 25)
	/* Remove reset flag */
#define RCC_CSR_RMVF						(1u << 24)
#define RCC_CSR_RMVF_CLEAR					(0x1u << 24)
	/* Internal low-speed oscillator */
#define RCC_CSR_LSIRDY						(1u << 1)
#define RCC_CSR_LSIRDY_NOTREADY					(0x0u << 1)
#define RCC_CSR_LSIRDY_READY					(0x1u << 1)
	/* Internal low-speed oscillator */
#define RCC_CSR_LSION						(1u << 0)
#define RCC_CSR_LSION_OFF					(0x0u << 0)
#define RCC_CSR_LSION_ON					(0x1u << 0)

	/* 0x78 */
	uint8_t RESERVED6[0x80u-0x78u];

	/* 0x80: spread spectrum clock generation */
	uint32_t volatile SSCGR;
	/* Spread spectrum modulation */
#define RCC_SSCGR_SSCGEN					(1u << 31)
	/* Spread Select */
#define RCC_SSCGR_SPREADSEL					(1u << 30)
#define RCC_SSCGR_SPREADSEL_CENTER				(0x0u << 30)
#define RCC_SSCGR_SPREADSEL_DOWN				(0x1u << 30)
	/* Incrementation step */
#define RCC_SSCGR_INCSTEP_Msk					(0x7FFFu << 13)
#define RCC_SSCGR_INCSTEP_Pos					13
	/* Modulation period */
#define RCC_SSCGR_MODPER_Msk					(0x1FFFu << 0)
#define RCC_SSCGR_MODPER_Pos					0

	/* 0x84: PLLI2S configuration register */
	uint32_t volatile PLLI2SCFGR;
	/* PLLI2S division factor for I2S */
#define RCC_PLLI2SCFGR_PLLI2SR_Msk				(0x7u << 28)
#define RCC_PLLI2SCFGR_PLLI2SR_Pos				28
	/* PLLI2S multiplication factor for */
#define RCC_PLLI2SCFGR_PLLI2SN_Msk				(0x1FFu << 6)
#define RCC_PLLI2SCFGR_PLLI2SN_Pos				6
	/* Division factor for the audio PLL (PLLI2S) input clock */
#define RCC_PLLI2SCFGR_PLLI2SM_Msk				(0x3Fu << 0)
#define RCC_PLLI2SCFGR_PLLI2SM_Pos				0

	/* 0x88 */
	uint8_t RESERVED7[0x8Cu-0x88u];

	/* 0x8C: RCC Dedicated Clock Configuration Register */
	uint32_t volatile DCKCFGR;
	/* Timers clocks prescalers selection */
#define RCC_DCKCFGR_TIMPRE					(1u << 24)
#define RCC_DCKCFGR_TIMPRE_MUL2					(0x0u << 24)
#define RCC_DCKCFGR_TIMPRE_MUL4					(0x1u << 24)

};


#define RTC ((struct mcu_rtc *)0x40002800)

struct mcu_rtc {

	/* 0x00: time register */
	uint32_t volatile TR;
	/* AM/PM notation */
#define RTC_TR_PM						(1u << 22)
#define RTC_TR_PM_AM						(0x0u << 22)
#define RTC_TR_PM_PM						(0x1u << 22)
	/* Hour tens in BCD format */
#define RTC_TR_HT_Msk						(0x3u << 20)
#define RTC_TR_HT_Pos						20
	/* Hour units in BCD format */
#define RTC_TR_HU_Msk						(0xFu << 16)
#define RTC_TR_HU_Pos						16
	/* Minute tens in BCD format */
#define RTC_TR_MNT_Msk						(0x7u << 12)
#define RTC_TR_MNT_Pos						12
	/* Minute units in BCD format */
#define RTC_TR_MNU_Msk						(0xFu << 8)
#define RTC_TR_MNU_Pos						8
	/* Second tens in BCD format */
#define RTC_TR_ST_Msk						(0x7u << 4)
#define RTC_TR_ST_Pos						4
	/* Second units in BCD format */
#define RTC_TR_SU_Msk						(0xFu << 0)
#define RTC_TR_SU_Pos						0

