josuah/mcu-stm32f411/registers.h
	/* 0x04: date register */
	uint32_t volatile DR;
	/* Year tens in BCD format */
#define RTC_DR_YT_Msk						(0xFu << 20)
#define RTC_DR_YT_Pos						20
	/* Year units in BCD format */
#define RTC_DR_YU_Msk						(0xFu << 16)
#define RTC_DR_YU_Pos						16
	/* Week day units */
#define RTC_DR_WDU_Msk						(0x7u << 13)
#define RTC_DR_WDU_Pos						13
	/* Month tens in BCD format */
#define RTC_DR_MT						(1u << 12)
	/* Month units in BCD format */
#define RTC_DR_MU_Msk						(0xFu << 8)
#define RTC_DR_MU_Pos						8
	/* Date tens in BCD format */
#define RTC_DR_DT_Msk						(0x3u << 4)
#define RTC_DR_DT_Pos						4
	/* Date units in BCD format */
#define RTC_DR_DU_Msk						(0xFu << 0)
#define RTC_DR_DU_Pos						0

	/* 0x08: control register */
	uint32_t volatile CR;
	/* Calibration output enable */
#define RTC_CR_COE						(1u << 23)
	/* Output selection */
#define RTC_CR_OSEL_Msk						(0x3u << 21)
#define RTC_CR_OSEL_Pos						21
#define RTC_CR_OSEL_DISABLED					(0x0u << 21)
#define RTC_CR_OSEL_ALARMA					(0x1u << 21)
#define RTC_CR_OSEL_ALARMB					(0x2u << 21)
#define RTC_CR_OSEL_WAKEUP					(0x3u << 21)
	/* Output polarity */
#define RTC_CR_POL						(1u << 20)
#define RTC_CR_POL_HIGH						(0x0u << 20)
#define RTC_CR_POL_LOW						(0x1u << 20)
	/* Calibration Output */
#define RTC_CR_COSEL						(1u << 19)
#define RTC_CR_COSEL_CALFREQ_512HZ				(0x0u << 19)
#define RTC_CR_COSEL_CALFREQ_1HZ				(0x1u << 19)
	/* Backup */
#define RTC_CR_BKP						(1u << 18)
#define RTC_CR_BKP_DST_NOT_CHANGED				(0x0u << 18)
#define RTC_CR_BKP_DST_CHANGED					(0x1u << 18)
	/* Subtract 1 hour (winter time */
#define RTC_CR_SUB1H						(1u << 17)
#define RTC_CR_SUB1H_SUB1					(0x1u << 17)
	/* Add 1 hour (summer time */
#define RTC_CR_ADD1H						(1u << 16)
#define RTC_CR_ADD1H_ADD1					(0x1u << 16)
	/* Time-stamp interrupt */
#define RTC_CR_TSIE						(1u << 15)
	/* Wakeup timer interrupt */
#define RTC_CR_WUTIE						(1u << 14)
	/* Alarm B interrupt enable */
#define RTC_CR_ALRBIE						(1u << 13)
	/* Alarm A interrupt enable */
#define RTC_CR_ALRAIE						(1u << 12)
	/* Time stamp enable */
#define RTC_CR_TSE						(1u << 11)
	/* Wakeup timer enable */
#define RTC_CR_WUTE						(1u << 10)
	/* Alarm B enable */
#define RTC_CR_ALRBE						(1u << 9)
	/* Alarm A enable */
#define RTC_CR_ALRAE						(1u << 8)
	/* Coarse digital calibration */
#define RTC_CR_DCE						(1u << 7)
	/* Hour format */
#define RTC_CR_FMT						(1u << 6)
#define RTC_CR_FMT_TWENTY_FOUR_HOUR				(0x0u << 6)
#define RTC_CR_FMT_AM_PM					(0x1u << 6)
	/* Bypass the shadow */
#define RTC_CR_BYPSHAD						(1u << 5)
#define RTC_CR_BYPSHAD_SHADOWREG				(0x0u << 5)
#define RTC_CR_BYPSHAD_BYPASSSHADOWREG				(0x1u << 5)
	/* Reference clock detection enable (50 or */
#define RTC_CR_REFCKON						(1u << 4)
	/* Time-stamp event active */
#define RTC_CR_TSEDGE						(1u << 3)
#define RTC_CR_TSEDGE_RISINGEDGE				(0x0u << 3)
#define RTC_CR_TSEDGE_FALLINGEDGE				(0x1u << 3)
	/* Wakeup clock selection */
#define RTC_CR_WUCKSEL_Msk					(0x7u << 0)
#define RTC_CR_WUCKSEL_Pos					0
#define RTC_CR_WUCKSEL_DIV16					(0x0u << 0)
#define RTC_CR_WUCKSEL_DIV8					(0x1u << 0)
#define RTC_CR_WUCKSEL_DIV4					(0x2u << 0)
#define RTC_CR_WUCKSEL_DIV2					(0x3u << 0)
#define RTC_CR_WUCKSEL_CLOCKSPARE				(0x4u << 0)
#define RTC_CR_WUCKSEL_CLOCKSPAREWITHOFFSET			(0x6u << 0)

	/* 0x0C: initialization and status */
	uint32_t volatile ISR;
	/* Alarm A write flag */
#define RTC_ISR_ALRAWF						(1u << 0)
#define RTC_ISR_ALRAWF_UPDATENOTALLOWED				(0x0u << 0)
#define RTC_ISR_ALRAWF_UPDATEALLOWED				(0x1u << 0)
	/* Alarm B write flag */
#define RTC_ISR_ALRBWF						(1u << 1)
	/* Wakeup timer write flag */
#define RTC_ISR_WUTWF						(1u << 2)
#define RTC_ISR_WUTWF_UPDATENOTALLOWED				(0x0u << 2)
#define RTC_ISR_WUTWF_UPDATEALLOWED				(0x1u << 2)
	/* Shift operation pending */
#define RTC_ISR_SHPF						(1u << 3)
#define RTC_ISR_SHPF_NOSHIFTPENDING				(0x0u << 3)
#define RTC_ISR_SHPF_SHIFTPENDING				(0x1u << 3)
	/* Initialization status flag */
#define RTC_ISR_INITS						(1u << 4)
#define RTC_ISR_INITS_NOTINITALIZED				(0x0u << 4)
#define RTC_ISR_INITS_INITALIZED				(0x1u << 4)
	/* Registers synchronization */
#define RTC_ISR_RSF						(1u << 5)
#define RTC_ISR_RSF_NOTSYNCED					(0x0u << 5)
#define RTC_ISR_RSF_SYNCED					(0x1u << 5)
#define RTC_ISR_RSF_CLEAR					(0x0u << 5)
	/* Initialization flag */
#define RTC_ISR_INITF						(1u << 6)
#define RTC_ISR_INITF_NOTALLOWED				(0x0u << 6)
#define RTC_ISR_INITF_ALLOWED					(0x1u << 6)
	/* Initialization mode */
#define RTC_ISR_INIT						(1u << 7)
#define RTC_ISR_INIT_FREERUNNINGMODE				(0x0u << 7)
#define RTC_ISR_INIT_INITMODE					(0x1u << 7)
	/* Alarm A flag */
#define RTC_ISR_ALRAF						(1u << 8)
#define RTC_ISR_ALRAF_MATCH					(0x1u << 8)
#define RTC_ISR_ALRAF_CLEAR					(0x0u << 8)
	/* Alarm B flag */
#define RTC_ISR_ALRBF						(1u << 9)
#define RTC_ISR_ALRBF_MATCH					(0x1u << 9)
#define RTC_ISR_ALRBF_CLEAR					(0x0u << 9)
	/* Wakeup timer flag */
#define RTC_ISR_WUTF						(1u << 10)
#define RTC_ISR_WUTF_ZERO					(0x1u << 10)
#define RTC_ISR_WUTF_CLEAR					(0x0u << 10)
	/* Time-stamp flag */
#define RTC_ISR_TSF						(1u << 11)
#define RTC_ISR_TSF_TIMESTAMPEVENT				(0x1u << 11)
#define RTC_ISR_TSF_CLEAR					(0x0u << 11)
	/* Time-stamp overflow flag */
#define RTC_ISR_TSOVF						(1u << 12)
#define RTC_ISR_TSOVF_OVERFLOW					(0x1u << 12)
#define RTC_ISR_TSOVF_CLEAR					(0x0u << 12)
	/* Tamper detection flag */
#define RTC_ISR_TAMP1F						(1u << 13)
#define RTC_ISR_TAMP1F_TAMPERED					(0x1u << 13)
#define RTC_ISR_TAMP1F_CLEAR					(0x0u << 13)
	/* TAMPER2 detection flag */
#define RTC_ISR_TAMP2F						(1u << 14)
	/* Recalibration pending Flag */
#define RTC_ISR_RECALPF						(1u << 16)
#define RTC_ISR_RECALPF_PENDING					(0x1u << 16)

	/* 0x10: prescaler register */
	uint32_t volatile PRER;
	/* Asynchronous prescaler */
#define RTC_PRER_PREDIV_A_Msk					(0x7Fu << 16)
#define RTC_PRER_PREDIV_A_Pos					16
	/* Synchronous prescaler */
#define RTC_PRER_PREDIV_S_Msk					(0x7FFFu << 0)
#define RTC_PRER_PREDIV_S_Pos					0

	/* 0x14: wakeup timer register */
	uint32_t volatile WUTR;
	/* Wakeup auto-reload value */
#define RTC_WUTR_WUT_Msk					(0xFFFFu << 0)
#define RTC_WUTR_WUT_Pos					0

	/* 0x18: calibration register */
	uint32_t volatile CALIBR;
	/* Digital calibration sign */
#define RTC_CALIBR_DCS						(1u << 7)
	/* Digital calibration */
#define RTC_CALIBR_DC_Msk					(0x1Fu << 0)
#define RTC_CALIBR_DC_Pos					0

	/* 0x1C: alarm A register */
	uint32_t volatile ALRMAR;
	/* Alarm A date mask */
#define RTC_ALRMAR_MSK4						(1u << 31)
	/* Week day selection */
#define RTC_ALRMAR_WDSEL					(1u << 30)
#define RTC_ALRMAR_WDSEL_DATEUNITS				(0x0u << 30)
#define RTC_ALRMAR_WDSEL_WEEKDAY				(0x1u << 30)
	/* Date tens in BCD format */
#define RTC_ALRMAR_DT_Msk					(0x3u << 28)
#define RTC_ALRMAR_DT_Pos					28
	/* Date units or day in BCD */
#define RTC_ALRMAR_DU_Msk					(0xFu << 24)
#define RTC_ALRMAR_DU_Pos					24
	/* Alarm A hours mask */
#define RTC_ALRMAR_MSK3						(1u << 23)
	/* AM/PM notation */
#define RTC_ALRMAR_PM						(1u << 22)
#define RTC_ALRMAR_PM_AM					(0x0u << 22)
#define RTC_ALRMAR_PM_PM					(0x1u << 22)
	/* Hour tens in BCD format */
#define RTC_ALRMAR_HT_Msk					(0x3u << 20)
#define RTC_ALRMAR_HT_Pos					20
	/* Hour units in BCD format */
#define RTC_ALRMAR_HU_Msk					(0xFu << 16)
#define RTC_ALRMAR_HU_Pos					16
	/* Alarm A minutes mask */
#define RTC_ALRMAR_MSK2						(1u << 15)
	/* Minute tens in BCD format */
#define RTC_ALRMAR_MNT_Msk					(0x7u << 12)
#define RTC_ALRMAR_MNT_Pos					12
	/* Minute units in BCD format */
#define RTC_ALRMAR_MNU_Msk					(0xFu << 8)
#define RTC_ALRMAR_MNU_Pos					8
	/* Alarm A seconds mask */
#define RTC_ALRMAR_MSK1						(1u << 7)
#define RTC_ALRMAR_MSK1_MASK					(0x0u << 7)
#define RTC_ALRMAR_MSK1_NOTMASK					(0x1u << 7)
	/* Second tens in BCD format */
#define RTC_ALRMAR_ST_Msk					(0x7u << 4)
#define RTC_ALRMAR_ST_Pos					4
	/* Second units in BCD format */
#define RTC_ALRMAR_SU_Msk					(0xFu << 0)
#define RTC_ALRMAR_SU_Pos					0

	/* 0x20: alarm B register */
	uint32_t volatile ALRMBR;
	/* Alarm B date mask */
#define RTC_ALRMBR_MSK4						(1u << 31)
	/* Week day selection */
#define RTC_ALRMBR_WDSEL					(1u << 30)
#define RTC_ALRMBR_WDSEL_DATEUNITS				(0x0u << 30)
#define RTC_ALRMBR_WDSEL_WEEKDAY				(0x1u << 30)
	/* Date tens in BCD format */
#define RTC_ALRMBR_DT_Msk					(0x3u << 28)
#define RTC_ALRMBR_DT_Pos					28
	/* Date units or day in BCD */
#define RTC_ALRMBR_DU_Msk					(0xFu << 24)
#define RTC_ALRMBR_DU_Pos					24
	/* Alarm B hours mask */
#define RTC_ALRMBR_MSK3						(1u << 23)
	/* AM/PM notation */
#define RTC_ALRMBR_PM						(1u << 22)
#define RTC_ALRMBR_PM_AM					(0x0u << 22)
#define RTC_ALRMBR_PM_PM					(0x1u << 22)
	/* Hour tens in BCD format */
#define RTC_ALRMBR_HT_Msk					(0x3u << 20)
#define RTC_ALRMBR_HT_Pos					20
	/* Hour units in BCD format */
#define RTC_ALRMBR_HU_Msk					(0xFu << 16)
#define RTC_ALRMBR_HU_Pos					16
	/* Alarm B minutes mask */
#define RTC_ALRMBR_MSK2						(1u << 15)
	/* Minute tens in BCD format */
#define RTC_ALRMBR_MNT_Msk					(0x7u << 12)
#define RTC_ALRMBR_MNT_Pos					12
	/* Minute units in BCD format */
#define RTC_ALRMBR_MNU_Msk					(0xFu << 8)
#define RTC_ALRMBR_MNU_Pos					8
	/* Alarm B seconds mask */
#define RTC_ALRMBR_MSK1						(1u << 7)
#define RTC_ALRMBR_MSK1_MASK					(0x0u << 7)
#define RTC_ALRMBR_MSK1_NOTMASK					(0x1u << 7)
	/* Second tens in BCD format */
#define RTC_ALRMBR_ST_Msk					(0x7u << 4)
#define RTC_ALRMBR_ST_Pos					4
	/* Second units in BCD format */
#define RTC_ALRMBR_SU_Msk					(0xFu << 0)
#define RTC_ALRMBR_SU_Pos					0

