josuah/mcu-stm32f411/registers.h
	/* 0x24: write protection register */
	uint32_t volatile WPR;
	/* Write protection key */
#define RTC_WPR_KEY_Msk						(0xFFu << 0)
#define RTC_WPR_KEY_Pos						0

	/* 0x28: sub second register */
	uint32_t volatile const SSR;
	/* Sub second value */
#define RTC_SSR_SS_Msk						(0xFFFFu << 0)
#define RTC_SSR_SS_Pos						0

	/* 0x2C: shift control register */
	uint32_t volatile SHIFTR;
	/* Add one second */
#define RTC_SHIFTR_ADD1S					(1u << 31)
#define RTC_SHIFTR_ADD1S_ADD1					(0x1u << 31)
	/* Subtract a fraction of a */
#define RTC_SHIFTR_SUBFS_Msk					(0x7FFFu << 0)
#define RTC_SHIFTR_SUBFS_Pos					0

	/* 0x30: time stamp time register */
	uint32_t volatile const TSTR;
	/* AM/PM notation */
#define RTC_TSTR_PM						(1u << 22)
	/* Hour tens in BCD format */
#define RTC_TSTR_HT_Msk						(0x3u << 20)
#define RTC_TSTR_HT_Pos						20
	/* Hour units in BCD format */
#define RTC_TSTR_HU_Msk						(0xFu << 16)
#define RTC_TSTR_HU_Pos						16
	/* Minute tens in BCD format */
#define RTC_TSTR_MNT_Msk					(0x7u << 12)
#define RTC_TSTR_MNT_Pos					12
	/* Minute units in BCD format */
#define RTC_TSTR_MNU_Msk					(0xFu << 8)
#define RTC_TSTR_MNU_Pos					8
	/* Second tens in BCD format */
#define RTC_TSTR_ST_Msk						(0x7u << 4)
#define RTC_TSTR_ST_Pos						4
	/* Second units in BCD format */
#define RTC_TSTR_SU_Msk						(0xFu << 0)
#define RTC_TSTR_SU_Pos						0

	/* 0x34: time stamp date register */
	uint32_t volatile const TSDR;
	/* Week day units */
#define RTC_TSDR_WDU_Msk					(0x7u << 13)
#define RTC_TSDR_WDU_Pos					13
	/* Month tens in BCD format */
#define RTC_TSDR_MT						(1u << 12)
	/* Month units in BCD format */
#define RTC_TSDR_MU_Msk						(0xFu << 8)
#define RTC_TSDR_MU_Pos						8
	/* Date tens in BCD format */
#define RTC_TSDR_DT_Msk						(0x3u << 4)
#define RTC_TSDR_DT_Pos						4
	/* Date units in BCD format */
#define RTC_TSDR_DU_Msk						(0xFu << 0)
#define RTC_TSDR_DU_Pos						0

	/* 0x38: timestamp sub second register */
	uint32_t volatile const TSSSR;
	/* Sub second value */
#define RTC_TSSSR_SS_Msk					(0xFFFFu << 0)
#define RTC_TSSSR_SS_Pos					0

	/* 0x3C: calibration register */
	uint32_t volatile CALR;
	/* Increase frequency of RTC by 488.5 */
#define RTC_CALR_CALP						(1u << 15)
#define RTC_CALR_CALP_NOCHANGE					(0x0u << 15)
#define RTC_CALR_CALP_INCREASEFREQ				(0x1u << 15)
	/* Use an 8-second calibration cycle */
#define RTC_CALR_CALW8						(1u << 14)
#define RTC_CALR_CALW8_EIGHT_SECOND				(0x1u << 14)
	/* Use a 16-second calibration cycle */
#define RTC_CALR_CALW16						(1u << 13)
#define RTC_CALR_CALW16_SIXTEEN_SECOND				(0x1u << 13)
	/* Calibration minus */
#define RTC_CALR_CALM_Msk					(0x1FFu << 0)
#define RTC_CALR_CALM_Pos					0

	/* 0x40: tamper and alternate function configuration */
	uint32_t volatile TAFCR;
	/* AFO_ALARM output type */
#define RTC_TAFCR_ALARMOUTTYPE					(1u << 18)
	/* TIMESTAMP mapping */
#define RTC_TAFCR_TSINSEL					(1u << 17)
	/* TAMPER1 mapping */
#define RTC_TAFCR_TAMP1INSEL					(1u << 16)
	/* TAMPER pull-up disable */
#define RTC_TAFCR_TAMPPUDIS					(1u << 15)
	/* Tamper precharge duration */
#define RTC_TAFCR_TAMPPRCH_Msk					(0x3u << 13)
#define RTC_TAFCR_TAMPPRCH_Pos					13
	/* Tamper filter count */
#define RTC_TAFCR_TAMPFLT_Msk					(0x3u << 11)
#define RTC_TAFCR_TAMPFLT_Pos					11
	/* Tamper sampling frequency */
#define RTC_TAFCR_TAMPFREQ_Msk					(0x7u << 8)
#define RTC_TAFCR_TAMPFREQ_Pos					8
	/* Activate timestamp on tamper detection */
#define RTC_TAFCR_TAMPTS					(1u << 7)
	/* Active level for tamper 2 */
#define RTC_TAFCR_TAMP2TRG					(1u << 4)
	/* Tamper 2 detection enable */
#define RTC_TAFCR_TAMP2E					(1u << 3)
	/* Tamper interrupt enable */
#define RTC_TAFCR_TAMPIE					(1u << 2)
	/* Active level for tamper 1 */
#define RTC_TAFCR_TAMP1TRG					(1u << 1)
	/* Tamper 1 detection enable */
#define RTC_TAFCR_TAMP1E					(1u << 0)

	/* 0x44: alarm A sub second register */
	uint32_t volatile ALRMASSR;
	/* Mask the most-significant bits starting */
#define RTC_ALRMASSR_MASKSS_Msk					(0xFu << 24)
#define RTC_ALRMASSR_MASKSS_Pos					24
	/* Sub seconds value */
#define RTC_ALRMASSR_SS_Msk					(0x7FFFu << 0)
#define RTC_ALRMASSR_SS_Pos					0

	/* 0x48: alarm B sub second register */
	uint32_t volatile ALRMBSSR;
	/* Mask the most-significant bits starting */
#define RTC_ALRMBSSR_MASKSS_Msk					(0xFu << 24)
#define RTC_ALRMBSSR_MASKSS_Pos					24
	/* Sub seconds value */
#define RTC_ALRMBSSR_SS_Msk					(0x7FFFu << 0)
#define RTC_ALRMBSSR_SS_Pos					0

	/* 0x4C */
	uint8_t RESERVED0[0x50u-0x4Cu];

	/* 0x50: backup register */
	uint32_t volatile BKPR[20];
	/* BKP */
#define RTC_BKPR_BKP_Msk					(0xFFFFFFFFu << 0)
#define RTC_BKPR_BKP_Pos					0

};


#define SDIO ((struct mcu_sdio *)0x40012C00)

struct mcu_sdio {

	/* 0x00: power control register */
	uint32_t volatile POWER;
	/* PWRCTRL */
#define SDIO_POWER_PWRCTRL_Msk					(0x3u << 0)
#define SDIO_POWER_PWRCTRL_Pos					0
#define SDIO_POWER_PWRCTRL_POWEROFF				(0x0u << 0)
#define SDIO_POWER_PWRCTRL_POWERON				(0x3u << 0)

	/* 0x04: SDI clock control register */
	uint32_t volatile CLKCR;
	/* HW Flow Control enable */
#define SDIO_CLKCR_HWFC_EN					(1u << 14)
	/* SDIO_CK dephasing selection */
#define SDIO_CLKCR_NEGEDGE					(1u << 13)
#define SDIO_CLKCR_NEGEDGE_RISING				(0x0u << 13)
#define SDIO_CLKCR_NEGEDGE_FALLING				(0x1u << 13)
	/* Wide bus mode enable bit */
#define SDIO_CLKCR_WIDBUS_Msk					(0x3u << 11)
#define SDIO_CLKCR_WIDBUS_Pos					11
#define SDIO_CLKCR_WIDBUS_BUSWIDTH1				(0x0u << 11)
#define SDIO_CLKCR_WIDBUS_BUSWIDTH4				(0x1u << 11)
#define SDIO_CLKCR_WIDBUS_BUSWIDTH8				(0x2u << 11)
	/* Clock divider bypass enable */
#define SDIO_CLKCR_BYPASS					(1u << 10)
	/* Power saving configuration */
#define SDIO_CLKCR_PWRSAV					(1u << 9)
#define SDIO_CLKCR_PWRSAV_DISABLED				(0x1u << 9)
#define SDIO_CLKCR_PWRSAV_ENABLED				(0x0u << 9)
	/* Clock enable bit */
#define SDIO_CLKCR_CLKEN					(1u << 8)
	/* Clock divide factor */
#define SDIO_CLKCR_CLKDIV_Msk					(0xFFu << 0)
#define SDIO_CLKCR_CLKDIV_Pos					0

	/* 0x08: argument register */
	uint32_t volatile ARG;
	/* Command argument */
#define SDIO_ARG_CMDARG_Msk					(0xFFFFFFFFu << 0)
#define SDIO_ARG_CMDARG_Pos					0

