josuah/mcu-stm32f411/registers.h
	/* 0x0C: command register */
	uint32_t volatile CMD;
	/* CE-ATA command */
#define SDIO_CMD_CE_ATACMD					(1u << 14)
	/* not Interrupt Enable */
#define SDIO_CMD_NIEN						(1u << 13)
	/* Enable CMD completion */
#define SDIO_CMD_ENCMDCOMPL					(1u << 12)
	/* SD I/O suspend command */
#define SDIO_CMD_SDIOSUSPEND					(1u << 11)
	/* Command path state machine (CPSM) Enable */
#define SDIO_CMD_CPSMEN						(1u << 10)
	/* CPSM Waits for ends of data transfer */
#define SDIO_CMD_WAITPEND					(1u << 9)
	/* CPSM waits for interrupt */
#define SDIO_CMD_WAITINT					(1u << 8)
	/* Wait for response bits */
#define SDIO_CMD_WAITRESP_Msk					(0x3u << 6)
#define SDIO_CMD_WAITRESP_Pos					6
#define SDIO_CMD_WAITRESP_NORESPONSE				(0x0u << 6)
#define SDIO_CMD_WAITRESP_SHORTRESPONSE				(0x1u << 6)
#define SDIO_CMD_WAITRESP_NORESPONSE2				(0x2u << 6)
#define SDIO_CMD_WAITRESP_LONGRESPONSE				(0x3u << 6)
	/* Command index */
#define SDIO_CMD_CMDINDEX_Msk					(0x3Fu << 0)
#define SDIO_CMD_CMDINDEX_Pos					0

	/* 0x10: command response register */
	uint32_t volatile const RESPCMD;
	/* Response command index */
#define SDIO_RESPCMD_RESPCMD_Msk				(0x3Fu << 0)
#define SDIO_RESPCMD_RESPCMD_Pos				0

	/* 0x14: response 1..4 register */
	uint32_t volatile const RESP1;
	/* Card Status */
#define SDIO_RESP1_CARDSTATUS1_Msk				(0xFFFFFFFFu << 0)
#define SDIO_RESP1_CARDSTATUS1_Pos				0

	/* 0x18: response 1..4 register */
	uint32_t volatile const RESP2;
	/* Card Status */
#define SDIO_RESP2_CARDSTATUS2_Msk				(0xFFFFFFFFu << 0)
#define SDIO_RESP2_CARDSTATUS2_Pos				0

	/* 0x1C: response 1..4 register */
	uint32_t volatile const RESP3;
	/* Card Status */
#define SDIO_RESP3_CARDSTATUS3_Msk				(0xFFFFFFFFu << 0)
#define SDIO_RESP3_CARDSTATUS3_Pos				0

	/* 0x20: response 1..4 register */
	uint32_t volatile const RESP4;
	/* Card Status */
#define SDIO_RESP4_CARDSTATUS4_Msk				(0xFFFFFFFFu << 0)
#define SDIO_RESP4_CARDSTATUS4_Pos				0

	/* 0x24: data timer register */
	uint32_t volatile DTIMER;
	/* Data timeout period */
#define SDIO_DTIMER_DATATIME_Msk				(0xFFFFFFFFu << 0)
#define SDIO_DTIMER_DATATIME_Pos				0

	/* 0x28: data length register */
	uint32_t volatile DLEN;
	/* Data length value */
#define SDIO_DLEN_DATALENGTH_Msk				(0x1FFFFFFu << 0)
#define SDIO_DLEN_DATALENGTH_Pos				0

	/* 0x2C: data control register */
	uint32_t volatile DCTRL;
	/* SD I/O enable functions */
#define SDIO_DCTRL_SDIOEN					(1u << 11)
	/* Read wait mode */
#define SDIO_DCTRL_RWMOD					(1u << 10)
#define SDIO_DCTRL_RWMOD_D2					(0x0u << 10)
#define SDIO_DCTRL_RWMOD_CK					(0x1u << 10)
	/* Read wait stop */
#define SDIO_DCTRL_RWSTOP					(1u << 9)
	/* Read wait start */
#define SDIO_DCTRL_RWSTART					(1u << 8)
	/* Data block size */
#define SDIO_DCTRL_DBLOCKSIZE_Msk				(0xFu << 4)
#define SDIO_DCTRL_DBLOCKSIZE_Pos				4
	/* DMA enable bit */
#define SDIO_DCTRL_DMAEN					(1u << 3)
	/* Data transfer mode selection 1: Stream */
#define SDIO_DCTRL_DTMODE					(1u << 2)
#define SDIO_DCTRL_DTMODE_BLOCKMODE				(0x0u << 2)
#define SDIO_DCTRL_DTMODE_STREAMMODE				(0x1u << 2)
	/* Data transfer direction */
#define SDIO_DCTRL_DTDIR					(1u << 1)
#define SDIO_DCTRL_DTDIR_CONTROLLERTOCARD			(0x0u << 1)
#define SDIO_DCTRL_DTDIR_CARDTOCONTROLLER			(0x1u << 1)
	/* DTEN */
#define SDIO_DCTRL_DTEN						(1u << 0)

	/* 0x30: data counter register */
	uint32_t volatile const DCOUNT;
	/* Data count value */
#define SDIO_DCOUNT_DATACOUNT_Msk				(0x1FFFFFFu << 0)
#define SDIO_DCOUNT_DATACOUNT_Pos				0

	/* 0x34: status register */
	uint32_t volatile const STA;
	/* CE-ATA command completion signal */
#define SDIO_STA_CEATAEND					(1u << 23)
#define SDIO_STA_CEATAEND_NOTRECEIVED				(0x0u << 23)
#define SDIO_STA_CEATAEND_RECEIVED				(0x1u << 23)
	/* SDIO interrupt received */
#define SDIO_STA_SDIOIT						(1u << 22)
#define SDIO_STA_SDIOIT_NOTRECEIVED				(0x0u << 22)
#define SDIO_STA_SDIOIT_RECEIVED				(0x1u << 22)
	/* Data available in receive */
#define SDIO_STA_RXDAVL						(1u << 21)
#define SDIO_STA_RXDAVL_NOTAVAILABLE				(0x0u << 21)
#define SDIO_STA_RXDAVL_AVAILABLE				(0x1u << 21)
	/* Data available in transmit */
#define SDIO_STA_TXDAVL						(1u << 20)
#define SDIO_STA_TXDAVL_NOTAVAILABLE				(0x0u << 20)
#define SDIO_STA_TXDAVL_AVAILABLE				(0x1u << 20)
	/* Receive FIFO empty */
#define SDIO_STA_RXFIFOE					(1u << 19)
#define SDIO_STA_RXFIFOE_NOTEMPTY				(0x0u << 19)
#define SDIO_STA_RXFIFOE_EMPTY					(0x1u << 19)
	/* Transmit FIFO empty */
#define SDIO_STA_TXFIFOE					(1u << 18)
#define SDIO_STA_TXFIFOE_NOTEMPTY				(0x0u << 18)
#define SDIO_STA_TXFIFOE_EMPTY					(0x1u << 18)
	/* Receive FIFO full */
#define SDIO_STA_RXFIFOF					(1u << 17)
#define SDIO_STA_RXFIFOF_NOTFULL				(0x0u << 17)
#define SDIO_STA_RXFIFOF_FULL					(0x1u << 17)
	/* Transmit FIFO full */
#define SDIO_STA_TXFIFOF					(1u << 16)
#define SDIO_STA_TXFIFOF_NOTFULL				(0x0u << 16)
#define SDIO_STA_TXFIFOF_FULL					(0x1u << 16)
	/* Receive FIFO half full: there are at */
#define SDIO_STA_RXFIFOHF					(1u << 15)
#define SDIO_STA_RXFIFOHF_NOTHALFFULL				(0x0u << 15)
#define SDIO_STA_RXFIFOHF_HALFFULL				(0x1u << 15)
	/* Transmit FIFO half empty: at least 8 */
#define SDIO_STA_TXFIFOHE					(1u << 14)
#define SDIO_STA_TXFIFOHE_NOTHALFEMPTY				(0x0u << 14)
#define SDIO_STA_TXFIFOHE_HALFEMPTY				(0x1u << 14)
	/* Data receive in progress */
#define SDIO_STA_RXACT						(1u << 13)
#define SDIO_STA_RXACT_NOTINPROGRESS				(0x0u << 13)
#define SDIO_STA_RXACT_INPROGRESS				(0x1u << 13)
	/* Data transmit in progress */
#define SDIO_STA_TXACT						(1u << 12)
#define SDIO_STA_TXACT_NOTINPROGRESS				(0x0u << 12)
#define SDIO_STA_TXACT_INPROGRESS				(0x1u << 12)
	/* Command transfer in */
#define SDIO_STA_CMDACT						(1u << 11)
#define SDIO_STA_CMDACT_NOTINPROGRESS				(0x0u << 11)
#define SDIO_STA_CMDACT_INPROGRESS				(0x1u << 11)
	/* Data block sent/received (CRC check */
#define SDIO_STA_DBCKEND					(1u << 10)
#define SDIO_STA_DBCKEND_NOTTRANSFERRED				(0x0u << 10)
#define SDIO_STA_DBCKEND_TRANSFERRED				(0x1u << 10)
	/* Start bit not detected on all data */
#define SDIO_STA_STBITERR					(1u << 9)
#define SDIO_STA_STBITERR_DETECTED				(0x0u << 9)
#define SDIO_STA_STBITERR_NOTDETECTED				(0x1u << 9)
	/* Data end (data counter, SDIDCOUNT, is */
#define SDIO_STA_DATAEND					(1u << 8)
#define SDIO_STA_DATAEND_DONE					(0x1u << 8)
#define SDIO_STA_DATAEND_NOTDONE				(0x0u << 8)
	/* Command sent (no response */
#define SDIO_STA_CMDSENT					(1u << 7)
#define SDIO_STA_CMDSENT_NOTSENT				(0x0u << 7)
#define SDIO_STA_CMDSENT_SENT					(0x1u << 7)
	/* Command response received (CRC check */
#define SDIO_STA_CMDREND					(1u << 6)
#define SDIO_STA_CMDREND_NOTDONE				(0x0u << 6)
#define SDIO_STA_CMDREND_DONE					(0x1u << 6)
	/* Received FIFO overrun */
#define SDIO_STA_RXOVERR					(1u << 5)
#define SDIO_STA_RXOVERR_NOOVERRUN				(0x0u << 5)
#define SDIO_STA_RXOVERR_OVERRUN				(0x1u << 5)
	/* Transmit FIFO underrun */
#define SDIO_STA_TXUNDERR					(1u << 4)
#define SDIO_STA_TXUNDERR_NOUNDERRUN				(0x0u << 4)
#define SDIO_STA_TXUNDERR_UNDERRUN				(0x1u << 4)
	/* Data timeout */
#define SDIO_STA_DTIMEOUT					(1u << 3)
#define SDIO_STA_DTIMEOUT_NOTIMEOUT				(0x0u << 3)
#define SDIO_STA_DTIMEOUT_TIMEOUT				(0x1u << 3)
	/* Command response timeout */
#define SDIO_STA_CTIMEOUT					(1u << 2)
#define SDIO_STA_CTIMEOUT_NOTIMEOUT				(0x0u << 2)
#define SDIO_STA_CTIMEOUT_TIMEOUT				(0x1u << 2)
	/* Data block sent/received (CRC check */
#define SDIO_STA_DCRCFAIL					(1u << 1)
#define SDIO_STA_DCRCFAIL_NOTFAILED				(0x0u << 1)
#define SDIO_STA_DCRCFAIL_FAILED				(0x1u << 1)
	/* Command response received (CRC check */
#define SDIO_STA_CCRCFAIL					(1u << 0)
#define SDIO_STA_CCRCFAIL_NOTFAILED				(0x0u << 0)
#define SDIO_STA_CCRCFAIL_FAILED				(0x1u << 0)

	/* 0x38: interrupt clear register */
	uint32_t volatile ICR;
	/* CEATAEND flag clear bit */
#define SDIO_ICR_CEATAENDC					(1u << 23)
	/* SDIOIT flag clear bit */
#define SDIO_ICR_SDIOITC					(1u << 22)
	/* DBCKEND flag clear bit */
#define SDIO_ICR_DBCKENDC					(1u << 10)
	/* STBITERR flag clear bit */
#define SDIO_ICR_STBITERRC					(1u << 9)
	/* DATAEND flag clear bit */
#define SDIO_ICR_DATAENDC					(1u << 8)
	/* CMDSENT flag clear bit */
#define SDIO_ICR_CMDSENTC					(1u << 7)
	/* CMDREND flag clear bit */
#define SDIO_ICR_CMDRENDC					(1u << 6)
	/* RXOVERR flag clear bit */
#define SDIO_ICR_RXOVERRC					(1u << 5)
	/* TXUNDERR flag clear bit */
#define SDIO_ICR_TXUNDERRC					(1u << 4)
	/* DTIMEOUT flag clear bit */
#define SDIO_ICR_DTIMEOUTC					(1u << 3)
	/* CTIMEOUT flag clear bit */
#define SDIO_ICR_CTIMEOUTC					(1u << 2)
	/* DCRCFAIL flag clear bit */
#define SDIO_ICR_DCRCFAILC					(1u << 1)
	/* CCRCFAIL flag clear bit */
#define SDIO_ICR_CCRCFAILC					(1u << 0)
#define SDIO_ICR_CCRCFAILC_CLEAR				(0x1u << 0)

	/* 0x3C: mask register */
	uint32_t volatile MASK;
	/* CE-ATA command completion signal */
#define SDIO_MASK_CEATAENDIE					(1u << 23)
	/* SDIO mode interrupt received interrupt */
#define SDIO_MASK_SDIOITIE					(1u << 22)
	/* Data available in Rx FIFO interrupt */
#define SDIO_MASK_RXDAVLIE					(1u << 21)
	/* Data available in Tx FIFO interrupt */
#define SDIO_MASK_TXDAVLIE					(1u << 20)
	/* Rx FIFO empty interrupt */
#define SDIO_MASK_RXFIFOEIE					(1u << 19)
	/* Tx FIFO empty interrupt */
#define SDIO_MASK_TXFIFOEIE					(1u << 18)
	/* Rx FIFO full interrupt */
#define SDIO_MASK_RXFIFOFIE					(1u << 17)
	/* Tx FIFO full interrupt */
#define SDIO_MASK_TXFIFOFIE					(1u << 16)
	/* Rx FIFO half full interrupt */
#define SDIO_MASK_RXFIFOHFIE					(1u << 15)
	/* Tx FIFO half empty interrupt */
#define SDIO_MASK_TXFIFOHEIE					(1u << 14)
	/* Data receive acting interrupt */
#define SDIO_MASK_RXACTIE					(1u << 13)
	/* Data transmit acting interrupt */
#define SDIO_MASK_TXACTIE					(1u << 12)
	/* Command acting interrupt */
#define SDIO_MASK_CMDACTIE					(1u << 11)
	/* Data block end interrupt */
#define SDIO_MASK_DBCKENDIE					(1u << 10)
	/* Start bit error interrupt */
#define SDIO_MASK_STBITERRIE					(1u << 9)
	/* Data end interrupt enable */
#define SDIO_MASK_DATAENDIE					(1u << 8)
	/* Command sent interrupt */
#define SDIO_MASK_CMDSENTIE					(1u << 7)
	/* Command response received interrupt */
#define SDIO_MASK_CMDRENDIE					(1u << 6)
	/* Rx FIFO overrun error interrupt */
#define SDIO_MASK_RXOVERRIE					(1u << 5)
	/* Tx FIFO underrun error interrupt */
#define SDIO_MASK_TXUNDERRIE					(1u << 4)
	/* Data timeout interrupt */
#define SDIO_MASK_DTIMEOUTIE					(1u << 3)
	/* Command timeout interrupt */
#define SDIO_MASK_CTIMEOUTIE					(1u << 2)
	/* Data CRC fail interrupt */
#define SDIO_MASK_DCRCFAILIE					(1u << 1)
	/* Command CRC fail interrupt */
#define SDIO_MASK_CCRCFAILIE					(1u << 0)

