josuah/mcu-stm32f411/registers.h
	/* 0x40 */
	uint8_t RESERVED0[0x48u-0x40u];

	/* 0x48: FIFO counter register */
	uint32_t volatile const FIFOCNT;
	/* Remaining number of words to be written */
#define SDIO_FIFOCNT_FIFOCOUNT_Msk				(0xFFFFFFu << 0)
#define SDIO_FIFOCNT_FIFOCOUNT_Pos				0

	/* 0x4C */
	uint8_t RESERVED1[0x80u-0x4Cu];

	/* 0x80: data FIFO register */
	uint32_t volatile FIFO;
	/* Receive and transmit FIFO */
#define SDIO_FIFO_FIFODATA_Msk					(0xFFFFFFFFu << 0)
#define SDIO_FIFO_FIFODATA_Pos					0

};


#define SYSCFG ((struct mcu_syscfg *)0x40013800)

struct mcu_syscfg {

	/* 0x00: memory remap register */
	uint32_t volatile MEMRM;
	/* MEM_MODE */
#define SYSCFG_MEMRM_MEM_MODE_Msk				(0x3u << 0)
#define SYSCFG_MEMRM_MEM_MODE_Pos				0

	/* 0x04: peripheral mode configuration */
	uint32_t volatile PMC;
	/* ADC1DC2 */
#define SYSCFG_PMC_ADC1DC2					(1u << 16)

	/* 0x08: external interrupt configuration register */
	uint32_t volatile EXTICR1;
	/* EXTI x configuration (x = 0 to */
#define SYSCFG_EXTICR1_EXTI3_Msk				(0xFu << 12)
#define SYSCFG_EXTICR1_EXTI3_Pos				12
	/* EXTI x configuration (x = 0 to */
#define SYSCFG_EXTICR1_EXTI2_Msk				(0xFu << 8)
#define SYSCFG_EXTICR1_EXTI2_Pos				8
	/* EXTI x configuration (x = 0 to */
#define SYSCFG_EXTICR1_EXTI1_Msk				(0xFu << 4)
#define SYSCFG_EXTICR1_EXTI1_Pos				4
	/* EXTI x configuration (x = 0 to */
#define SYSCFG_EXTICR1_EXTI0_Msk				(0xFu << 0)
#define SYSCFG_EXTICR1_EXTI0_Pos				0

	/* 0x0C: external interrupt configuration register */
	uint32_t volatile EXTICR2;
	/* EXTI x configuration (x = 4 to */
#define SYSCFG_EXTICR2_EXTI7_Msk				(0xFu << 12)
#define SYSCFG_EXTICR2_EXTI7_Pos				12
	/* EXTI x configuration (x = 4 to */
#define SYSCFG_EXTICR2_EXTI6_Msk				(0xFu << 8)
#define SYSCFG_EXTICR2_EXTI6_Pos				8
	/* EXTI x configuration (x = 4 to */
#define SYSCFG_EXTICR2_EXTI5_Msk				(0xFu << 4)
#define SYSCFG_EXTICR2_EXTI5_Pos				4
	/* EXTI x configuration (x = 4 to */
#define SYSCFG_EXTICR2_EXTI4_Msk				(0xFu << 0)
#define SYSCFG_EXTICR2_EXTI4_Pos				0

	/* 0x10: external interrupt configuration register */
	uint32_t volatile EXTICR3;
	/* EXTI x configuration (x = 8 to */
#define SYSCFG_EXTICR3_EXTI11_Msk				(0xFu << 12)
#define SYSCFG_EXTICR3_EXTI11_Pos				12
	/* EXTI10 */
#define SYSCFG_EXTICR3_EXTI10_Msk				(0xFu << 8)
#define SYSCFG_EXTICR3_EXTI10_Pos				8
	/* EXTI x configuration (x = 8 to */
#define SYSCFG_EXTICR3_EXTI9_Msk				(0xFu << 4)
#define SYSCFG_EXTICR3_EXTI9_Pos				4
	/* EXTI x configuration (x = 8 to */
#define SYSCFG_EXTICR3_EXTI8_Msk				(0xFu << 0)
#define SYSCFG_EXTICR3_EXTI8_Pos				0

	/* 0x14: external interrupt configuration register */
	uint32_t volatile EXTICR4;
	/* EXTI x configuration (x = 12 to */
#define SYSCFG_EXTICR4_EXTI15_Msk				(0xFu << 12)
#define SYSCFG_EXTICR4_EXTI15_Pos				12
	/* EXTI x configuration (x = 12 to */
#define SYSCFG_EXTICR4_EXTI14_Msk				(0xFu << 8)
#define SYSCFG_EXTICR4_EXTI14_Pos				8
	/* EXTI x configuration (x = 12 to */
#define SYSCFG_EXTICR4_EXTI13_Msk				(0xFu << 4)
#define SYSCFG_EXTICR4_EXTI13_Pos				4
	/* EXTI x configuration (x = 12 to */
#define SYSCFG_EXTICR4_EXTI12_Msk				(0xFu << 0)
#define SYSCFG_EXTICR4_EXTI12_Pos				0

	/* 0x18 */
	uint8_t RESERVED0[0x20u-0x18u];

	/* 0x20: Compensation cell control */
	uint32_t volatile const CMPCR;
	/* READY */
#define SYSCFG_CMPCR_READY					(1u << 8)
	/* Compensation cell */
#define SYSCFG_CMPCR_CMP_PD					(1u << 0)

};


#define TIM1 ((struct mcu_tim1or8 *)0x40010000)
#define TIM8 ((struct mcu_tim1or8 *)0x40010400)

struct mcu_tim1or8 {

	/* 0x00: control register 1 */
	uint32_t volatile CR1;
	/* Clock division */
#define TIM1_CR1_CKD_Msk					(0x3u << 8)
#define TIM1_CR1_CKD_Pos					8
#define TIM1_CR1_CKD_DIV1					(0x0u << 8)
#define TIM1_CR1_CKD_DIV2					(0x1u << 8)
#define TIM1_CR1_CKD_DIV4					(0x2u << 8)
	/* Auto-reload preload enable */
#define TIM1_CR1_ARPE						(1u << 7)
	/* Center-aligned mode */
#define TIM1_CR1_CMS_Msk					(0x3u << 5)
#define TIM1_CR1_CMS_Pos					5
#define TIM1_CR1_CMS_EDGEALIGNED				(0x0u << 5)
#define TIM1_CR1_CMS_CENTERALIGNED1				(0x1u << 5)
#define TIM1_CR1_CMS_CENTERALIGNED2				(0x2u << 5)
#define TIM1_CR1_CMS_CENTERALIGNED3				(0x3u << 5)
	/* Direction */
#define TIM1_CR1_DIR						(1u << 4)
#define TIM1_CR1_DIR_UP						(0x0u << 4)
#define TIM1_CR1_DIR_DOWN					(0x1u << 4)
	/* One-pulse mode */
#define TIM1_CR1_OPM						(1u << 3)
	/* Update request source */
#define TIM1_CR1_URS						(1u << 2)
#define TIM1_CR1_URS_ANYEVENT					(0x0u << 2)
#define TIM1_CR1_URS_COUNTERONLY				(0x1u << 2)
	/* Update disable */
#define TIM1_CR1_UDIS						(1u << 1)
#define TIM1_CR1_UDIS_ENABLED					(0x0u << 1)
#define TIM1_CR1_UDIS_DISABLED					(0x1u << 1)
	/* Counter enable */
#define TIM1_CR1_CEN						(1u << 0)

	/* 0x04: control register 2 */
	uint32_t volatile CR2;
	/* Output Idle state 4 */
#define TIM1_CR2_OIS4						(1u << 14)
	/* Output Idle state 3 */
#define TIM1_CR2_OIS3N						(1u << 13)
	/* Output Idle state 3 */
#define TIM1_CR2_OIS3						(1u << 12)
	/* Output Idle state 2 */
#define TIM1_CR2_OIS2N						(1u << 11)
	/* Output Idle state 2 */
#define TIM1_CR2_OIS2						(1u << 10)
	/* Output Idle state 1 */
#define TIM1_CR2_OIS1N						(1u << 9)
	/* Output Idle state 1 */
#define TIM1_CR2_OIS1						(1u << 8)
	/* TI1 selection */
#define TIM1_CR2_TI1S						(1u << 7)
#define TIM1_CR2_TI1S_NORMAL					(0x0u << 7)
#define TIM1_CR2_TI1S_XOR					(0x1u << 7)
	/* Master mode selection */
#define TIM1_CR2_MMS_Msk					(0x7u << 4)
#define TIM1_CR2_MMS_Pos					4
#define TIM1_CR2_MMS_RESET					(0x0u << 4)
#define TIM1_CR2_MMS_ENABLE					(0x1u << 4)
#define TIM1_CR2_MMS_UPDATE					(0x2u << 4)
#define TIM1_CR2_MMS_COMPAREPULSE				(0x3u << 4)
#define TIM1_CR2_MMS_COMPAREOC1					(0x4u << 4)
#define TIM1_CR2_MMS_COMPAREOC2					(0x5u << 4)
#define TIM1_CR2_MMS_COMPAREOC3					(0x6u << 4)
#define TIM1_CR2_MMS_COMPAREOC4					(0x7u << 4)
	/* Capture/compare DMA */
#define TIM1_CR2_CCDS						(1u << 3)
#define TIM1_CR2_CCDS_ONCOMPARE					(0x0u << 3)
#define TIM1_CR2_CCDS_ONUPDATE					(0x1u << 3)
	/* Capture/compare control update */
#define TIM1_CR2_CCUS						(1u << 2)
	/* Capture/compare preloaded */
#define TIM1_CR2_CCPC						(1u << 0)

	/* 0x08: slave mode control register */
	uint32_t volatile SMCR;
	/* External trigger polarity */
#define TIM1_SMCR_ETP						(1u << 15)
#define TIM1_SMCR_ETP_NOTINVERTED				(0x0u << 15)
#define TIM1_SMCR_ETP_INVERTED					(0x1u << 15)
	/* External clock enable */
#define TIM1_SMCR_ECE						(1u << 14)
	/* External trigger prescaler */
#define TIM1_SMCR_ETPS_Msk					(0x3u << 12)
#define TIM1_SMCR_ETPS_Pos					12
#define TIM1_SMCR_ETPS_DIV1					(0x0u << 12)
#define TIM1_SMCR_ETPS_DIV2					(0x1u << 12)
#define TIM1_SMCR_ETPS_DIV4					(0x2u << 12)
#define TIM1_SMCR_ETPS_DIV8					(0x3u << 12)
	/* External trigger filter */
#define TIM1_SMCR_ETF_Msk					(0xFu << 8)
#define TIM1_SMCR_ETF_Pos					8
#define TIM1_SMCR_ETF_NOFILTER					(0x0u << 8)
#define TIM1_SMCR_ETF_FCK_INT_N2				(0x1u << 8)
#define TIM1_SMCR_ETF_FCK_INT_N4				(0x2u << 8)
#define TIM1_SMCR_ETF_FCK_INT_N8				(0x3u << 8)
#define TIM1_SMCR_ETF_FDTS_DIV2_N6				(0x4u << 8)
#define TIM1_SMCR_ETF_FDTS_DIV2_N8				(0x5u << 8)
#define TIM1_SMCR_ETF_FDTS_DIV4_N6				(0x6u << 8)
#define TIM1_SMCR_ETF_FDTS_DIV4_N8				(0x7u << 8)
#define TIM1_SMCR_ETF_FDTS_DIV8_N6				(0x8u << 8)
#define TIM1_SMCR_ETF_FDTS_DIV8_N8				(0x9u << 8)
#define TIM1_SMCR_ETF_FDTS_DIV16_N5				(0xAu << 8)
#define TIM1_SMCR_ETF_FDTS_DIV16_N6				(0xBu << 8)
#define TIM1_SMCR_ETF_FDTS_DIV16_N8				(0xCu << 8)
#define TIM1_SMCR_ETF_FDTS_DIV32_N5				(0xDu << 8)
#define TIM1_SMCR_ETF_FDTS_DIV32_N6				(0xEu << 8)
#define TIM1_SMCR_ETF_FDTS_DIV32_N8				(0xFu << 8)
	/* Master/Slave mode */
#define TIM1_SMCR_MSM						(1u << 7)
#define TIM1_SMCR_MSM_NOSYNC					(0x0u << 7)
#define TIM1_SMCR_MSM_SYNC					(0x1u << 7)
	/* Trigger selection */
#define TIM1_SMCR_TS_Msk					(0x7u << 4)
#define TIM1_SMCR_TS_Pos					4
#define TIM1_SMCR_TS_ITR0					(0x0u << 4)
#define TIM1_SMCR_TS_ITR1					(0x1u << 4)
#define TIM1_SMCR_TS_ITR2					(0x2u << 4)
#define TIM1_SMCR_TS_TI1F_ED					(0x4u << 4)
#define TIM1_SMCR_TS_TI1FP1					(0x5u << 4)
#define TIM1_SMCR_TS_TI2FP2					(0x6u << 4)
#define TIM1_SMCR_TS_ETRF					(0x7u << 4)
	/* Slave mode selection */
#define TIM1_SMCR_SMS_Msk					(0x7u << 0)
#define TIM1_SMCR_SMS_Pos					0
#define TIM1_SMCR_SMS_DISABLED					(0x0u << 0)
#define TIM1_SMCR_SMS_ENCODER_MODE_1				(0x1u << 0)
#define TIM1_SMCR_SMS_ENCODER_MODE_2				(0x2u << 0)
#define TIM1_SMCR_SMS_ENCODER_MODE_3				(0x3u << 0)
#define TIM1_SMCR_SMS_RESET_MODE				(0x4u << 0)
#define TIM1_SMCR_SMS_GATED_MODE				(0x5u << 0)
#define TIM1_SMCR_SMS_TRIGGER_MODE				(0x6u << 0)
#define TIM1_SMCR_SMS_EXT_CLOCK_MODE				(0x7u << 0)

