josuah/mcu-stm32f411/registers.h
	/* 0x20: capture/compare enable */
	uint32_t volatile CCER;
	/* Capture/Compare 3 output */
#define TIM1_CCER_CC4P						(1u << 13)
	/* Capture/Compare 4 output */
#define TIM1_CCER_CC4E						(1u << 12)
	/* Capture/Compare 3 output */
#define TIM1_CCER_CC3NP						(1u << 11)
	/* Capture/Compare 3 complementary output */
#define TIM1_CCER_CC3NE						(1u << 10)
	/* Capture/Compare 3 output */
#define TIM1_CCER_CC3P						(1u << 9)
	/* Capture/Compare 3 output */
#define TIM1_CCER_CC3E						(1u << 8)
	/* Capture/Compare 2 output */
#define TIM1_CCER_CC2NP						(1u << 7)
	/* Capture/Compare 2 complementary output */
#define TIM1_CCER_CC2NE						(1u << 6)
	/* Capture/Compare 2 output */
#define TIM1_CCER_CC2P						(1u << 5)
	/* Capture/Compare 2 output */
#define TIM1_CCER_CC2E						(1u << 4)
	/* Capture/Compare 1 output */
#define TIM1_CCER_CC1NP						(1u << 3)
	/* Capture/Compare 1 complementary output */
#define TIM1_CCER_CC1NE						(1u << 2)
	/* Capture/Compare 1 output */
#define TIM1_CCER_CC1P						(1u << 1)
	/* Capture/Compare 1 output */
#define TIM1_CCER_CC1E						(1u << 0)

	/* 0x24: counter */
	uint32_t volatile CNT;
	/* counter value */
#define TIM1_CNT_CNT_Msk					(0xFFFFu << 0)
#define TIM1_CNT_CNT_Pos					0

	/* 0x28: prescaler */
	uint32_t volatile PSC;
	/* Prescaler value */
#define TIM1_PSC_PSC_Msk					(0xFFFFu << 0)
#define TIM1_PSC_PSC_Pos					0

	/* 0x2C: auto-reload register */
	uint32_t volatile ARR;
	/* Auto-reload value */
#define TIM1_ARR_ARR_Msk					(0xFFFFu << 0)
#define TIM1_ARR_ARR_Pos					0

	/* 0x30 */
	uint8_t RESERVED0[0x34u-0x30u];

	/* 0x34: capture/compare register */
	uint32_t volatile CCR[4];
	/* Capture/Compare value */
#define TIM1_CCR_CCR_Msk					(0xFFFFu << 0)
#define TIM1_CCR_CCR_Pos					0

	/* 0x38 */
	uint8_t RESERVED1[0x48u-0x38u];

	/* 0x48: DMA control register */
	uint32_t volatile DCR;
	/* DMA burst length */
#define TIM1_DCR_DBL_Msk					(0x1Fu << 8)
#define TIM1_DCR_DBL_Pos					8
	/* DMA base address */
#define TIM1_DCR_DBA_Msk					(0x1Fu << 0)
#define TIM1_DCR_DBA_Pos					0

	/* 0x4C: DMA address for full transfer */
	uint32_t volatile DMAR;
	/* DMA register for burst */
#define TIM1_DMAR_DMAB_Msk					(0xFFFFu << 0)
#define TIM1_DMAR_DMAB_Pos					0

	/* 0x30: repetition counter register */
	uint32_t volatile RCR;
	/* Repetition counter value */
#define TIM1_RCR_REP_Msk					(0xFFu << 0)
#define TIM1_RCR_REP_Pos					0

	/* 0x34 */
	uint8_t RESERVED2[0x44u-0x34u];

	/* 0x44: break and dead-time register */
	uint32_t volatile BDTR;
	/* Main output enable */
#define TIM1_BDTR_MOE						(1u << 15)
	/* Automatic output enable */
#define TIM1_BDTR_AOE						(1u << 14)
	/* Break polarity */
#define TIM1_BDTR_BKP						(1u << 13)
	/* Break enable */
#define TIM1_BDTR_BKE						(1u << 12)
	/* Off-state selection for Run */
#define TIM1_BDTR_OSSR						(1u << 11)
	/* Off-state selection for Idle */
#define TIM1_BDTR_OSSI						(1u << 10)
	/* Lock configuration */
#define TIM1_BDTR_LOCK_Msk					(0x3u << 8)
#define TIM1_BDTR_LOCK_Pos					8
	/* Dead-time generator setup */
#define TIM1_BDTR_DTG_Msk					(0xFFu << 0)
#define TIM1_BDTR_DTG_Pos					0

};


#define TIM10 ((struct mcu_tim10 *)0x40014400)

struct mcu_tim10 {

	/* 0x00: control register 1 */
	uint32_t volatile CR1;
	/* Clock division */
#define TIM10_CR1_CKD_Msk					(0x3u << 8)
#define TIM10_CR1_CKD_Pos					8
#define TIM10_CR1_CKD_DIV1					(0x0u << 8)
#define TIM10_CR1_CKD_DIV2					(0x1u << 8)
#define TIM10_CR1_CKD_DIV4					(0x2u << 8)
	/* Auto-reload preload enable */
#define TIM10_CR1_ARPE						(1u << 7)
	/* Update request source */
#define TIM10_CR1_URS						(1u << 2)
#define TIM10_CR1_URS_ANYEVENT					(0x0u << 2)
#define TIM10_CR1_URS_COUNTERONLY				(0x1u << 2)
	/* Update disable */
#define TIM10_CR1_UDIS						(1u << 1)
#define TIM10_CR1_UDIS_ENABLED					(0x0u << 1)
#define TIM10_CR1_UDIS_DISABLED					(0x1u << 1)
	/* Counter enable */
#define TIM10_CR1_CEN						(1u << 0)

	/* 0x04 */
	uint8_t RESERVED0[0x0Cu-0x04u];

	/* 0x0C: DMA/Interrupt enable register */
	uint32_t volatile DIER;
	/* Capture/Compare 1 interrupt */
#define TIM10_DIER_CC1IE					(1u << 1)
	/* Update interrupt enable */
#define TIM10_DIER_UIE						(1u << 0)

	/* 0x10: status register */
	uint32_t volatile SR;
	/* Capture/Compare 1 overcapture */
#define TIM10_SR_CC1OF						(1u << 9)
	/* Capture/compare 1 interrupt */
#define TIM10_SR_CC1IF						(1u << 1)
	/* Update interrupt flag */
#define TIM10_SR_UIF						(1u << 0)
#define TIM10_SR_UIF_CLEAR					(0x0u << 0)
#define TIM10_SR_UIF_UPDATEPENDING				(0x1u << 0)

	/* 0x14: event generation register */
	uint32_t volatile EGR;
	/* Capture/compare 1 */
#define TIM10_EGR_CC1G						(1u << 1)
	/* Update generation */
#define TIM10_EGR_UG						(1u << 0)
#define TIM10_EGR_UG_UPDATE					(0x1u << 0)

	/* 0x18: capture/compare mode register 1 (output */
	uint32_t volatile CCMR1_OUTPUT;
	/* Output Compare 1 mode */
#define TIM10_CCMR1_OUTPUT_OC1M_Msk				(0x7u << 4)
#define TIM10_CCMR1_OUTPUT_OC1M_Pos				4
#define TIM10_CCMR1_OUTPUT_OC1M_FROZEN				(0x0u << 4)
#define TIM10_CCMR1_OUTPUT_OC1M_ACTIVEONMATCH			(0x1u << 4)
#define TIM10_CCMR1_OUTPUT_OC1M_INACTIVEONMATCH			(0x2u << 4)
#define TIM10_CCMR1_OUTPUT_OC1M_TOGGLE				(0x3u << 4)
#define TIM10_CCMR1_OUTPUT_OC1M_FORCEINACTIVE			(0x4u << 4)
#define TIM10_CCMR1_OUTPUT_OC1M_FORCEACTIVE			(0x5u << 4)
#define TIM10_CCMR1_OUTPUT_OC1M_PWMMODE1			(0x6u << 4)
#define TIM10_CCMR1_OUTPUT_OC1M_PWMMODE2			(0x7u << 4)
	/* Output Compare 1 preload */
#define TIM10_CCMR1_OUTPUT_OC1PE				(1u << 3)
	/* Output Compare 1 fast */
#define TIM10_CCMR1_OUTPUT_OC1FE				(1u << 2)
	/* Capture/Compare 1 */
#define TIM10_CCMR1_OUTPUT_CC1S_Msk				(0x3u << 0)
#define TIM10_CCMR1_OUTPUT_CC1S_Pos				0

	/* 0x18: capture/compare mode register 1 (input */
	uint32_t volatile CCMR1_INPUT;
	/* Input capture 1 filter */
#define TIM10_CCMR1_INPUT_IC1F_Msk				(0xFu << 4)
#define TIM10_CCMR1_INPUT_IC1F_Pos				4
	/* Input capture 1 prescaler */
#define TIM10_CCMR1_INPUT_IC1PSC_Msk				(0x3u << 2)
#define TIM10_CCMR1_INPUT_IC1PSC_Pos				2
	/* Capture/Compare 1 */
#define TIM10_CCMR1_INPUT_CC1S_Msk				(0x3u << 0)
#define TIM10_CCMR1_INPUT_CC1S_Pos				0

	/* 0x1C */
	uint8_t RESERVED1[0x20u-0x1Cu];

