josuah/mcu-stm32f411/registers.h
	/* 0x20: capture/compare enable */
	uint32_t volatile CCER;
	/* Capture/Compare 1 output */
#define TIM10_CCER_CC1NP					(1u << 3)
	/* Capture/Compare 1 output */
#define TIM10_CCER_CC1P						(1u << 1)
	/* Capture/Compare 1 output */
#define TIM10_CCER_CC1E						(1u << 0)

	/* 0x24: counter */
	uint32_t volatile CNT;
	/* counter value */
#define TIM10_CNT_CNT_Msk					(0xFFFFu << 0)
#define TIM10_CNT_CNT_Pos					0

	/* 0x28: prescaler */
	uint32_t volatile PSC;
	/* Prescaler value */
#define TIM10_PSC_PSC_Msk					(0xFFFFu << 0)
#define TIM10_PSC_PSC_Pos					0

	/* 0x2C: auto-reload register */
	uint32_t volatile ARR;
	/* Auto-reload value */
#define TIM10_ARR_ARR_Msk					(0xFFFFu << 0)
#define TIM10_ARR_ARR_Pos					0

	/* 0x30 */
	uint8_t RESERVED2[0x34u-0x30u];

	/* 0x34: capture/compare register */
	uint32_t volatile CCR;
	/* Capture/Compare value */
#define TIM10_CCR_CCR_Msk					(0xFFFFu << 0)
#define TIM10_CCR_CCR_Pos					0

};


#define TIM11 ((struct mcu_tim11 *)0x40014800)

struct mcu_tim11 {

	/* 0x00: control register 1 */
	uint32_t volatile CR1;
	/* Clock division */
#define TIM11_CR1_CKD_Msk					(0x3u << 8)
#define TIM11_CR1_CKD_Pos					8
#define TIM11_CR1_CKD_DIV1					(0x0u << 8)
#define TIM11_CR1_CKD_DIV2					(0x1u << 8)
#define TIM11_CR1_CKD_DIV4					(0x2u << 8)
	/* Auto-reload preload enable */
#define TIM11_CR1_ARPE						(1u << 7)
	/* Update request source */
#define TIM11_CR1_URS						(1u << 2)
#define TIM11_CR1_URS_ANYEVENT					(0x0u << 2)
#define TIM11_CR1_URS_COUNTERONLY				(0x1u << 2)
	/* Update disable */
#define TIM11_CR1_UDIS						(1u << 1)
#define TIM11_CR1_UDIS_ENABLED					(0x0u << 1)
#define TIM11_CR1_UDIS_DISABLED					(0x1u << 1)
	/* Counter enable */
#define TIM11_CR1_CEN						(1u << 0)

	/* 0x04 */
	uint8_t RESERVED0[0x0Cu-0x04u];

	/* 0x0C: DMA/Interrupt enable register */
	uint32_t volatile DIER;
	/* Capture/Compare 1 interrupt */
#define TIM11_DIER_CC1IE					(1u << 1)
	/* Update interrupt enable */
#define TIM11_DIER_UIE						(1u << 0)

	/* 0x10: status register */
	uint32_t volatile SR;
	/* Capture/Compare 1 overcapture */
#define TIM11_SR_CC1OF						(1u << 9)
	/* Capture/compare 1 interrupt */
#define TIM11_SR_CC1IF						(1u << 1)
	/* Update interrupt flag */
#define TIM11_SR_UIF						(1u << 0)
#define TIM11_SR_UIF_CLEAR					(0x0u << 0)
#define TIM11_SR_UIF_UPDATEPENDING				(0x1u << 0)

	/* 0x14: event generation register */
	uint32_t volatile EGR;
	/* Capture/compare 1 */
#define TIM11_EGR_CC1G						(1u << 1)
	/* Update generation */
#define TIM11_EGR_UG						(1u << 0)
#define TIM11_EGR_UG_UPDATE					(0x1u << 0)

	/* 0x18: capture/compare mode register 1 (output */
	uint32_t volatile CCMR1_OUTPUT;
	/* Output Compare 1 mode */
#define TIM11_CCMR1_OUTPUT_OC1M_Msk				(0x7u << 4)
#define TIM11_CCMR1_OUTPUT_OC1M_Pos				4
#define TIM11_CCMR1_OUTPUT_OC1M_FROZEN				(0x0u << 4)
#define TIM11_CCMR1_OUTPUT_OC1M_ACTIVEONMATCH			(0x1u << 4)
#define TIM11_CCMR1_OUTPUT_OC1M_INACTIVEONMATCH			(0x2u << 4)
#define TIM11_CCMR1_OUTPUT_OC1M_TOGGLE				(0x3u << 4)
#define TIM11_CCMR1_OUTPUT_OC1M_FORCEINACTIVE			(0x4u << 4)
#define TIM11_CCMR1_OUTPUT_OC1M_FORCEACTIVE			(0x5u << 4)
#define TIM11_CCMR1_OUTPUT_OC1M_PWMMODE1			(0x6u << 4)
#define TIM11_CCMR1_OUTPUT_OC1M_PWMMODE2			(0x7u << 4)
	/* Output Compare 1 preload */
#define TIM11_CCMR1_OUTPUT_OC1PE				(1u << 3)
	/* Output Compare 1 fast */
#define TIM11_CCMR1_OUTPUT_OC1FE				(1u << 2)
	/* Capture/Compare 1 */
#define TIM11_CCMR1_OUTPUT_CC1S_Msk				(0x3u << 0)
#define TIM11_CCMR1_OUTPUT_CC1S_Pos				0

	/* 0x18: capture/compare mode register 1 (input */
	uint32_t volatile CCMR1_INPUT;
	/* Input capture 1 filter */
#define TIM11_CCMR1_INPUT_IC1F_Msk				(0xFu << 4)
#define TIM11_CCMR1_INPUT_IC1F_Pos				4
	/* Input capture 1 prescaler */
#define TIM11_CCMR1_INPUT_IC1PSC_Msk				(0x3u << 2)
#define TIM11_CCMR1_INPUT_IC1PSC_Pos				2
	/* Capture/Compare 1 */
#define TIM11_CCMR1_INPUT_CC1S_Msk				(0x3u << 0)
#define TIM11_CCMR1_INPUT_CC1S_Pos				0

	/* 0x1C */
	uint8_t RESERVED1[0x20u-0x1Cu];

	/* 0x20: capture/compare enable */
	uint32_t volatile CCER;
	/* Capture/Compare 1 output */
#define TIM11_CCER_CC1NP					(1u << 3)
	/* Capture/Compare 1 output */
#define TIM11_CCER_CC1P						(1u << 1)
	/* Capture/Compare 1 output */
#define TIM11_CCER_CC1E						(1u << 0)

	/* 0x24: counter */
	uint32_t volatile CNT;
	/* counter value */
#define TIM11_CNT_CNT_Msk					(0xFFFFu << 0)
#define TIM11_CNT_CNT_Pos					0

	/* 0x28: prescaler */
	uint32_t volatile PSC;
	/* Prescaler value */
#define TIM11_PSC_PSC_Msk					(0xFFFFu << 0)
#define TIM11_PSC_PSC_Pos					0

	/* 0x2C: auto-reload register */
	uint32_t volatile ARR;
	/* Auto-reload value */
#define TIM11_ARR_ARR_Msk					(0xFFFFu << 0)
#define TIM11_ARR_ARR_Pos					0

	/* 0x30 */
	uint8_t RESERVED2[0x34u-0x30u];

	/* 0x34: capture/compare register */
	uint32_t volatile CCR;
	/* Capture/Compare value */
#define TIM11_CCR_CCR_Msk					(0xFFFFu << 0)
#define TIM11_CCR_CCR_Pos					0

	/* 0x38 */
	uint8_t RESERVED3[0x50u-0x38u];

	/* 0x50: option register */
	uint32_t volatile OR;
	/* Input 1 remapping */
#define TIM11_OR_RMP_Msk					(0x3u << 0)
#define TIM11_OR_RMP_Pos					0

};


#define TIM2 ((struct mcu_tim2 *)0x40000000)

struct mcu_tim2 {

	/* 0x00: control register 1 */
	uint32_t volatile CR1;
	/* Clock division */
#define TIM2_CR1_CKD_Msk					(0x3u << 8)
#define TIM2_CR1_CKD_Pos					8
#define TIM2_CR1_CKD_DIV1					(0x0u << 8)
#define TIM2_CR1_CKD_DIV2					(0x1u << 8)
#define TIM2_CR1_CKD_DIV4					(0x2u << 8)
	/* Auto-reload preload enable */
#define TIM2_CR1_ARPE						(1u << 7)
	/* Center-aligned mode */
#define TIM2_CR1_CMS_Msk					(0x3u << 5)
#define TIM2_CR1_CMS_Pos					5
#define TIM2_CR1_CMS_EDGEALIGNED				(0x0u << 5)
#define TIM2_CR1_CMS_CENTERALIGNED1				(0x1u << 5)
#define TIM2_CR1_CMS_CENTERALIGNED2				(0x2u << 5)
#define TIM2_CR1_CMS_CENTERALIGNED3				(0x3u << 5)
	/* Direction */
#define TIM2_CR1_DIR						(1u << 4)
#define TIM2_CR1_DIR_UP						(0x0u << 4)
#define TIM2_CR1_DIR_DOWN					(0x1u << 4)
	/* One-pulse mode */
#define TIM2_CR1_OPM						(1u << 3)
	/* Update request source */
#define TIM2_CR1_URS						(1u << 2)
#define TIM2_CR1_URS_ANYEVENT					(0x0u << 2)
#define TIM2_CR1_URS_COUNTERONLY				(0x1u << 2)
	/* Update disable */
#define TIM2_CR1_UDIS						(1u << 1)
#define TIM2_CR1_UDIS_ENABLED					(0x0u << 1)
#define TIM2_CR1_UDIS_DISABLED					(0x1u << 1)
	/* Counter enable */
#define TIM2_CR1_CEN						(1u << 0)

	/* 0x04: control register 2 */
	uint32_t volatile CR2;
	/* TI1 selection */
#define TIM2_CR2_TI1S						(1u << 7)
#define TIM2_CR2_TI1S_NORMAL					(0x0u << 7)
#define TIM2_CR2_TI1S_XOR					(0x1u << 7)
	/* Master mode selection */
#define TIM2_CR2_MMS_Msk					(0x7u << 4)
#define TIM2_CR2_MMS_Pos					4
#define TIM2_CR2_MMS_RESET					(0x0u << 4)
#define TIM2_CR2_MMS_ENABLE					(0x1u << 4)
#define TIM2_CR2_MMS_UPDATE					(0x2u << 4)
#define TIM2_CR2_MMS_COMPAREPULSE				(0x3u << 4)
#define TIM2_CR2_MMS_COMPAREOC1					(0x4u << 4)
#define TIM2_CR2_MMS_COMPAREOC2					(0x5u << 4)
#define TIM2_CR2_MMS_COMPAREOC3					(0x6u << 4)
#define TIM2_CR2_MMS_COMPAREOC4					(0x7u << 4)
	/* Capture/compare DMA */
#define TIM2_CR2_CCDS						(1u << 3)
#define TIM2_CR2_CCDS_ONCOMPARE					(0x0u << 3)
#define TIM2_CR2_CCDS_ONUPDATE					(0x1u << 3)

	/* 0x08: slave mode control register */
	uint32_t volatile SMCR;
	/* External trigger polarity */
#define TIM2_SMCR_ETP						(1u << 15)
#define TIM2_SMCR_ETP_NOTINVERTED				(0x0u << 15)
#define TIM2_SMCR_ETP_INVERTED					(0x1u << 15)
	/* External clock enable */
#define TIM2_SMCR_ECE						(1u << 14)
	/* External trigger prescaler */
#define TIM2_SMCR_ETPS_Msk					(0x3u << 12)
#define TIM2_SMCR_ETPS_Pos					12
#define TIM2_SMCR_ETPS_DIV1					(0x0u << 12)
#define TIM2_SMCR_ETPS_DIV2					(0x1u << 12)
#define TIM2_SMCR_ETPS_DIV4					(0x2u << 12)
#define TIM2_SMCR_ETPS_DIV8					(0x3u << 12)
	/* External trigger filter */
#define TIM2_SMCR_ETF_Msk					(0xFu << 8)
#define TIM2_SMCR_ETF_Pos					8
#define TIM2_SMCR_ETF_NOFILTER					(0x0u << 8)
#define TIM2_SMCR_ETF_FCK_INT_N2				(0x1u << 8)
#define TIM2_SMCR_ETF_FCK_INT_N4				(0x2u << 8)
#define TIM2_SMCR_ETF_FCK_INT_N8				(0x3u << 8)
#define TIM2_SMCR_ETF_FDTS_DIV2_N6				(0x4u << 8)
#define TIM2_SMCR_ETF_FDTS_DIV2_N8				(0x5u << 8)
#define TIM2_SMCR_ETF_FDTS_DIV4_N6				(0x6u << 8)
#define TIM2_SMCR_ETF_FDTS_DIV4_N8				(0x7u << 8)
#define TIM2_SMCR_ETF_FDTS_DIV8_N6				(0x8u << 8)
#define TIM2_SMCR_ETF_FDTS_DIV8_N8				(0x9u << 8)
#define TIM2_SMCR_ETF_FDTS_DIV16_N5				(0xAu << 8)
#define TIM2_SMCR_ETF_FDTS_DIV16_N6				(0xBu << 8)
#define TIM2_SMCR_ETF_FDTS_DIV16_N8				(0xCu << 8)
#define TIM2_SMCR_ETF_FDTS_DIV32_N5				(0xDu << 8)
#define TIM2_SMCR_ETF_FDTS_DIV32_N6				(0xEu << 8)
#define TIM2_SMCR_ETF_FDTS_DIV32_N8				(0xFu << 8)
	/* Master/Slave mode */
#define TIM2_SMCR_MSM						(1u << 7)
#define TIM2_SMCR_MSM_NOSYNC					(0x0u << 7)
#define TIM2_SMCR_MSM_SYNC					(0x1u << 7)
	/* Trigger selection */
#define TIM2_SMCR_TS_Msk					(0x7u << 4)
#define TIM2_SMCR_TS_Pos					4
#define TIM2_SMCR_TS_ITR0					(0x0u << 4)
#define TIM2_SMCR_TS_ITR1					(0x1u << 4)
#define TIM2_SMCR_TS_ITR2					(0x2u << 4)
#define TIM2_SMCR_TS_TI1F_ED					(0x4u << 4)
#define TIM2_SMCR_TS_TI1FP1					(0x5u << 4)
#define TIM2_SMCR_TS_TI2FP2					(0x6u << 4)
#define TIM2_SMCR_TS_ETRF					(0x7u << 4)
	/* Slave mode selection */
#define TIM2_SMCR_SMS_Msk					(0x7u << 0)
#define TIM2_SMCR_SMS_Pos					0
#define TIM2_SMCR_SMS_DISABLED					(0x0u << 0)
#define TIM2_SMCR_SMS_ENCODER_MODE_1				(0x1u << 0)
#define TIM2_SMCR_SMS_ENCODER_MODE_2				(0x2u << 0)
#define TIM2_SMCR_SMS_ENCODER_MODE_3				(0x3u << 0)
#define TIM2_SMCR_SMS_RESET_MODE				(0x4u << 0)
#define TIM2_SMCR_SMS_GATED_MODE				(0x5u << 0)
#define TIM2_SMCR_SMS_TRIGGER_MODE				(0x6u << 0)
#define TIM2_SMCR_SMS_EXT_CLOCK_MODE				(0x7u << 0)

