josuah/mcu-stm32f411/registers.h
	/* 0x20: capture/compare enable */
	uint32_t volatile CCER;
	/* Capture/Compare 4 output */
#define TIM3_CCER_CC4NP						(1u << 15)
	/* Capture/Compare 3 output */
#define TIM3_CCER_CC4P						(1u << 13)
	/* Capture/Compare 4 output */
#define TIM3_CCER_CC4E						(1u << 12)
	/* Capture/Compare 3 output */
#define TIM3_CCER_CC3NP						(1u << 11)
	/* Capture/Compare 3 output */
#define TIM3_CCER_CC3P						(1u << 9)
	/* Capture/Compare 3 output */
#define TIM3_CCER_CC3E						(1u << 8)
	/* Capture/Compare 2 output */
#define TIM3_CCER_CC2NP						(1u << 7)
	/* Capture/Compare 2 output */
#define TIM3_CCER_CC2P						(1u << 5)
	/* Capture/Compare 2 output */
#define TIM3_CCER_CC2E						(1u << 4)
	/* Capture/Compare 1 output */
#define TIM3_CCER_CC1NP						(1u << 3)
	/* Capture/Compare 1 output */
#define TIM3_CCER_CC1P						(1u << 1)
	/* Capture/Compare 1 output */
#define TIM3_CCER_CC1E						(1u << 0)

	/* 0x24: counter */
	uint32_t volatile CNT;
	/* High counter value */
#define TIM3_CNT_CNT_H_Msk					(0xFFFFu << 16)
#define TIM3_CNT_CNT_H_Pos					16
	/* Counter value */
#define TIM3_CNT_CNT_Msk					(0xFFFFu << 0)
#define TIM3_CNT_CNT_Pos					0

	/* 0x28: prescaler */
	uint32_t volatile PSC;
	/* Prescaler value */
#define TIM3_PSC_PSC_Msk					(0xFFFFu << 0)
#define TIM3_PSC_PSC_Pos					0

	/* 0x2C: auto-reload register */
	uint32_t volatile ARR;
	/* High Auto-reload value */
#define TIM3_ARR_ARR_H_Msk					(0xFFFFu << 16)
#define TIM3_ARR_ARR_H_Pos					16
	/* Auto-reload value */
#define TIM3_ARR_ARR_Msk					(0xFFFFu << 0)
#define TIM3_ARR_ARR_Pos					0

	/* 0x30 */
	uint8_t RESERVED0[0x34u-0x30u];

	/* 0x34: capture/compare register */
	uint32_t volatile CCR[4];
	/* High Capture/Compare 1 */
#define TIM3_CCR_CCR1_H_Msk					(0xFFFFu << 16)
#define TIM3_CCR_CCR1_H_Pos					16
	/* Capture/Compare value */
#define TIM3_CCR_CCR_Msk					(0xFFFFu << 0)
#define TIM3_CCR_CCR_Pos					0

	/* 0x38 */
	uint8_t RESERVED1[0x48u-0x38u];

	/* 0x48: DMA control register */
	uint32_t volatile DCR;
	/* DMA burst length */
#define TIM3_DCR_DBL_Msk					(0x1Fu << 8)
#define TIM3_DCR_DBL_Pos					8
	/* DMA base address */
#define TIM3_DCR_DBA_Msk					(0x1Fu << 0)
#define TIM3_DCR_DBA_Pos					0

	/* 0x4C: DMA address for full transfer */
	uint32_t volatile DMAR;
	/* DMA register for burst */
#define TIM3_DMAR_DMAB_Msk					(0xFFFFu << 0)
#define TIM3_DMAR_DMAB_Pos					0

};


#define TIM5 ((struct mcu_tim5 *)0x40000C00)

struct mcu_tim5 {

	/* 0x00: control register 1 */
	uint32_t volatile CR1;
	/* Clock division */
#define TIM5_CR1_CKD_Msk					(0x3u << 8)
#define TIM5_CR1_CKD_Pos					8
#define TIM5_CR1_CKD_DIV1					(0x0u << 8)
#define TIM5_CR1_CKD_DIV2					(0x1u << 8)
#define TIM5_CR1_CKD_DIV4					(0x2u << 8)
	/* Auto-reload preload enable */
#define TIM5_CR1_ARPE						(1u << 7)
	/* Center-aligned mode */
#define TIM5_CR1_CMS_Msk					(0x3u << 5)
#define TIM5_CR1_CMS_Pos					5
#define TIM5_CR1_CMS_EDGEALIGNED				(0x0u << 5)
#define TIM5_CR1_CMS_CENTERALIGNED1				(0x1u << 5)
#define TIM5_CR1_CMS_CENTERALIGNED2				(0x2u << 5)
#define TIM5_CR1_CMS_CENTERALIGNED3				(0x3u << 5)
	/* Direction */
#define TIM5_CR1_DIR						(1u << 4)
#define TIM5_CR1_DIR_UP						(0x0u << 4)
#define TIM5_CR1_DIR_DOWN					(0x1u << 4)
	/* One-pulse mode */
#define TIM5_CR1_OPM						(1u << 3)
	/* Update request source */
#define TIM5_CR1_URS						(1u << 2)
#define TIM5_CR1_URS_ANYEVENT					(0x0u << 2)
#define TIM5_CR1_URS_COUNTERONLY				(0x1u << 2)
	/* Update disable */
#define TIM5_CR1_UDIS						(1u << 1)
#define TIM5_CR1_UDIS_ENABLED					(0x0u << 1)
#define TIM5_CR1_UDIS_DISABLED					(0x1u << 1)
	/* Counter enable */
#define TIM5_CR1_CEN						(1u << 0)

	/* 0x04: control register 2 */
	uint32_t volatile CR2;
	/* TI1 selection */
#define TIM5_CR2_TI1S						(1u << 7)
#define TIM5_CR2_TI1S_NORMAL					(0x0u << 7)
#define TIM5_CR2_TI1S_XOR					(0x1u << 7)
	/* Master mode selection */
#define TIM5_CR2_MMS_Msk					(0x7u << 4)
#define TIM5_CR2_MMS_Pos					4
#define TIM5_CR2_MMS_RESET					(0x0u << 4)
#define TIM5_CR2_MMS_ENABLE					(0x1u << 4)
#define TIM5_CR2_MMS_UPDATE					(0x2u << 4)
#define TIM5_CR2_MMS_COMPAREPULSE				(0x3u << 4)
#define TIM5_CR2_MMS_COMPAREOC1					(0x4u << 4)
#define TIM5_CR2_MMS_COMPAREOC2					(0x5u << 4)
#define TIM5_CR2_MMS_COMPAREOC3					(0x6u << 4)
#define TIM5_CR2_MMS_COMPAREOC4					(0x7u << 4)
	/* Capture/compare DMA */
#define TIM5_CR2_CCDS						(1u << 3)
#define TIM5_CR2_CCDS_ONCOMPARE					(0x0u << 3)
#define TIM5_CR2_CCDS_ONUPDATE					(0x1u << 3)

	/* 0x08: slave mode control register */
	uint32_t volatile SMCR;
	/* External trigger polarity */
#define TIM5_SMCR_ETP						(1u << 15)
#define TIM5_SMCR_ETP_NOTINVERTED				(0x0u << 15)
#define TIM5_SMCR_ETP_INVERTED					(0x1u << 15)
	/* External clock enable */
#define TIM5_SMCR_ECE						(1u << 14)
	/* External trigger prescaler */
#define TIM5_SMCR_ETPS_Msk					(0x3u << 12)
#define TIM5_SMCR_ETPS_Pos					12
#define TIM5_SMCR_ETPS_DIV1					(0x0u << 12)
#define TIM5_SMCR_ETPS_DIV2					(0x1u << 12)
#define TIM5_SMCR_ETPS_DIV4					(0x2u << 12)
#define TIM5_SMCR_ETPS_DIV8					(0x3u << 12)
	/* External trigger filter */
#define TIM5_SMCR_ETF_Msk					(0xFu << 8)
#define TIM5_SMCR_ETF_Pos					8
#define TIM5_SMCR_ETF_NOFILTER					(0x0u << 8)
#define TIM5_SMCR_ETF_FCK_INT_N2				(0x1u << 8)
#define TIM5_SMCR_ETF_FCK_INT_N4				(0x2u << 8)
#define TIM5_SMCR_ETF_FCK_INT_N8				(0x3u << 8)
#define TIM5_SMCR_ETF_FDTS_DIV2_N6				(0x4u << 8)
#define TIM5_SMCR_ETF_FDTS_DIV2_N8				(0x5u << 8)
#define TIM5_SMCR_ETF_FDTS_DIV4_N6				(0x6u << 8)
#define TIM5_SMCR_ETF_FDTS_DIV4_N8				(0x7u << 8)
#define TIM5_SMCR_ETF_FDTS_DIV8_N6				(0x8u << 8)
#define TIM5_SMCR_ETF_FDTS_DIV8_N8				(0x9u << 8)
#define TIM5_SMCR_ETF_FDTS_DIV16_N5				(0xAu << 8)
#define TIM5_SMCR_ETF_FDTS_DIV16_N6				(0xBu << 8)
#define TIM5_SMCR_ETF_FDTS_DIV16_N8				(0xCu << 8)
#define TIM5_SMCR_ETF_FDTS_DIV32_N5				(0xDu << 8)
#define TIM5_SMCR_ETF_FDTS_DIV32_N6				(0xEu << 8)
#define TIM5_SMCR_ETF_FDTS_DIV32_N8				(0xFu << 8)
	/* Master/Slave mode */
#define TIM5_SMCR_MSM						(1u << 7)
#define TIM5_SMCR_MSM_NOSYNC					(0x0u << 7)
#define TIM5_SMCR_MSM_SYNC					(0x1u << 7)
	/* Trigger selection */
#define TIM5_SMCR_TS_Msk					(0x7u << 4)
#define TIM5_SMCR_TS_Pos					4
#define TIM5_SMCR_TS_ITR0					(0x0u << 4)
#define TIM5_SMCR_TS_ITR1					(0x1u << 4)
#define TIM5_SMCR_TS_ITR2					(0x2u << 4)
#define TIM5_SMCR_TS_TI1F_ED					(0x4u << 4)
#define TIM5_SMCR_TS_TI1FP1					(0x5u << 4)
#define TIM5_SMCR_TS_TI2FP2					(0x6u << 4)
#define TIM5_SMCR_TS_ETRF					(0x7u << 4)
	/* Slave mode selection */
#define TIM5_SMCR_SMS_Msk					(0x7u << 0)
#define TIM5_SMCR_SMS_Pos					0
#define TIM5_SMCR_SMS_DISABLED					(0x0u << 0)
#define TIM5_SMCR_SMS_ENCODER_MODE_1				(0x1u << 0)
#define TIM5_SMCR_SMS_ENCODER_MODE_2				(0x2u << 0)
#define TIM5_SMCR_SMS_ENCODER_MODE_3				(0x3u << 0)
#define TIM5_SMCR_SMS_RESET_MODE				(0x4u << 0)
#define TIM5_SMCR_SMS_GATED_MODE				(0x5u << 0)
#define TIM5_SMCR_SMS_TRIGGER_MODE				(0x6u << 0)
#define TIM5_SMCR_SMS_EXT_CLOCK_MODE				(0x7u << 0)

