josuah/mcu-stm32f411/registers.h
	/* 0x0C: DMA/Interrupt enable register */
	uint32_t volatile DIER;
	/* Trigger DMA request enable */
#define TIM5_DIER_TDE						(1u << 14)
	/* Capture/Compare 4 DMA request */
#define TIM5_DIER_CC4DE						(1u << 12)
	/* Capture/Compare 3 DMA request */
#define TIM5_DIER_CC3DE						(1u << 11)
	/* Capture/Compare 2 DMA request */
#define TIM5_DIER_CC2DE						(1u << 10)
	/* Capture/Compare 1 DMA request */
#define TIM5_DIER_CC1DE						(1u << 9)
	/* Update DMA request enable */
#define TIM5_DIER_UDE						(1u << 8)
	/* Trigger interrupt enable */
#define TIM5_DIER_TIE						(1u << 6)
	/* Capture/Compare 4 interrupt */
#define TIM5_DIER_CC4IE						(1u << 4)
	/* Capture/Compare 3 interrupt */
#define TIM5_DIER_CC3IE						(1u << 3)
	/* Capture/Compare 2 interrupt */
#define TIM5_DIER_CC2IE						(1u << 2)
	/* Capture/Compare 1 interrupt */
#define TIM5_DIER_CC1IE						(1u << 1)
	/* Update interrupt enable */
#define TIM5_DIER_UIE						(1u << 0)

	/* 0x10: status register */
	uint32_t volatile SR;
	/* Capture/Compare 4 overcapture */
#define TIM5_SR_CC4OF						(1u << 12)
	/* Capture/Compare 3 overcapture */
#define TIM5_SR_CC3OF						(1u << 11)
	/* Capture/compare 2 overcapture */
#define TIM5_SR_CC2OF						(1u << 10)
	/* Capture/Compare 1 overcapture */
#define TIM5_SR_CC1OF						(1u << 9)
#define TIM5_SR_CC1OF_OVERCAPTURE				(0x1u << 9)
#define TIM5_SR_CC1OF_CLEAR					(0x0u << 9)
	/* Trigger interrupt flag */
#define TIM5_SR_TIF						(1u << 6)
#define TIM5_SR_TIF_NOTRIGGER					(0x0u << 6)
#define TIM5_SR_TIF_TRIGGER					(0x1u << 6)
#define TIM5_SR_TIF_CLEAR					(0x0u << 6)
	/* Capture/Compare 4 interrupt */
#define TIM5_SR_CC4IF						(1u << 4)
	/* Capture/Compare 3 interrupt */
#define TIM5_SR_CC3IF						(1u << 3)
	/* Capture/Compare 2 interrupt */
#define TIM5_SR_CC2IF						(1u << 2)
	/* Capture/compare 1 interrupt */
#define TIM5_SR_CC1IF						(1u << 1)
#define TIM5_SR_CC1IF_MATCH					(0x1u << 1)
#define TIM5_SR_CC1IF_CLEAR					(0x0u << 1)
	/* Update interrupt flag */
#define TIM5_SR_UIF						(1u << 0)
#define TIM5_SR_UIF_CLEAR					(0x0u << 0)
#define TIM5_SR_UIF_UPDATEPENDING				(0x1u << 0)

	/* 0x14: event generation register */
	uint32_t volatile EGR;
	/* Trigger generation */
#define TIM5_EGR_TG						(1u << 6)
#define TIM5_EGR_TG_TRIGGER					(0x1u << 6)
	/* Capture/compare 4 */
#define TIM5_EGR_CC4G						(1u << 4)
	/* Capture/compare 3 */
#define TIM5_EGR_CC3G						(1u << 3)
	/* Capture/compare 2 */
#define TIM5_EGR_CC2G						(1u << 2)
	/* Capture/compare 1 */
#define TIM5_EGR_CC1G						(1u << 1)
#define TIM5_EGR_CC1G_TRIGGER					(0x1u << 1)
	/* Update generation */
#define TIM5_EGR_UG						(1u << 0)
#define TIM5_EGR_UG_UPDATE					(0x1u << 0)

	/* 0x18: capture/compare mode register 1 (output */
	uint32_t volatile CCMR1_OUTPUT;
	/* OC2CE */
#define TIM5_CCMR1_OUTPUT_OC2CE					(1u << 15)
	/* OC2M */
#define TIM5_CCMR1_OUTPUT_OC2M_Msk				(0x7u << 12)
#define TIM5_CCMR1_OUTPUT_OC2M_Pos				12
	/* OC2PE */
#define TIM5_CCMR1_OUTPUT_OC2PE					(1u << 11)
	/* OC2FE */
#define TIM5_CCMR1_OUTPUT_OC2FE					(1u << 10)
	/* CC2S */
#define TIM5_CCMR1_OUTPUT_CC2S_Msk				(0x3u << 8)
#define TIM5_CCMR1_OUTPUT_CC2S_Pos				8
#define TIM5_CCMR1_OUTPUT_CC2S_OUTPUT				(0x0u << 8)
	/* OC1CE */
#define TIM5_CCMR1_OUTPUT_OC1CE					(1u << 7)
	/* OC1M */
#define TIM5_CCMR1_OUTPUT_OC1M_Msk				(0x7u << 4)
#define TIM5_CCMR1_OUTPUT_OC1M_Pos				4
#define TIM5_CCMR1_OUTPUT_OC1M_FROZEN				(0x0u << 4)
#define TIM5_CCMR1_OUTPUT_OC1M_ACTIVEONMATCH			(0x1u << 4)
#define TIM5_CCMR1_OUTPUT_OC1M_INACTIVEONMATCH			(0x2u << 4)
#define TIM5_CCMR1_OUTPUT_OC1M_TOGGLE				(0x3u << 4)
#define TIM5_CCMR1_OUTPUT_OC1M_FORCEINACTIVE			(0x4u << 4)
#define TIM5_CCMR1_OUTPUT_OC1M_FORCEACTIVE			(0x5u << 4)
#define TIM5_CCMR1_OUTPUT_OC1M_PWMMODE1				(0x6u << 4)
#define TIM5_CCMR1_OUTPUT_OC1M_PWMMODE2				(0x7u << 4)
	/* OC1PE */
#define TIM5_CCMR1_OUTPUT_OC1PE					(1u << 3)
	/* OC1FE */
#define TIM5_CCMR1_OUTPUT_OC1FE					(1u << 2)
	/* CC1S */
#define TIM5_CCMR1_OUTPUT_CC1S_Msk				(0x3u << 0)
#define TIM5_CCMR1_OUTPUT_CC1S_Pos				0
#define TIM5_CCMR1_OUTPUT_CC1S_OUTPUT				(0x0u << 0)

	/* 0x18: capture/compare mode register 1 (input */
	uint32_t volatile CCMR1_INPUT;
	/* Input capture 2 filter */
#define TIM5_CCMR1_INPUT_IC2F_Msk				(0xFu << 12)
#define TIM5_CCMR1_INPUT_IC2F_Pos				12
	/* Input capture 2 prescaler */
#define TIM5_CCMR1_INPUT_IC2PSC_Msk				(0x3u << 10)
#define TIM5_CCMR1_INPUT_IC2PSC_Pos				10
	/* Capture/Compare 2 */
#define TIM5_CCMR1_INPUT_CC2S_Msk				(0x3u << 8)
#define TIM5_CCMR1_INPUT_CC2S_Pos				8
#define TIM5_CCMR1_INPUT_CC2S_TI2				(0x1u << 8)
#define TIM5_CCMR1_INPUT_CC2S_TI1				(0x2u << 8)
#define TIM5_CCMR1_INPUT_CC2S_TRC				(0x3u << 8)
	/* Input capture 1 filter */
#define TIM5_CCMR1_INPUT_IC1F_Msk				(0xFu << 4)
#define TIM5_CCMR1_INPUT_IC1F_Pos				4
#define TIM5_CCMR1_INPUT_IC1F_NOFILTER				(0x0u << 4)
#define TIM5_CCMR1_INPUT_IC1F_FCK_INT_N2			(0x1u << 4)
#define TIM5_CCMR1_INPUT_IC1F_FCK_INT_N4			(0x2u << 4)
#define TIM5_CCMR1_INPUT_IC1F_FCK_INT_N8			(0x3u << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV2_N6			(0x4u << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV2_N8			(0x5u << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV4_N6			(0x6u << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV4_N8			(0x7u << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV8_N6			(0x8u << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV8_N8			(0x9u << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV16_N5			(0xAu << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV16_N6			(0xBu << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV16_N8			(0xCu << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV32_N5			(0xDu << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV32_N6			(0xEu << 4)
#define TIM5_CCMR1_INPUT_IC1F_FDTS_DIV32_N8			(0xFu << 4)
	/* Input capture 1 prescaler */
#define TIM5_CCMR1_INPUT_IC1PSC_Msk				(0x3u << 2)
#define TIM5_CCMR1_INPUT_IC1PSC_Pos				2
	/* Capture/Compare 1 */
#define TIM5_CCMR1_INPUT_CC1S_Msk				(0x3u << 0)
#define TIM5_CCMR1_INPUT_CC1S_Pos				0
#define TIM5_CCMR1_INPUT_CC1S_TI1				(0x1u << 0)
#define TIM5_CCMR1_INPUT_CC1S_TI2				(0x2u << 0)
#define TIM5_CCMR1_INPUT_CC1S_TRC				(0x3u << 0)

	/* 0x1C: capture/compare mode register 2 (output */
	uint32_t volatile CCMR2_OUTPUT;
	/* O24CE */
#define TIM5_CCMR2_OUTPUT_OC4CE					(1u << 15)
	/* OC4M */
#define TIM5_CCMR2_OUTPUT_OC4M_Msk				(0x7u << 12)
#define TIM5_CCMR2_OUTPUT_OC4M_Pos				12
	/* OC4PE */
#define TIM5_CCMR2_OUTPUT_OC4PE					(1u << 11)
	/* OC4FE */
#define TIM5_CCMR2_OUTPUT_OC4FE					(1u << 10)
	/* CC4S */
#define TIM5_CCMR2_OUTPUT_CC4S_Msk				(0x3u << 8)
#define TIM5_CCMR2_OUTPUT_CC4S_Pos				8
#define TIM5_CCMR2_OUTPUT_CC4S_OUTPUT				(0x0u << 8)
	/* OC3CE */
#define TIM5_CCMR2_OUTPUT_OC3CE					(1u << 7)
	/* OC3M */
#define TIM5_CCMR2_OUTPUT_OC3M_Msk				(0x7u << 4)
#define TIM5_CCMR2_OUTPUT_OC3M_Pos				4
#define TIM5_CCMR2_OUTPUT_OC3M_FROZEN				(0x0u << 4)
#define TIM5_CCMR2_OUTPUT_OC3M_ACTIVEONMATCH			(0x1u << 4)
#define TIM5_CCMR2_OUTPUT_OC3M_INACTIVEONMATCH			(0x2u << 4)
#define TIM5_CCMR2_OUTPUT_OC3M_TOGGLE				(0x3u << 4)
#define TIM5_CCMR2_OUTPUT_OC3M_FORCEINACTIVE			(0x4u << 4)
#define TIM5_CCMR2_OUTPUT_OC3M_FORCEACTIVE			(0x5u << 4)
#define TIM5_CCMR2_OUTPUT_OC3M_PWMMODE1				(0x6u << 4)
#define TIM5_CCMR2_OUTPUT_OC3M_PWMMODE2				(0x7u << 4)
	/* OC3PE */
#define TIM5_CCMR2_OUTPUT_OC3PE					(1u << 3)
	/* OC3FE */
#define TIM5_CCMR2_OUTPUT_OC3FE					(1u << 2)
	/* CC3S */
#define TIM5_CCMR2_OUTPUT_CC3S_Msk				(0x3u << 0)
#define TIM5_CCMR2_OUTPUT_CC3S_Pos				0
#define TIM5_CCMR2_OUTPUT_CC3S_OUTPUT				(0x0u << 0)

	/* 0x1C: capture/compare mode register 2 (input */
	uint32_t volatile CCMR2_INPUT;
	/* Input capture 4 filter */
#define TIM5_CCMR2_INPUT_IC4F_Msk				(0xFu << 12)
#define TIM5_CCMR2_INPUT_IC4F_Pos				12
	/* Input capture 4 prescaler */
#define TIM5_CCMR2_INPUT_IC4PSC_Msk				(0x3u << 10)
#define TIM5_CCMR2_INPUT_IC4PSC_Pos				10
	/* Capture/Compare 4 */
#define TIM5_CCMR2_INPUT_CC4S_Msk				(0x3u << 8)
#define TIM5_CCMR2_INPUT_CC4S_Pos				8
#define TIM5_CCMR2_INPUT_CC4S_TI4				(0x1u << 8)
#define TIM5_CCMR2_INPUT_CC4S_TI3				(0x2u << 8)
#define TIM5_CCMR2_INPUT_CC4S_TRC				(0x3u << 8)
	/* Input capture 3 filter */
#define TIM5_CCMR2_INPUT_IC3F_Msk				(0xFu << 4)
#define TIM5_CCMR2_INPUT_IC3F_Pos				4
	/* Input capture 3 prescaler */
#define TIM5_CCMR2_INPUT_IC3PSC_Msk				(0x3u << 2)
#define TIM5_CCMR2_INPUT_IC3PSC_Pos				2
	/* Capture/compare 3 */
#define TIM5_CCMR2_INPUT_CC3S_Msk				(0x3u << 0)
#define TIM5_CCMR2_INPUT_CC3S_Pos				0
#define TIM5_CCMR2_INPUT_CC3S_TI3				(0x1u << 0)
#define TIM5_CCMR2_INPUT_CC3S_TI4				(0x2u << 0)
#define TIM5_CCMR2_INPUT_CC3S_TRC				(0x3u << 0)

