josuah/mcu-stm32f411/registers.h
	/* 0x20: capture/compare enable */
	uint32_t volatile CCER;
	/* Capture/Compare 4 output */
#define TIM5_CCER_CC4NP						(1u << 15)
	/* Capture/Compare 3 output */
#define TIM5_CCER_CC4P						(1u << 13)
	/* Capture/Compare 4 output */
#define TIM5_CCER_CC4E						(1u << 12)
	/* Capture/Compare 3 output */
#define TIM5_CCER_CC3NP						(1u << 11)
	/* Capture/Compare 3 output */
#define TIM5_CCER_CC3P						(1u << 9)
	/* Capture/Compare 3 output */
#define TIM5_CCER_CC3E						(1u << 8)
	/* Capture/Compare 2 output */
#define TIM5_CCER_CC2NP						(1u << 7)
	/* Capture/Compare 2 output */
#define TIM5_CCER_CC2P						(1u << 5)
	/* Capture/Compare 2 output */
#define TIM5_CCER_CC2E						(1u << 4)
	/* Capture/Compare 1 output */
#define TIM5_CCER_CC1NP						(1u << 3)
	/* Capture/Compare 1 output */
#define TIM5_CCER_CC1P						(1u << 1)
	/* Capture/Compare 1 output */
#define TIM5_CCER_CC1E						(1u << 0)

	/* 0x24: counter */
	uint32_t volatile CNT;
	/* Counter value */
#define TIM5_CNT_CNT_Msk					(0xFFFFFFFFu << 0)
#define TIM5_CNT_CNT_Pos					0

	/* 0x28: prescaler */
	uint32_t volatile PSC;
	/* Prescaler value */
#define TIM5_PSC_PSC_Msk					(0xFFFFu << 0)
#define TIM5_PSC_PSC_Pos					0

	/* 0x2C: auto-reload register */
	uint32_t volatile ARR;
	/* Auto-reload value */
#define TIM5_ARR_ARR_Msk					(0xFFFFFFFFu << 0)
#define TIM5_ARR_ARR_Pos					0

	/* 0x30 */
	uint8_t RESERVED0[0x34u-0x30u];

	/* 0x34: capture/compare register */
	uint32_t volatile CCR[4];
	/* Capture/Compare value */
#define TIM5_CCR_CCR_Msk					(0xFFFFFFFFu << 0)
#define TIM5_CCR_CCR_Pos					0

	/* 0x38 */
	uint8_t RESERVED1[0x48u-0x38u];

	/* 0x48: DMA control register */
	uint32_t volatile DCR;
	/* DMA burst length */
#define TIM5_DCR_DBL_Msk					(0x1Fu << 8)
#define TIM5_DCR_DBL_Pos					8
	/* DMA base address */
#define TIM5_DCR_DBA_Msk					(0x1Fu << 0)
#define TIM5_DCR_DBA_Pos					0

	/* 0x4C: DMA address for full transfer */
	uint32_t volatile DMAR;
	/* DMA register for burst */
#define TIM5_DMAR_DMAB_Msk					(0xFFFFu << 0)
#define TIM5_DMAR_DMAB_Pos					0

	/* 0x50: TIM5 option register */
	uint32_t volatile OR;
	/* Timer Input 4 remap */
#define TIM5_OR_IT4_RMP_Msk					(0x3u << 6)
#define TIM5_OR_IT4_RMP_Pos					6

};


#define TIM9 ((struct mcu_tim9 *)0x40014000)

struct mcu_tim9 {

	/* 0x00: control register 1 */
	uint32_t volatile CR1;
	/* Clock division */
#define TIM9_CR1_CKD_Msk					(0x3u << 8)
#define TIM9_CR1_CKD_Pos					8
#define TIM9_CR1_CKD_DIV1					(0x0u << 8)
#define TIM9_CR1_CKD_DIV2					(0x1u << 8)
#define TIM9_CR1_CKD_DIV4					(0x2u << 8)
	/* Auto-reload preload enable */
#define TIM9_CR1_ARPE						(1u << 7)
	/* One-pulse mode */
#define TIM9_CR1_OPM						(1u << 3)
	/* Update request source */
#define TIM9_CR1_URS						(1u << 2)
#define TIM9_CR1_URS_ANYEVENT					(0x0u << 2)
#define TIM9_CR1_URS_COUNTERONLY				(0x1u << 2)
	/* Update disable */
#define TIM9_CR1_UDIS						(1u << 1)
#define TIM9_CR1_UDIS_ENABLED					(0x0u << 1)
#define TIM9_CR1_UDIS_DISABLED					(0x1u << 1)
	/* Counter enable */
#define TIM9_CR1_CEN						(1u << 0)

	/* 0x04: control register 2 */
	uint32_t volatile CR2;
	/* Master mode selection */
#define TIM9_CR2_MMS_Msk					(0x7u << 4)
#define TIM9_CR2_MMS_Pos					4

	/* 0x08: slave mode control register */
	uint32_t volatile SMCR;
	/* Master/Slave mode */
#define TIM9_SMCR_MSM						(1u << 7)
	/* Trigger selection */
#define TIM9_SMCR_TS_Msk					(0x7u << 4)
#define TIM9_SMCR_TS_Pos					4
	/* Slave mode selection */
#define TIM9_SMCR_SMS_Msk					(0x7u << 0)
#define TIM9_SMCR_SMS_Pos					0

	/* 0x0C: DMA/Interrupt enable register */
	uint32_t volatile DIER;
	/* Trigger interrupt enable */
#define TIM9_DIER_TIE						(1u << 6)
	/* Capture/Compare 2 interrupt */
#define TIM9_DIER_CC2IE						(1u << 2)
	/* Capture/Compare 1 interrupt */
#define TIM9_DIER_CC1IE						(1u << 1)
	/* Update interrupt enable */
#define TIM9_DIER_UIE						(1u << 0)

	/* 0x10: status register */
	uint32_t volatile SR;
	/* Capture/compare 2 overcapture */
#define TIM9_SR_CC2OF						(1u << 10)
	/* Capture/Compare 1 overcapture */
#define TIM9_SR_CC1OF						(1u << 9)
	/* Trigger interrupt flag */
#define TIM9_SR_TIF						(1u << 6)
	/* Capture/Compare 2 interrupt */
#define TIM9_SR_CC2IF						(1u << 2)
	/* Capture/compare 1 interrupt */
#define TIM9_SR_CC1IF						(1u << 1)
	/* Update interrupt flag */
#define TIM9_SR_UIF						(1u << 0)
#define TIM9_SR_UIF_CLEAR					(0x0u << 0)
#define TIM9_SR_UIF_UPDATEPENDING				(0x1u << 0)

	/* 0x14: event generation register */
	uint32_t volatile EGR;
	/* Trigger generation */
#define TIM9_EGR_TG						(1u << 6)
	/* Capture/compare 2 */
#define TIM9_EGR_CC2G						(1u << 2)
	/* Capture/compare 1 */
#define TIM9_EGR_CC1G						(1u << 1)
	/* Update generation */
#define TIM9_EGR_UG						(1u << 0)
#define TIM9_EGR_UG_UPDATE					(0x1u << 0)

	/* 0x18: capture/compare mode register 1 (output */
	uint32_t volatile CCMR1_OUTPUT;
	/* Output Compare 2 mode */
#define TIM9_CCMR1_OUTPUT_OC2M_Msk				(0x7u << 12)
#define TIM9_CCMR1_OUTPUT_OC2M_Pos				12
	/* Output Compare 2 preload */
#define TIM9_CCMR1_OUTPUT_OC2PE					(1u << 11)
	/* Output Compare 2 fast */
#define TIM9_CCMR1_OUTPUT_OC2FE					(1u << 10)
	/* Capture/Compare 2 */
#define TIM9_CCMR1_OUTPUT_CC2S_Msk				(0x3u << 8)
#define TIM9_CCMR1_OUTPUT_CC2S_Pos				8
	/* Output Compare 1 mode */
#define TIM9_CCMR1_OUTPUT_OC1M_Msk				(0x7u << 4)
#define TIM9_CCMR1_OUTPUT_OC1M_Pos				4
#define TIM9_CCMR1_OUTPUT_OC1M_FROZEN				(0x0u << 4)
#define TIM9_CCMR1_OUTPUT_OC1M_ACTIVEONMATCH			(0x1u << 4)
#define TIM9_CCMR1_OUTPUT_OC1M_INACTIVEONMATCH			(0x2u << 4)
#define TIM9_CCMR1_OUTPUT_OC1M_TOGGLE				(0x3u << 4)
#define TIM9_CCMR1_OUTPUT_OC1M_FORCEINACTIVE			(0x4u << 4)
#define TIM9_CCMR1_OUTPUT_OC1M_FORCEACTIVE			(0x5u << 4)
#define TIM9_CCMR1_OUTPUT_OC1M_PWMMODE1				(0x6u << 4)
#define TIM9_CCMR1_OUTPUT_OC1M_PWMMODE2				(0x7u << 4)
	/* Output Compare 1 preload */
#define TIM9_CCMR1_OUTPUT_OC1PE					(1u << 3)
	/* Output Compare 1 fast */
#define TIM9_CCMR1_OUTPUT_OC1FE					(1u << 2)
	/* Capture/Compare 1 */
#define TIM9_CCMR1_OUTPUT_CC1S_Msk				(0x3u << 0)
#define TIM9_CCMR1_OUTPUT_CC1S_Pos				0

	/* 0x18: capture/compare mode register 1 (input */
	uint32_t volatile CCMR1_INPUT;
	/* Input capture 2 filter */
#define TIM9_CCMR1_INPUT_IC2F_Msk				(0x7u << 12)
#define TIM9_CCMR1_INPUT_IC2F_Pos				12
	/* Input capture 2 prescaler */
#define TIM9_CCMR1_INPUT_IC2PSC_Msk				(0x3u << 10)
#define TIM9_CCMR1_INPUT_IC2PSC_Pos				10
	/* Capture/Compare 2 */
#define TIM9_CCMR1_INPUT_CC2S_Msk				(0x3u << 8)
#define TIM9_CCMR1_INPUT_CC2S_Pos				8
	/* Input capture 1 filter */
#define TIM9_CCMR1_INPUT_IC1F_Msk				(0x7u << 4)
#define TIM9_CCMR1_INPUT_IC1F_Pos				4
	/* Input capture 1 prescaler */
#define TIM9_CCMR1_INPUT_IC1PSC_Msk				(0x3u << 2)
#define TIM9_CCMR1_INPUT_IC1PSC_Pos				2
	/* Capture/Compare 1 */
#define TIM9_CCMR1_INPUT_CC1S_Msk				(0x3u << 0)
#define TIM9_CCMR1_INPUT_CC1S_Pos				0

	/* 0x1C */
	uint8_t RESERVED0[0x20u-0x1Cu];

