josuah/mcu-stm32f411/registers.h
	/* 0x20: capture/compare enable */
	uint32_t volatile CCER;
	/* Capture/Compare 2 output */
#define TIM9_CCER_CC2NP						(1u << 7)
	/* Capture/Compare 2 output */
#define TIM9_CCER_CC2P						(1u << 5)
	/* Capture/Compare 2 output */
#define TIM9_CCER_CC2E						(1u << 4)
	/* Capture/Compare 1 output */
#define TIM9_CCER_CC1NP						(1u << 3)
	/* Capture/Compare 1 output */
#define TIM9_CCER_CC1P						(1u << 1)
	/* Capture/Compare 1 output */
#define TIM9_CCER_CC1E						(1u << 0)

	/* 0x24: counter */
	uint32_t volatile CNT;
	/* counter value */
#define TIM9_CNT_CNT_Msk					(0xFFFFu << 0)
#define TIM9_CNT_CNT_Pos					0

	/* 0x28: prescaler */
	uint32_t volatile PSC;
	/* Prescaler value */
#define TIM9_PSC_PSC_Msk					(0xFFFFu << 0)
#define TIM9_PSC_PSC_Pos					0

	/* 0x2C: auto-reload register */
	uint32_t volatile ARR;
	/* Auto-reload value */
#define TIM9_ARR_ARR_Msk					(0xFFFFu << 0)
#define TIM9_ARR_ARR_Pos					0

	/* 0x30 */
	uint8_t RESERVED1[0x34u-0x30u];

	/* 0x34: capture/compare register */
	uint32_t volatile CCR[2];
	/* Capture/Compare value */
#define TIM9_CCR_CCR_Msk					(0xFFFFu << 0)
#define TIM9_CCR_CCR_Pos					0

};


#define USART1 ((struct mcu_usart *)0x40011000)
#define USART2 ((struct mcu_usart *)0x40004400)
#define USART6 ((struct mcu_usart *)0x40011400)

struct mcu_usart {

	/* 0x00: Status register */
	uint32_t volatile SR;
	/* CTS flag */
#define USART_SR_CTS						(1u << 9)
	/* LIN break detection flag */
#define USART_SR_LBD						(1u << 8)
	/* Transmit data register */
#define USART_SR_TXE						(1u << 7)
	/* Transmission complete */
#define USART_SR_TC						(1u << 6)
	/* Read data register not */
#define USART_SR_RXNE						(1u << 5)
	/* IDLE line detected */
#define USART_SR_IDLE						(1u << 4)
	/* Overrun error */
#define USART_SR_ORE						(1u << 3)
	/* Noise detected flag */
#define USART_SR_NF						(1u << 2)
	/* Framing error */
#define USART_SR_FE						(1u << 1)
	/* Parity error */
#define USART_SR_PE						(1u << 0)

	/* 0x04: Data register */
	uint32_t volatile DR;
	/* Data value */
#define USART_DR_DR_Msk						(0x1FFu << 0)
#define USART_DR_DR_Pos						0

	/* 0x08: Baud rate register */
	uint32_t volatile BRR;
	/* mantissa of USARTDIV */
#define USART_BRR_DIV_MANTISSA_Msk				(0xFFFu << 4)
#define USART_BRR_DIV_MANTISSA_Pos				4
	/* fraction of USARTDIV */
#define USART_BRR_DIV_FRACTION_Msk				(0xFu << 0)
#define USART_BRR_DIV_FRACTION_Pos				0

	/* 0x0C: Control register 1 */
	uint32_t volatile CR1;
	/* Oversampling mode */
#define USART_CR1_OVER8						(1u << 15)
#define USART_CR1_OVER8_OVERSAMPLE16				(0x0u << 15)
#define USART_CR1_OVER8_OVERSAMPLE8				(0x1u << 15)
	/* USART enable */
#define USART_CR1_UE						(1u << 13)
	/* Word length */
#define USART_CR1_M						(1u << 12)
#define USART_CR1_M_M8						(0x0u << 12)
#define USART_CR1_M_M9						(0x1u << 12)
	/* Wakeup method */
#define USART_CR1_WAKE						(1u << 11)
#define USART_CR1_WAKE_IDLELINE					(0x0u << 11)
#define USART_CR1_WAKE_ADDRESSMARK				(0x1u << 11)
	/* Parity control enable */
#define USART_CR1_PCE						(1u << 10)
	/* Parity selection */
#define USART_CR1_PS						(1u << 9)
#define USART_CR1_PS_EVEN					(0x0u << 9)
#define USART_CR1_PS_ODD					(0x1u << 9)
	/* PE interrupt enable */
#define USART_CR1_PEIE						(1u << 8)
	/* TXE interrupt enable */
#define USART_CR1_TXEIE						(1u << 7)
	/* Transmission complete interrupt */
#define USART_CR1_TCIE						(1u << 6)
	/* RXNE interrupt enable */
#define USART_CR1_RXNEIE					(1u << 5)
	/* IDLE interrupt enable */
#define USART_CR1_IDLEIE					(1u << 4)
	/* Transmitter enable */
#define USART_CR1_TE						(1u << 3)
	/* Receiver enable */
#define USART_CR1_RE						(1u << 2)
	/* Receiver wakeup */
#define USART_CR1_RWU						(1u << 1)
#define USART_CR1_RWU_ACTIVE					(0x0u << 1)
#define USART_CR1_RWU_MUTE					(0x1u << 1)
	/* Send break */
#define USART_CR1_SBK						(1u << 0)
#define USART_CR1_SBK_NOBREAK					(0x0u << 0)
#define USART_CR1_SBK_BREAK					(0x1u << 0)

	/* 0x10: Control register 2 */
	uint32_t volatile CR2;
	/* LIN mode enable */
#define USART_CR2_LINEN						(1u << 14)
	/* STOP bits */
#define USART_CR2_STOP_Msk					(0x3u << 12)
#define USART_CR2_STOP_Pos					12
#define USART_CR2_STOP_STOP1					(0x0u << 12)
#define USART_CR2_STOP_STOP0P5					(0x1u << 12)
#define USART_CR2_STOP_STOP2					(0x2u << 12)
#define USART_CR2_STOP_STOP1P5					(0x3u << 12)
	/* Clock enable */
#define USART_CR2_CLKEN						(1u << 11)
	/* Clock polarity */
#define USART_CR2_CPOL						(1u << 10)
#define USART_CR2_CPOL_LOW					(0x0u << 10)
#define USART_CR2_CPOL_HIGH					(0x1u << 10)
	/* Clock phase */
#define USART_CR2_CPHA						(1u << 9)
#define USART_CR2_CPHA_FIRST					(0x0u << 9)
#define USART_CR2_CPHA_SECOND					(0x1u << 9)
	/* Last bit clock pulse */
#define USART_CR2_LBCL						(1u << 8)
	/* LIN break detection interrupt */
#define USART_CR2_LBDIE						(1u << 6)
	/* lin break detection length */
#define USART_CR2_LBDL						(1u << 5)
#define USART_CR2_LBDL_LBDL10					(0x0u << 5)
#define USART_CR2_LBDL_LBDL11					(0x1u << 5)
	/* Address of the USART node */
#define USART_CR2_ADD_Msk					(0xFu << 0)
#define USART_CR2_ADD_Pos					0

	/* 0x14: Control register 3 */
	uint32_t volatile CR3;
	/* One sample bit method */
#define USART_CR3_ONEBIT					(1u << 11)
#define USART_CR3_ONEBIT_SAMPLE3				(0x0u << 11)
#define USART_CR3_ONEBIT_SAMPLE1				(0x1u << 11)
	/* CTS interrupt enable */
#define USART_CR3_CTSIE						(1u << 10)
	/* CTS enable */
#define USART_CR3_CTSE						(1u << 9)
	/* RTS enable */
#define USART_CR3_RTSE						(1u << 8)
	/* DMA enable transmitter */
#define USART_CR3_DMAT						(1u << 7)
	/* DMA enable receiver */
#define USART_CR3_DMAR						(1u << 6)
	/* Smartcard mode enable */
#define USART_CR3_SCEN						(1u << 5)
	/* Smartcard NACK enable */
#define USART_CR3_NACK						(1u << 4)
	/* Half-duplex selection */
#define USART_CR3_HDSEL						(1u << 3)
#define USART_CR3_HDSEL_FULLDUPLEX				(0x0u << 3)
#define USART_CR3_HDSEL_HALFDUPLEX				(0x1u << 3)
	/* IrDA low-power */
#define USART_CR3_IRLP						(1u << 2)
#define USART_CR3_IRLP_NORMAL					(0x0u << 2)
#define USART_CR3_IRLP_LOWPOWER					(0x1u << 2)
	/* IrDA mode enable */
#define USART_CR3_IREN						(1u << 1)
	/* Error interrupt enable */
#define USART_CR3_EIE						(1u << 0)

	/* 0x18: Guard time and prescaler */
	uint32_t volatile GTPR;
	/* Guard time value */
#define USART_GTPR_GT_Msk					(0xFFu << 8)
#define USART_GTPR_GT_Pos					8
	/* Prescaler value */
#define USART_GTPR_PSC_Msk					(0xFFu << 0)
#define USART_GTPR_PSC_Pos					0

