josuah/mcu-stm32f411/registers.h
};


#define WWDG ((struct mcu_wwdg *)0x40002C00)

struct mcu_wwdg {

	/* 0x00: Control register */
	uint32_t volatile CR;
	/* Activation bit */
#define WWDG_CR_WDGA						(1u << 7)
	/* 7-bit counter (MSB to LSB) */
#define WWDG_CR_T_Msk						(0x7Fu << 0)
#define WWDG_CR_T_Pos						0

	/* 0x04: Configuration register */
	uint32_t volatile CFR;
	/* Early wakeup interrupt */
#define WWDG_CFR_EWI						(1u << 9)
#define WWDG_CFR_EWI_ENABLE					(0x1u << 9)
	/* 7-bit window value */
#define WWDG_CFR_W_Msk						(0x7Fu << 0)
#define WWDG_CFR_W_Pos						0
	/* Timer base */
#define WWDG_CFR_WDGTB_Msk					(0x3u << 7)
#define WWDG_CFR_WDGTB_Pos					7
#define WWDG_CFR_WDGTB_DIV1					(0x0u << 7)
#define WWDG_CFR_WDGTB_DIV2					(0x1u << 7)
#define WWDG_CFR_WDGTB_DIV4					(0x2u << 7)
#define WWDG_CFR_WDGTB_DIV8					(0x3u << 7)

	/* 0x08: Status register */
	uint32_t volatile SR;
	/* Early wakeup interrupt */
#define WWDG_SR_EWIF						(1u << 0)
#define WWDG_SR_EWIF_PENDING					(0x1u << 0)
#define WWDG_SR_EWIF_FINISHED					(0x0u << 0)
#define WWDG_SR_EWIF_FINISHED					(0x0u << 0)

};


#define DMA1 ((struct mcu_dma *)0x40026000)
#define DMA2 ((struct mcu_dma *)0x40026400)

struct mcu_dma {

	/* 0x00: stream x configuration */
	uint32_t volatile CR;
	/* Channel selection */
#define DMA_CR_CHSEL_Msk					(0x7u << 25)
#define DMA_CR_CHSEL_Pos					25
	/* Memory burst transfer */
#define DMA_CR_MBURST_Msk					(0x3u << 23)
#define DMA_CR_MBURST_Pos					23
	/* Peripheral burst transfer */
#define DMA_CR_PBURST_Msk					(0x3u << 21)
#define DMA_CR_PBURST_Pos					21
#define DMA_CR_PBURST_SINGLE					(0x0u << 21)
#define DMA_CR_PBURST_INCR4					(0x1u << 21)
#define DMA_CR_PBURST_INCR8					(0x2u << 21)
#define DMA_CR_PBURST_INCR16					(0x3u << 21)
	/* Current target (only in double buffer */
#define DMA_CR_CT						(1u << 19)
#define DMA_CR_CT_MEMORY0					(0x0u << 19)
#define DMA_CR_CT_MEMORY1					(0x1u << 19)
	/* Double buffer mode */
#define DMA_CR_DBM						(1u << 18)
	/* Priority level */
#define DMA_CR_PL_Msk						(0x3u << 16)
#define DMA_CR_PL_Pos						16
#define DMA_CR_PL_LOW						(0x0u << 16)
#define DMA_CR_PL_MEDIUM					(0x1u << 16)
#define DMA_CR_PL_HIGH						(0x2u << 16)
#define DMA_CR_PL_VERYHIGH					(0x3u << 16)
	/* Peripheral increment offset */
#define DMA_CR_PINCOS						(1u << 15)
#define DMA_CR_PINCOS_PSIZE					(0x0u << 15)
#define DMA_CR_PINCOS_FIXED4					(0x1u << 15)
	/* Memory data size */
#define DMA_CR_MSIZE_Msk					(0x3u << 13)
#define DMA_CR_MSIZE_Pos					13
	/* Peripheral data size */
#define DMA_CR_PSIZE_Msk					(0x3u << 11)
#define DMA_CR_PSIZE_Pos					11
#define DMA_CR_PSIZE_BITS8					(0x0u << 11)
#define DMA_CR_PSIZE_BITS16					(0x1u << 11)
#define DMA_CR_PSIZE_BITS32					(0x2u << 11)
	/* Memory increment mode */
#define DMA_CR_MINC						(1u << 10)
	/* Peripheral increment mode */
#define DMA_CR_PINC						(1u << 9)
#define DMA_CR_PINC_FIXED					(0x0u << 9)
#define DMA_CR_PINC_INCREMENTED					(0x1u << 9)
	/* Circular mode */
#define DMA_CR_CIRC						(1u << 8)
	/* Data transfer direction */
#define DMA_CR_DIR_Msk						(0x3u << 6)
#define DMA_CR_DIR_Pos						6
#define DMA_CR_DIR_PERIPHERALTOMEMORY				(0x0u << 6)
#define DMA_CR_DIR_MEMORYTOPERIPHERAL				(0x1u << 6)
#define DMA_CR_DIR_MEMORYTOMEMORY				(0x2u << 6)
	/* Peripheral flow controller */
#define DMA_CR_PFCTRL						(1u << 5)
#define DMA_CR_PFCTRL_DMA					(0x0u << 5)
#define DMA_CR_PFCTRL_PERIPHERAL				(0x1u << 5)
	/* Transfer complete interrupt */
#define DMA_CR_TCIE						(1u << 4)
	/* Half transfer interrupt */
#define DMA_CR_HTIE						(1u << 3)
	/* Transfer error interrupt */
#define DMA_CR_TEIE						(1u << 2)
	/* Direct mode error interrupt */
#define DMA_CR_DMEIE						(1u << 1)
	/* Stream enable / flag stream ready when */
#define DMA_CR_EN						(1u << 0)

	/* 0x04: stream x number of data */
	uint32_t volatile NDTR;
	/* Number of data items to */
#define DMA_NDTR_NDT_Msk					(0xFFFFu << 0)
#define DMA_NDTR_NDT_Pos					0

	/* 0x08: stream x peripheral address */
	uint32_t volatile PAR;
	/* Peripheral address */
#define DMA_PAR_PA_Msk						(0xFFFFFFFFu << 0)
#define DMA_PAR_PA_Pos						0

	/* 0x0C: stream x memory 0 address */
	uint32_t volatile M0AR;
	/* Memory 0 address */
#define DMA_M0AR_M0A_Msk					(0xFFFFFFFFu << 0)
#define DMA_M0AR_M0A_Pos					0

	/* 0x10: stream x memory 1 address */
	uint32_t volatile M1AR;
	/* Memory 1 address (used in case of Double */
#define DMA_M1AR_M1A_Msk					(0xFFFFFFFFu << 0)
#define DMA_M1AR_M1A_Pos					0

	/* 0x14: stream x FIFO control register */
	uint32_t volatile FCR;
	/* FIFO error interrupt */
#define DMA_FCR_FEIE						(1u << 7)
	/* FIFO status */
#define DMA_FCR_FS_Msk						(0x7u << 3)
#define DMA_FCR_FS_Pos						3
#define DMA_FCR_FS_QUARTER1					(0x0u << 3)
#define DMA_FCR_FS_QUARTER2					(0x1u << 3)
#define DMA_FCR_FS_QUARTER3					(0x2u << 3)
#define DMA_FCR_FS_QUARTER4					(0x3u << 3)
#define DMA_FCR_FS_EMPTY					(0x4u << 3)
#define DMA_FCR_FS_FULL						(0x5u << 3)
	/* Direct mode disable */
#define DMA_FCR_DMDIS						(1u << 2)
#define DMA_FCR_DMDIS_ENABLED					(0x0u << 2)
#define DMA_FCR_DMDIS_DISABLED					(0x1u << 2)
	/* FIFO threshold selection */
#define DMA_FCR_FTH_Msk						(0x3u << 0)
#define DMA_FCR_FTH_Pos						0
#define DMA_FCR_FTH_QUARTER					(0x0u << 0)
#define DMA_FCR_FTH_HALF					(0x1u << 0)
#define DMA_FCR_FTH_THREEQUARTERS				(0x2u << 0)
#define DMA_FCR_FTH_FULL					(0x3u << 0)

	/* 0x00: low interrupt status register */
	uint32_t volatile const LISR;
	/* Stream x transfer complete interrupt */
#define DMA_LISR_TCIF3						(1u << 27)
	/* Stream x half transfer interrupt flag */
#define DMA_LISR_HTIF3						(1u << 26)
	/* Stream x transfer error interrupt flag */
#define DMA_LISR_TEIF3						(1u << 25)
	/* Stream x direct mode error interrupt */
#define DMA_LISR_DMEIF3						(1u << 24)
	/* Stream x FIFO error interrupt flag */
#define DMA_LISR_FEIF3						(1u << 22)
	/* Stream x transfer complete interrupt */
#define DMA_LISR_TCIF2						(1u << 21)
	/* Stream x half transfer interrupt flag */
#define DMA_LISR_HTIF2						(1u << 20)
	/* Stream x transfer error interrupt flag */
#define DMA_LISR_TEIF2						(1u << 19)
	/* Stream x direct mode error interrupt */
#define DMA_LISR_DMEIF2						(1u << 18)
	/* Stream x FIFO error interrupt flag */
#define DMA_LISR_FEIF2						(1u << 16)
	/* Stream x transfer complete interrupt */
#define DMA_LISR_TCIF1						(1u << 11)
	/* Stream x half transfer interrupt flag */
#define DMA_LISR_HTIF1						(1u << 10)
	/* Stream x transfer error interrupt flag */
#define DMA_LISR_TEIF1						(1u << 9)
	/* Stream x direct mode error interrupt */
#define DMA_LISR_DMEIF1						(1u << 8)
	/* Stream x FIFO error interrupt flag */
#define DMA_LISR_FEIF1						(1u << 6)
	/* Stream x transfer complete interrupt */
#define DMA_LISR_TCIF0						(1u << 5)
#define DMA_LISR_TCIF0_NOTCOMPLETE				(0x0u << 5)
#define DMA_LISR_TCIF0_COMPLETE					(0x1u << 5)
	/* Stream x half transfer interrupt flag */
#define DMA_LISR_HTIF0						(1u << 4)
#define DMA_LISR_HTIF0_NOTHALF					(0x0u << 4)
#define DMA_LISR_HTIF0_HALF					(0x1u << 4)
	/* Stream x transfer error interrupt flag */
#define DMA_LISR_TEIF0						(1u << 3)
#define DMA_LISR_TEIF0_NOERROR					(0x0u << 3)
#define DMA_LISR_TEIF0_ERROR					(0x1u << 3)
	/* Stream x direct mode error interrupt */
#define DMA_LISR_DMEIF0						(1u << 2)
#define DMA_LISR_DMEIF0_NOERROR					(0x0u << 2)
#define DMA_LISR_DMEIF0_ERROR					(0x1u << 2)
	/* Stream x FIFO error interrupt flag */
#define DMA_LISR_FEIF0						(1u << 0)
#define DMA_LISR_FEIF0_NOERROR					(0x0u << 0)
#define DMA_LISR_FEIF0_ERROR					(0x1u << 0)

	/* 0x04: high interrupt status register */
	uint32_t volatile const HISR;
	/* Stream x transfer complete interrupt */
#define DMA_HISR_TCIF7						(1u << 27)
	/* Stream x half transfer interrupt flag */
#define DMA_HISR_HTIF7						(1u << 26)
	/* Stream x transfer error interrupt flag */
#define DMA_HISR_TEIF7						(1u << 25)
	/* Stream x direct mode error interrupt */
#define DMA_HISR_DMEIF7						(1u << 24)
	/* Stream x FIFO error interrupt flag */
#define DMA_HISR_FEIF7						(1u << 22)
	/* Stream x transfer complete interrupt */
#define DMA_HISR_TCIF6						(1u << 21)
	/* Stream x half transfer interrupt flag */
#define DMA_HISR_HTIF6						(1u << 20)
	/* Stream x transfer error interrupt flag */
#define DMA_HISR_TEIF6						(1u << 19)
	/* Stream x direct mode error interrupt */
#define DMA_HISR_DMEIF6						(1u << 18)
	/* Stream x FIFO error interrupt flag */
#define DMA_HISR_FEIF6						(1u << 16)
	/* Stream x transfer complete interrupt */
#define DMA_HISR_TCIF5						(1u << 11)
	/* Stream x half transfer interrupt flag */
#define DMA_HISR_HTIF5						(1u << 10)
	/* Stream x transfer error interrupt flag */
#define DMA_HISR_TEIF5						(1u << 9)
	/* Stream x direct mode error interrupt */
#define DMA_HISR_DMEIF5						(1u << 8)
	/* Stream x FIFO error interrupt flag */
#define DMA_HISR_FEIF5						(1u << 6)
	/* Stream x transfer complete interrupt */
#define DMA_HISR_TCIF4						(1u << 5)
#define DMA_HISR_TCIF4_NOTCOMPLETE				(0x0u << 5)
#define DMA_HISR_TCIF4_COMPLETE					(0x1u << 5)
	/* Stream x half transfer interrupt flag */
#define DMA_HISR_HTIF4						(1u << 4)
#define DMA_HISR_HTIF4_NOTHALF					(0x0u << 4)
#define DMA_HISR_HTIF4_HALF					(0x1u << 4)
	/* Stream x transfer error interrupt flag */
#define DMA_HISR_TEIF4						(1u << 3)
#define DMA_HISR_TEIF4_NOERROR					(0x0u << 3)
#define DMA_HISR_TEIF4_ERROR					(0x1u << 3)
	/* Stream x direct mode error interrupt */
#define DMA_HISR_DMEIF4						(1u << 2)
#define DMA_HISR_DMEIF4_NOERROR					(0x0u << 2)
#define DMA_HISR_DMEIF4_ERROR					(0x1u << 2)
	/* Stream x FIFO error interrupt flag */
#define DMA_HISR_FEIF4						(1u << 0)
#define DMA_HISR_FEIF4_NOERROR					(0x0u << 0)
#define DMA_HISR_FEIF4_ERROR					(0x1u << 0)

