josuah/mcu-stm32f411/registers.h
	/* 0x08: low interrupt flag clear */
	uint32_t volatile LIFCR;
	/* Stream x clear transfer complete */
#define DMA_LIFCR_CTCIF3					(1u << 27)
	/* Stream x clear half transfer interrupt */
#define DMA_LIFCR_CHTIF3					(1u << 26)
	/* Stream x clear transfer error interrupt */
#define DMA_LIFCR_CTEIF3					(1u << 25)
	/* Stream x clear direct mode error */
#define DMA_LIFCR_CDMEIF3					(1u << 24)
	/* Stream x clear FIFO error interrupt flag */
#define DMA_LIFCR_CFEIF3					(1u << 22)
	/* Stream x clear transfer complete */
#define DMA_LIFCR_CTCIF2					(1u << 21)
	/* Stream x clear half transfer interrupt */
#define DMA_LIFCR_CHTIF2					(1u << 20)
	/* Stream x clear transfer error interrupt */
#define DMA_LIFCR_CTEIF2					(1u << 19)
	/* Stream x clear direct mode error */
#define DMA_LIFCR_CDMEIF2					(1u << 18)
	/* Stream x clear FIFO error interrupt flag */
#define DMA_LIFCR_CFEIF2					(1u << 16)
	/* Stream x clear transfer complete */
#define DMA_LIFCR_CTCIF1					(1u << 11)
	/* Stream x clear half transfer interrupt */
#define DMA_LIFCR_CHTIF1					(1u << 10)
	/* Stream x clear transfer error interrupt */
#define DMA_LIFCR_CTEIF1					(1u << 9)
	/* Stream x clear direct mode error */
#define DMA_LIFCR_CDMEIF1					(1u << 8)
	/* Stream x clear FIFO error interrupt flag */
#define DMA_LIFCR_CFEIF1					(1u << 6)
	/* Stream x clear transfer complete */
#define DMA_LIFCR_CTCIF0					(1u << 5)
#define DMA_LIFCR_CTCIF0_CLEAR					(0x1u << 5)
	/* Stream x clear half transfer interrupt */
#define DMA_LIFCR_CHTIF0					(1u << 4)
#define DMA_LIFCR_CHTIF0_CLEAR					(0x1u << 4)
	/* Stream x clear transfer error interrupt */
#define DMA_LIFCR_CTEIF0					(1u << 3)
#define DMA_LIFCR_CTEIF0_CLEAR					(0x1u << 3)
	/* Stream x clear direct mode error */
#define DMA_LIFCR_CDMEIF0					(1u << 2)
#define DMA_LIFCR_CDMEIF0_CLEAR					(0x1u << 2)
	/* Stream x clear FIFO error interrupt flag */
#define DMA_LIFCR_CFEIF0					(1u << 0)
#define DMA_LIFCR_CFEIF0_CLEAR					(0x1u << 0)

	/* 0x0C: high interrupt flag clear */
	uint32_t volatile HIFCR;
	/* Stream x clear transfer complete */
#define DMA_HIFCR_CTCIF7					(1u << 27)
	/* Stream x clear half transfer interrupt */
#define DMA_HIFCR_CHTIF7					(1u << 26)
	/* Stream x clear transfer error interrupt */
#define DMA_HIFCR_CTEIF7					(1u << 25)
	/* Stream x clear direct mode error */
#define DMA_HIFCR_CDMEIF7					(1u << 24)
	/* Stream x clear FIFO error interrupt flag */
#define DMA_HIFCR_CFEIF7					(1u << 22)
	/* Stream x clear transfer complete */
#define DMA_HIFCR_CTCIF6					(1u << 21)
	/* Stream x clear half transfer interrupt */
#define DMA_HIFCR_CHTIF6					(1u << 20)
	/* Stream x clear transfer error interrupt */
#define DMA_HIFCR_CTEIF6					(1u << 19)
	/* Stream x clear direct mode error */
#define DMA_HIFCR_CDMEIF6					(1u << 18)
	/* Stream x clear FIFO error interrupt flag */
#define DMA_HIFCR_CFEIF6					(1u << 16)
	/* Stream x clear transfer complete */
#define DMA_HIFCR_CTCIF5					(1u << 11)
	/* Stream x clear half transfer interrupt */
#define DMA_HIFCR_CHTIF5					(1u << 10)
	/* Stream x clear transfer error interrupt */
#define DMA_HIFCR_CTEIF5					(1u << 9)
	/* Stream x clear direct mode error */
#define DMA_HIFCR_CDMEIF5					(1u << 8)
	/* Stream x clear FIFO error interrupt flag */
#define DMA_HIFCR_CFEIF5					(1u << 6)
	/* Stream x clear transfer complete */
#define DMA_HIFCR_CTCIF4					(1u << 5)
#define DMA_HIFCR_CTCIF4_CLEAR					(0x1u << 5)
	/* Stream x clear half transfer interrupt */
#define DMA_HIFCR_CHTIF4					(1u << 4)
#define DMA_HIFCR_CHTIF4_CLEAR					(0x1u << 4)
	/* Stream x clear transfer error interrupt */
#define DMA_HIFCR_CTEIF4					(1u << 3)
#define DMA_HIFCR_CTEIF4_CLEAR					(0x1u << 3)
	/* Stream x clear direct mode error */
#define DMA_HIFCR_CDMEIF4					(1u << 2)
#define DMA_HIFCR_CDMEIF4_CLEAR					(0x1u << 2)
	/* Stream x clear FIFO error interrupt flag */
#define DMA_HIFCR_CFEIF4					(1u << 0)
#define DMA_HIFCR_CFEIF4_CLEAR					(0x1u << 0)

};


#define GPIOA ((struct mcu_gpio *)0x40020000)
#define GPIOB ((struct mcu_gpio *)0x40020400)
#define GPIOC ((struct mcu_gpio *)0x40020800)
#define GPIOD ((struct mcu_gpio *)0x00000000)
#define GPIOE ((struct mcu_gpio *)0x40021000)
#define GPIOH ((struct mcu_gpio *)0x40021C00)

struct mcu_gpio {

	/* 0x00: GPIO port mode register */
	uint32_t volatile MODER;
	/* Port x configuration bits */
#define GPIO_MODER_MODER_Msk(pin)				(0x3u << (pin) * 2)
#define GPIO_MODER_MODER_Pos(pin)				((pin) * 2)
#define GPIO_MODER_MODER_INPUT(pin)				(0x0u << (pin) * 2)
#define GPIO_MODER_MODER_OUTPUT(pin)				(0x1u << (pin) * 2)
#define GPIO_MODER_MODER_ALTERNATE(pin)				(0x2u << (pin) * 2)
#define GPIO_MODER_MODER_ANALOG(pin)				(0x3u << (pin) * 2)

	/* 0x04: GPIO port output type register */
	uint32_t volatile OTYPER;
	/* Port x configuration bits */
#define GPIO_OTYPER_OT(pin)					(1u << (pin))

	/* 0x08: GPIO port output speed */
	uint32_t volatile OSPEEDR;
	/* Port x configuration bits */
#define GPIO_OSPEEDR_OSPEEDR_Msk(pin)				(0x3u << (pin) * 2)
#define GPIO_OSPEEDR_OSPEEDR_Pos(pin)				((pin) * 2)
#define GPIO_OSPEEDR_OSPEEDR_LOWSPEED(pin)			(0x0u << (pin) * 2)
#define GPIO_OSPEEDR_OSPEEDR_MEDIUMSPEED(pin)			(0x1u << (pin) * 2)
#define GPIO_OSPEEDR_OSPEEDR_HIGHSPEED(pin)			(0x2u << (pin) * 2)
#define GPIO_OSPEEDR_OSPEEDR_VERYHIGHSPEED(pin)			(0x3u << (pin) * 2)

	/* 0x0C: GPIO port pull-up/pull-down */
	uint32_t volatile PUPDR;
	/* Port x configuration bits */
#define GPIO_PUPDR_PUPDR_Msk(pin)				(0x3u << (pin) * 2)
#define GPIO_PUPDR_PUPDR_Pos(pin)				((pin) * 2)
#define GPIO_PUPDR_PUPDR_FLOATING(pin)				(0x0u << (pin) * 2)
#define GPIO_PUPDR_PUPDR_PULLUP(pin)				(0x1u << (pin) * 2)
#define GPIO_PUPDR_PUPDR_PULLDOWN(pin)				(0x2u << (pin) * 2)

	/* 0x10: GPIO port input data register */
	uint32_t volatile const IDR;
	/* Port input data */
#define GPIO_IDR_IDR(pin)					(1u << (pin))

	/* 0x14: GPIO port output data register */
	uint32_t volatile ODR;
	/* Port output data */
#define GPIO_ODR_ODR(pin)					(1u << (pin))

	/* 0x18: GPIO port bit set/reset */
	uint32_t volatile BSRR;
	/* Port x set bit y */
#define GPIO_BSRR_RESET(pin)					(0x1u << 16 + (pin))
	/* Port x set bit y */
#define GPIO_BSRR_SET(pin)					(0x1u << (pin))

	/* 0x1C: GPIO port configuration lock */
	uint32_t volatile LCKR;
	/* Port x lock bit y */
#define GPIO_LCKR_LCKK						(1u << 16)
#define GPIO_LCKR_LOCKED(pin)					(1u << (pin))

