josuah/mcu-stm32f411/registers.h
	/* 0x20: GPIO alternate function low */
	uint64_t volatile AFR;
	/* Alternate function selection for port x */
#define GPIO_AFR_AFR_Msk(pin)					(0xFu << (pin))
#define GPIO_AFR_AFR_Pos(pin)					(pin)

};


#define I2C1 ((struct mcu_i2c *)0x40005400)
#define I2C2 ((struct mcu_i2c *)0x40005800)
#define I2C3 ((struct mcu_i2c *)0x40005C00)

struct mcu_i2c {

	/* 0x00: Control register 1 */
	uint32_t volatile CR1;
	/* Software reset */
#define I2C_CR1_SWRST						(1u << 15)
#define I2C_CR1_SWRST_NOTRESET					(0x0u << 15)
#define I2C_CR1_SWRST_RESET					(0x1u << 15)
	/* SMBus alert */
#define I2C_CR1_ALERT						(1u << 13)
#define I2C_CR1_ALERT_RELEASE					(0x0u << 13)
#define I2C_CR1_ALERT_DRIVE					(0x1u << 13)
	/* Packet error checking */
#define I2C_CR1_PEC						(1u << 12)
	/* Acknowledge/PEC Position (for data */
#define I2C_CR1_POS						(1u << 11)
#define I2C_CR1_POS_CURRENT					(0x0u << 11)
#define I2C_CR1_POS_NEXT					(0x1u << 11)
	/* Acknowledge enable */
#define I2C_CR1_ACK						(1u << 10)
#define I2C_CR1_ACK_NAK						(0x0u << 10)
#define I2C_CR1_ACK_ACK						(0x1u << 10)
	/* Stop generation */
#define I2C_CR1_STOP						(1u << 9)
#define I2C_CR1_STOP_NOSTOP					(0x0u << 9)
#define I2C_CR1_STOP_STOP					(0x1u << 9)
	/* Start generation */
#define I2C_CR1_START						(1u << 8)
#define I2C_CR1_START_NOSTART					(0x0u << 8)
#define I2C_CR1_START_START					(0x1u << 8)
	/* Clock stretching disable (Slave */
#define I2C_CR1_NOSTRETCH					(1u << 7)
#define I2C_CR1_NOSTRETCH_ENABLED				(0x0u << 7)
#define I2C_CR1_NOSTRETCH_DISABLED				(0x1u << 7)
	/* General call enable */
#define I2C_CR1_ENGC						(1u << 6)
	/* PEC enable */
#define I2C_CR1_ENPEC						(1u << 5)
	/* ARP enable */
#define I2C_CR1_ENARP						(1u << 4)
	/* SMBus type */
#define I2C_CR1_SMBTYPE						(1u << 3)
#define I2C_CR1_SMBTYPE_DEVICE					(0x0u << 3)
#define I2C_CR1_SMBTYPE_HOST					(0x1u << 3)
	/* SMBus mode */
#define I2C_CR1_SMBUS						(1u << 1)
#define I2C_CR1_SMBUS_I2C					(0x0u << 1)
#define I2C_CR1_SMBUS_SMBUS					(0x1u << 1)
	/* Peripheral enable */
#define I2C_CR1_PE						(1u << 0)

	/* 0x04: Control register 2 */
	uint32_t volatile CR2;
	/* DMA last transfer */
#define I2C_CR2_LAST						(1u << 12)
#define I2C_CR2_LAST_NOTLAST					(0x0u << 12)
#define I2C_CR2_LAST_LAST					(0x1u << 12)
	/* DMA requests enable */
#define I2C_CR2_DMAEN						(1u << 11)
	/* Buffer interrupt enable */
#define I2C_CR2_ITBUFEN						(1u << 10)
	/* Event interrupt enable */
#define I2C_CR2_ITEVTEN						(1u << 9)
	/* Error interrupt enable */
#define I2C_CR2_ITERREN						(1u << 8)
	/* Peripheral clock frequency */
#define I2C_CR2_FREQ_Msk					(0x3Fu << 0)
#define I2C_CR2_FREQ_Pos					0

	/* 0x08: Own address register 1 */
	uint32_t volatile OAR1;
	/* Addressing mode (slave */
#define I2C_OAR1_ADDMODE					(1u << 15)
#define I2C_OAR1_ADDMODE_ADD7					(0x0u << 15)
#define I2C_OAR1_ADDMODE_ADD10					(0x1u << 15)
	/* Interface address */
#define I2C_OAR1_ADD_Msk					(0x3FFu << 0)
#define I2C_OAR1_ADD_Pos					0

	/* 0x0C: Own address register 2 */
	uint32_t volatile OAR2;
	/* Interface address */
#define I2C_OAR2_ADD2_Msk					(0x7Fu << 1)
#define I2C_OAR2_ADD2_Pos					1
	/* Dual addressing mode */
#define I2C_OAR2_ENDUAL						(1u << 0)
#define I2C_OAR2_ENDUAL_SINGLE					(0x0u << 0)
#define I2C_OAR2_ENDUAL_DUAL					(0x1u << 0)

	/* 0x10: Data register */
	uint32_t volatile DR;
	/* 8-bit data register */
#define I2C_DR_DR_Msk						(0xFFu << 0)
#define I2C_DR_DR_Pos						0

	/* 0x14: Status register 1 */
	uint32_t volatile SR1;
	/* SMBus alert */
#define I2C_SR1_SMBALERT					(1u << 15)
#define I2C_SR1_SMBALERT_NOALERT				(0x0u << 15)
#define I2C_SR1_SMBALERT_ALERT					(0x1u << 15)
	/* Timeout or Tlow error */
#define I2C_SR1_TIMEOUT						(1u << 14)
#define I2C_SR1_TIMEOUT_NOTIMEOUT				(0x0u << 14)
#define I2C_SR1_TIMEOUT_TIMEOUT					(0x1u << 14)
	/* PEC Error in reception */
#define I2C_SR1_PECERR						(1u << 12)
#define I2C_SR1_PECERR_NOERROR					(0x0u << 12)
#define I2C_SR1_PECERR_ERROR					(0x1u << 12)
	/* Overrun/Underrun */
#define I2C_SR1_OVR						(1u << 11)
#define I2C_SR1_OVR_NOOVERRUN					(0x0u << 11)
#define I2C_SR1_OVR_OVERRUN					(0x1u << 11)
	/* Acknowledge failure */
#define I2C_SR1_AF						(1u << 10)
#define I2C_SR1_AF_NOFAILURE					(0x0u << 10)
#define I2C_SR1_AF_FAILURE					(0x1u << 10)
	/* Arbitration lost (master */
#define I2C_SR1_ARLO						(1u << 9)
#define I2C_SR1_ARLO_NOLOST					(0x0u << 9)
#define I2C_SR1_ARLO_LOST					(0x1u << 9)
	/* Bus error */
#define I2C_SR1_BERR						(1u << 8)
#define I2C_SR1_BERR_NOERROR					(0x0u << 8)
#define I2C_SR1_BERR_ERROR					(0x1u << 8)
	/* Data register empty */
#define I2C_SR1_TXE						(1u << 7)
#define I2C_SR1_TXE_NOTEMPTY					(0x0u << 7)
#define I2C_SR1_TXE_EMPTY					(0x1u << 7)
	/* Data register not empty */
#define I2C_SR1_RXNE						(1u << 6)
#define I2C_SR1_RXNE_EMPTY					(0x0u << 6)
#define I2C_SR1_RXNE_NOTEMPTY					(0x1u << 6)
	/* Stop detection (slave */
#define I2C_SR1_STOPF						(1u << 4)
#define I2C_SR1_STOPF_NOSTOP					(0x0u << 4)
#define I2C_SR1_STOPF_STOP					(0x1u << 4)
	/* 10-bit header sent (Master */
#define I2C_SR1_ADD10						(1u << 3)
	/* Byte transfer finished */
#define I2C_SR1_BTF						(1u << 2)
#define I2C_SR1_BTF_NOTFINISHED					(0x0u << 2)
#define I2C_SR1_BTF_FINISHED					(0x1u << 2)
	/* Address sent (master mode)/matched */
#define I2C_SR1_ADDR						(1u << 1)
#define I2C_SR1_ADDR_NOTMATCH					(0x0u << 1)
#define I2C_SR1_ADDR_MATCH					(0x1u << 1)
	/* Start bit (Master mode) */
#define I2C_SR1_SB						(1u << 0)
#define I2C_SR1_SB_NOSTART					(0x0u << 0)
#define I2C_SR1_SB_START					(0x1u << 0)

	/* 0x18: Status register 2 */
	uint32_t volatile const SR2;
	/* acket error checking */
#define I2C_SR2_PEC_Msk						(0xFFu << 8)
#define I2C_SR2_PEC_Pos						8
	/* Dual flag (Slave mode) */
#define I2C_SR2_DUALF						(1u << 7)
	/* SMBus host header (Slave */
#define I2C_SR2_SMBHOST						(1u << 6)
	/* SMBus device default address (Slave */
#define I2C_SR2_SMBDEFAULT					(1u << 5)
	/* General call address (Slave */
#define I2C_SR2_GENCALL						(1u << 4)
	/* Transmitter/receiver */
#define I2C_SR2_TRA						(1u << 2)
	/* Bus busy */
#define I2C_SR2_BUSY						(1u << 1)
	/* Master/slave */
#define I2C_SR2_MSL						(1u << 0)

	/* 0x1C: Clock control register */
	uint32_t volatile CCR;
	/* I2C master mode selection */
#define I2C_CCR_F_S						(1u << 15)
#define I2C_CCR_F_S_STANDARD					(0x0u << 15)
#define I2C_CCR_F_S_FAST					(0x1u << 15)
	/* Fast mode duty cycle */
#define I2C_CCR_DUTY						(1u << 14)
#define I2C_CCR_DUTY_DUTY2_1					(0x0u << 14)
#define I2C_CCR_DUTY_DUTY16_9					(0x1u << 14)
	/* Clock control register in Fast/Standard */
#define I2C_CCR_CCR_Msk						(0xFFFu << 0)
#define I2C_CCR_CCR_Pos						0

	/* 0x20: TRISE register */
	uint32_t volatile TRISE;
	/* Maximum rise time in Fast/Standard mode */
#define I2C_TRISE_TRISE_Msk					(0x3Fu << 0)
#define I2C_TRISE_TRISE_Pos					0

	/* 0x24: FLTR register */
	uint32_t volatile FLTR;
	/* Analog noise filter */
#define I2C_FLTR_ANOFF						(1u << 4)
#define I2C_FLTR_ANOFF_ENABLED					(0x0u << 4)
#define I2C_FLTR_ANOFF_DISABLED					(0x1u << 4)
	/* Digital noise filter */
#define I2C_FLTR_DNF_Msk					(0xFu << 0)
#define I2C_FLTR_DNF_Pos					0
#define I2C_FLTR_DNF_NOFILTER					(0x0u << 0)
#define I2C_FLTR_DNF_FILTER1					(0x1u << 0)
#define I2C_FLTR_DNF_FILTER2					(0x2u << 0)
#define I2C_FLTR_DNF_FILTER3					(0x3u << 0)
#define I2C_FLTR_DNF_FILTER4					(0x4u << 0)
#define I2C_FLTR_DNF_FILTER5					(0x5u << 0)
#define I2C_FLTR_DNF_FILTER6					(0x6u << 0)
#define I2C_FLTR_DNF_FILTER7					(0x7u << 0)
#define I2C_FLTR_DNF_FILTER8					(0x8u << 0)
#define I2C_FLTR_DNF_FILTER9					(0x9u << 0)
#define I2C_FLTR_DNF_FILTER10					(0xAu << 0)
#define I2C_FLTR_DNF_FILTER11					(0xBu << 0)
#define I2C_FLTR_DNF_FILTER12					(0xCu << 0)
#define I2C_FLTR_DNF_FILTER13					(0xDu << 0)
#define I2C_FLTR_DNF_FILTER14					(0xEu << 0)
#define I2C_FLTR_DNF_FILTER15					(0xFu << 0)

