josuah/mcu-stm32f411/registers.h
};


#define I2S2EXT ((struct mcu_i2s2ext *)0x40003400)
#define I2S3EXT ((struct mcu_i2s3ext *)0x40004000)


#define SPI1 ((struct mcu_spi *)0x40013000)
#define SPI2 ((struct mcu_spi *)0x40003800)
#define SPI3 ((struct mcu_spi *)0x40003C00)
#define SPI4 ((struct mcu_spi *)0x40013400)
#define SPI5 ((struct mcu_spi *)0x40015000)

struct mcu_spi {

	/* 0x00: control register 1 */
	uint32_t volatile CR1;
	/* Bidirectional data mode */
#define SPI_CR1_BIDIMODE					(1u << 15)
#define SPI_CR1_BIDIMODE_UNIDIRECTIONAL				(0x0u << 15)
#define SPI_CR1_BIDIMODE_BIDIRECTIONAL				(0x1u << 15)
	/* Output enable in bidirectional */
#define SPI_CR1_BIDIOE						(1u << 14)
#define SPI_CR1_BIDIOE_OUTPUTDISABLED				(0x0u << 14)
#define SPI_CR1_BIDIOE_OUTPUTENABLED				(0x1u << 14)
	/* Hardware CRC calculation */
#define SPI_CR1_CRCEN						(1u << 13)
	/* CRC transfer next */
#define SPI_CR1_CRCNEXT						(1u << 12)
#define SPI_CR1_CRCNEXT_TXBUFFER				(0x0u << 12)
#define SPI_CR1_CRCNEXT_CRC					(0x1u << 12)
	/* Data frame format */
#define SPI_CR1_DFF						(1u << 11)
#define SPI_CR1_DFF_EIGHTBIT					(0x0u << 11)
#define SPI_CR1_DFF_SIXTEENBIT					(0x1u << 11)
	/* Receive only */
#define SPI_CR1_RXONLY						(1u << 10)
#define SPI_CR1_RXONLY_FULLDUPLEX				(0x0u << 10)
#define SPI_CR1_RXONLY_OUTPUTDISABLED				(0x1u << 10)
	/* Software slave management */
#define SPI_CR1_SSM						(1u << 9)
	/* Internal slave select */
#define SPI_CR1_SSI						(1u << 8)
#define SPI_CR1_SSI_SLAVESELECTED				(0x0u << 8)
#define SPI_CR1_SSI_SLAVENOTSELECTED				(0x1u << 8)
	/* Frame format */
#define SPI_CR1_LSBFIRST					(1u << 7)
#define SPI_CR1_LSBFIRST_MSBFIRST				(0x0u << 7)
#define SPI_CR1_LSBFIRST_LSBFIRST				(0x1u << 7)
	/* SPI enable */
#define SPI_CR1_SPE						(1u << 6)
	/* Baud rate control */
#define SPI_CR1_BR_Msk						(0x7u << 3)
#define SPI_CR1_BR_Pos						3
#define SPI_CR1_BR_DIV2						(0x0u << 3)
#define SPI_CR1_BR_DIV4						(0x1u << 3)
#define SPI_CR1_BR_DIV8						(0x2u << 3)
#define SPI_CR1_BR_DIV16					(0x3u << 3)
#define SPI_CR1_BR_DIV32					(0x4u << 3)
#define SPI_CR1_BR_DIV64					(0x5u << 3)
#define SPI_CR1_BR_DIV128					(0x6u << 3)
#define SPI_CR1_BR_DIV256					(0x7u << 3)
	/* Master selection */
#define SPI_CR1_MSTR						(1u << 2)
#define SPI_CR1_MSTR_SLAVE					(0x0u << 2)
#define SPI_CR1_MSTR_MASTER					(0x1u << 2)
	/* Clock polarity */
#define SPI_CR1_CPOL						(1u << 1)
#define SPI_CR1_CPOL_IDLELOW					(0x0u << 1)
#define SPI_CR1_CPOL_IDLEHIGH					(0x1u << 1)
	/* Clock phase */
#define SPI_CR1_CPHA						(1u << 0)
#define SPI_CR1_CPHA_FIRSTEDGE					(0x0u << 0)
#define SPI_CR1_CPHA_SECONDEDGE					(0x1u << 0)

	/* 0x04: control register 2 */
	uint32_t volatile CR2;
	/* Tx buffer empty interrupt */
#define SPI_CR2_TXEIE						(1u << 7)
#define SPI_CR2_TXEIE_MASKED					(0x0u << 7)
#define SPI_CR2_TXEIE_NOTMASKED					(0x1u << 7)
	/* RX buffer not empty interrupt */
#define SPI_CR2_RXNEIE						(1u << 6)
#define SPI_CR2_RXNEIE_MASKED					(0x0u << 6)
#define SPI_CR2_RXNEIE_NOTMASKED				(0x1u << 6)
	/* Error interrupt enable */
#define SPI_CR2_ERRIE						(1u << 5)
#define SPI_CR2_ERRIE_MASKED					(0x0u << 5)
#define SPI_CR2_ERRIE_NOTMASKED					(0x1u << 5)
	/* Frame format */
#define SPI_CR2_FRF						(1u << 4)
#define SPI_CR2_FRF_MOTOROLA					(0x0u << 4)
#define SPI_CR2_FRF_TI						(0x1u << 4)
	/* SS output enable */
#define SPI_CR2_SSOE						(1u << 2)
	/* Tx buffer DMA enable */
#define SPI_CR2_TXDMAEN						(1u << 1)
	/* Rx buffer DMA enable */
#define SPI_CR2_RXDMAEN						(1u << 0)

	/* 0x08: status register */
	uint32_t volatile SR;
	/* TI frame format error */
#define SPI_SR_FRE						(1u << 8)
#define SPI_SR_FRE_NOERROR					(0x0u << 8)
#define SPI_SR_FRE_ERROR					(0x1u << 8)
	/* Busy flag */
#define SPI_SR_BSY						(1u << 7)
#define SPI_SR_BSY_NOTBUSY					(0x0u << 7)
#define SPI_SR_BSY_BUSY						(0x1u << 7)
	/* Overrun flag */
#define SPI_SR_OVR						(1u << 6)
#define SPI_SR_OVR_NOOVERRUN					(0x0u << 6)
#define SPI_SR_OVR_OVERRUN					(0x1u << 6)
	/* Mode fault */
#define SPI_SR_MODF						(1u << 5)
#define SPI_SR_MODF_NOFAULT					(0x0u << 5)
#define SPI_SR_MODF_FAULT					(0x1u << 5)
	/* CRC error flag */
#define SPI_SR_CRCERR						(1u << 4)
#define SPI_SR_CRCERR_MATCH					(0x0u << 4)
#define SPI_SR_CRCERR_NOMATCH					(0x1u << 4)
	/* Underrun flag */
#define SPI_SR_UDR						(1u << 3)
#define SPI_SR_UDR_NOUNDERRUN					(0x0u << 3)
#define SPI_SR_UDR_UNDERRUN					(0x1u << 3)
	/* Channel side */
#define SPI_SR_CHSIDE						(1u << 2)
#define SPI_SR_CHSIDE_LEFT					(0x0u << 2)
#define SPI_SR_CHSIDE_RIGHT					(0x1u << 2)
	/* Transmit buffer empty */
#define SPI_SR_TXE						(1u << 1)
#define SPI_SR_TXE_NOTEMPTY					(0x0u << 1)
#define SPI_SR_TXE_EMPTY					(0x1u << 1)
	/* Receive buffer not empty */
#define SPI_SR_RXNE						(1u << 0)
#define SPI_SR_RXNE_EMPTY					(0x0u << 0)
#define SPI_SR_RXNE_NOTEMPTY					(0x1u << 0)

	/* 0x0C: data register */
	uint32_t volatile DR;
	/* Data register */
#define SPI_DR_DR_Msk						(0xFFFFu << 0)
#define SPI_DR_DR_Pos						0

	/* 0x10: CRC polynomial register */
	uint32_t volatile CRCPR;
	/* CRC polynomial register */
#define SPI_CRCPR_CRCPOLY_Msk					(0xFFFFu << 0)
#define SPI_CRCPR_CRCPOLY_Pos					0

	/* 0x14: RX CRC register */
	uint32_t volatile const RXCRCR;
	/* Rx CRC register */
#define SPI_RXCRCR_RXCRC_Msk					(0xFFFFu << 0)
#define SPI_RXCRCR_RXCRC_Pos					0

	/* 0x18: TX CRC register */
	uint32_t volatile const TXCRCR;
	/* Tx CRC register */
#define SPI_TXCRCR_TXCRC_Msk					(0xFFFFu << 0)
#define SPI_TXCRCR_TXCRC_Pos					0

	/* 0x1C: I2S configuration register */
	uint32_t volatile I2SCFGR;
	/* I2S mode selection */
#define SPI_I2SCFGR_I2SMOD					(1u << 11)
#define SPI_I2SCFGR_I2SMOD_SPIMODE				(0x0u << 11)
#define SPI_I2SCFGR_I2SMOD_I2SMODE				(0x1u << 11)
	/* I2S Enable */
#define SPI_I2SCFGR_I2SE					(1u << 10)
	/* I2S configuration mode */
#define SPI_I2SCFGR_I2SCFG_Msk					(0x3u << 8)
#define SPI_I2SCFGR_I2SCFG_Pos					8
#define SPI_I2SCFGR_I2SCFG_SLAVETX				(0x0u << 8)
#define SPI_I2SCFGR_I2SCFG_SLAVERX				(0x1u << 8)
#define SPI_I2SCFGR_I2SCFG_MASTERTX				(0x2u << 8)
#define SPI_I2SCFGR_I2SCFG_MASTERRX				(0x3u << 8)
	/* PCM frame synchronization */
#define SPI_I2SCFGR_PCMSYNC					(1u << 7)
#define SPI_I2SCFGR_PCMSYNC_SHORT				(0x0u << 7)
#define SPI_I2SCFGR_PCMSYNC_LONG				(0x1u << 7)
	/* I2S standard selection */
#define SPI_I2SCFGR_I2SSTD_Msk					(0x3u << 4)
#define SPI_I2SCFGR_I2SSTD_Pos					4
#define SPI_I2SCFGR_I2SSTD_PHILIPS				(0x0u << 4)
#define SPI_I2SCFGR_I2SSTD_MSB					(0x1u << 4)
#define SPI_I2SCFGR_I2SSTD_LSB					(0x2u << 4)
#define SPI_I2SCFGR_I2SSTD_PCM					(0x3u << 4)
	/* Steady state clock */
#define SPI_I2SCFGR_CKPOL					(1u << 3)
#define SPI_I2SCFGR_CKPOL_IDLELOW				(0x0u << 3)
#define SPI_I2SCFGR_CKPOL_IDLEHIGH				(0x1u << 3)
	/* Data length to be */
#define SPI_I2SCFGR_DATLEN_Msk					(0x3u << 1)
#define SPI_I2SCFGR_DATLEN_Pos					1
#define SPI_I2SCFGR_DATLEN_SIXTEENBIT				(0x0u << 1)
#define SPI_I2SCFGR_DATLEN_TWENTYFOURBIT			(0x1u << 1)
#define SPI_I2SCFGR_DATLEN_THIRTYTWOBIT				(0x2u << 1)
	/* Channel length (number of bits per audio */
#define SPI_I2SCFGR_CHLEN					(1u << 0)
#define SPI_I2SCFGR_CHLEN_SIXTEENBIT				(0x0u << 0)
#define SPI_I2SCFGR_CHLEN_THIRTYTWOBIT				(0x1u << 0)

	/* 0x20: I2S prescaler register */
	uint32_t volatile I2SPR;
	/* Master clock output enable */
#define SPI_I2SPR_MCKOE						(1u << 9)
	/* Odd factor for the */
#define SPI_I2SPR_ODD						(1u << 8)
#define SPI_I2SPR_ODD_EVEN					(0x0u << 8)
#define SPI_I2SPR_ODD_ODD					(0x1u << 8)
	/* I2S Linear prescaler */
#define SPI_I2SPR_I2SDIV_Msk					(0xFFu << 0)
#define SPI_I2SPR_I2SDIV_Pos					0

