josuah/mcu-stm32f411/registers.h
};


#define NVIC ((struct mcu_nvic *)0xE000E100)

struct mcu_nvic {

	/* 0x00: Interrupt Set-Enable Register */
	uint32_t volatile ISER0;
	/* SETENA */
#define NVIC_ISER0_SETENA_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ISER0_SETENA_Pos					0

	/* 0x04: Interrupt Set-Enable Register */
	uint32_t volatile ISER1;
	/* SETENA */
#define NVIC_ISER1_SETENA_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ISER1_SETENA_Pos					0

	/* 0x08: Interrupt Set-Enable Register */
	uint32_t volatile ISER2;
	/* SETENA */
#define NVIC_ISER2_SETENA_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ISER2_SETENA_Pos					0

	/* 0x0C */
	uint8_t RESERVED0[0x80u-0x0Cu];

	/* 0x80: Interrupt Clear-Enable */
	uint32_t volatile ICER0;
	/* CLRENA */
#define NVIC_ICER0_CLRENA_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ICER0_CLRENA_Pos					0

	/* 0x84: Interrupt Clear-Enable */
	uint32_t volatile ICER1;
	/* CLRENA */
#define NVIC_ICER1_CLRENA_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ICER1_CLRENA_Pos					0

	/* 0x88: Interrupt Clear-Enable */
	uint32_t volatile ICER2;
	/* CLRENA */
#define NVIC_ICER2_CLRENA_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ICER2_CLRENA_Pos					0

	/* 0x8C */
	uint8_t RESERVED1[0x100u-0x8Cu];

	/* 0x100: Interrupt Set-Pending Register */
	uint32_t volatile ISPR0;
	/* SETPEND */
#define NVIC_ISPR0_SETPEND_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ISPR0_SETPEND_Pos					0

	/* 0x104: Interrupt Set-Pending Register */
	uint32_t volatile ISPR1;
	/* SETPEND */
#define NVIC_ISPR1_SETPEND_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ISPR1_SETPEND_Pos					0

	/* 0x108: Interrupt Set-Pending Register */
	uint32_t volatile ISPR2;
	/* SETPEND */
#define NVIC_ISPR2_SETPEND_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ISPR2_SETPEND_Pos					0

	/* 0x10C */
	uint8_t RESERVED2[0x180u-0x10Cu];

	/* 0x180: Interrupt Clear-Pending */
	uint32_t volatile ICPR0;
	/* CLRPEND */
#define NVIC_ICPR0_CLRPEND_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ICPR0_CLRPEND_Pos					0

	/* 0x184: Interrupt Clear-Pending */
	uint32_t volatile ICPR1;
	/* CLRPEND */
#define NVIC_ICPR1_CLRPEND_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ICPR1_CLRPEND_Pos					0

	/* 0x188: Interrupt Clear-Pending */
	uint32_t volatile ICPR2;
	/* CLRPEND */
#define NVIC_ICPR2_CLRPEND_Msk					(0xFFFFFFFFu << 0)
#define NVIC_ICPR2_CLRPEND_Pos					0

	/* 0x18C */
	uint8_t RESERVED3[0x200u-0x18Cu];

	/* 0x200: Interrupt Active Bit Register */
	uint32_t volatile const IABR0;
	/* ACTIVE */
#define NVIC_IABR0_ACTIVE_Msk					(0xFFFFFFFFu << 0)
#define NVIC_IABR0_ACTIVE_Pos					0

	/* 0x204: Interrupt Active Bit Register */
	uint32_t volatile const IABR1;
	/* ACTIVE */
#define NVIC_IABR1_ACTIVE_Msk					(0xFFFFFFFFu << 0)
#define NVIC_IABR1_ACTIVE_Pos					0

	/* 0x208: Interrupt Active Bit Register */
	uint32_t volatile const IABR2;
	/* ACTIVE */
#define NVIC_IABR2_ACTIVE_Msk					(0xFFFFFFFFu << 0)
#define NVIC_IABR2_ACTIVE_Pos					0

	/* 0x20C */
	uint8_t RESERVED4[0x300u-0x20Cu];

	/* 0x300: Interrupt Priority Register */
	uint32_t volatile IPR0;
	/* IPR_N0 */
#define NVIC_IPR0_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR0_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR0_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR0_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR0_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR0_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR0_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR0_IPR_N3_Pos					24

	/* 0x304: Interrupt Priority Register */
	uint32_t volatile IPR1;
	/* IPR_N0 */
#define NVIC_IPR1_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR1_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR1_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR1_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR1_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR1_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR1_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR1_IPR_N3_Pos					24

	/* 0x308: Interrupt Priority Register */
	uint32_t volatile IPR2;
	/* IPR_N0 */
#define NVIC_IPR2_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR2_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR2_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR2_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR2_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR2_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR2_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR2_IPR_N3_Pos					24

	/* 0x30C: Interrupt Priority Register */
	uint32_t volatile IPR3;
	/* IPR_N0 */
#define NVIC_IPR3_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR3_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR3_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR3_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR3_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR3_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR3_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR3_IPR_N3_Pos					24

	/* 0x310: Interrupt Priority Register */
	uint32_t volatile IPR4;
	/* IPR_N0 */
#define NVIC_IPR4_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR4_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR4_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR4_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR4_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR4_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR4_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR4_IPR_N3_Pos					24

	/* 0x314: Interrupt Priority Register */
	uint32_t volatile IPR5;
	/* IPR_N0 */
#define NVIC_IPR5_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR5_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR5_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR5_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR5_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR5_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR5_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR5_IPR_N3_Pos					24

	/* 0x318: Interrupt Priority Register */
	uint32_t volatile IPR6;
	/* IPR_N0 */
#define NVIC_IPR6_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR6_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR6_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR6_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR6_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR6_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR6_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR6_IPR_N3_Pos					24

	/* 0x31C: Interrupt Priority Register */
	uint32_t volatile IPR7;
	/* IPR_N0 */
#define NVIC_IPR7_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR7_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR7_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR7_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR7_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR7_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR7_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR7_IPR_N3_Pos					24

	/* 0x320: Interrupt Priority Register */
	uint32_t volatile IPR8;
	/* IPR_N0 */
#define NVIC_IPR8_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR8_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR8_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR8_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR8_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR8_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR8_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR8_IPR_N3_Pos					24

	/* 0x324: Interrupt Priority Register */
	uint32_t volatile IPR9;
	/* IPR_N0 */
#define NVIC_IPR9_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR9_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR9_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR9_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR9_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR9_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR9_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR9_IPR_N3_Pos					24

