josuah/mcu-stm32f411/registers.h
	/* 0x328: Interrupt Priority Register */
	uint32_t volatile IPR10;
	/* IPR_N0 */
#define NVIC_IPR10_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR10_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR10_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR10_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR10_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR10_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR10_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR10_IPR_N3_Pos					24

	/* 0x32C: Interrupt Priority Register */
	uint32_t volatile IPR11;
	/* IPR_N0 */
#define NVIC_IPR11_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR11_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR11_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR11_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR11_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR11_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR11_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR11_IPR_N3_Pos					24

	/* 0x330: Interrupt Priority Register */
	uint32_t volatile IPR12;
	/* IPR_N0 */
#define NVIC_IPR12_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR12_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR12_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR12_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR12_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR12_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR12_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR12_IPR_N3_Pos					24

	/* 0x334: Interrupt Priority Register */
	uint32_t volatile IPR13;
	/* IPR_N0 */
#define NVIC_IPR13_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR13_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR13_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR13_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR13_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR13_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR13_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR13_IPR_N3_Pos					24

	/* 0x338: Interrupt Priority Register */
	uint32_t volatile IPR14;
	/* IPR_N0 */
#define NVIC_IPR14_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR14_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR14_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR14_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR14_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR14_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR14_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR14_IPR_N3_Pos					24

	/* 0x33C: Interrupt Priority Register */
	uint32_t volatile IPR15;
	/* IPR_N0 */
#define NVIC_IPR15_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR15_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR15_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR15_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR15_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR15_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR15_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR15_IPR_N3_Pos					24

	/* 0x340: Interrupt Priority Register */
	uint32_t volatile IPR16;
	/* IPR_N0 */
#define NVIC_IPR16_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR16_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR16_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR16_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR16_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR16_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR16_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR16_IPR_N3_Pos					24

	/* 0x344: Interrupt Priority Register */
	uint32_t volatile IPR17;
	/* IPR_N0 */
#define NVIC_IPR17_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR17_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR17_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR17_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR17_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR17_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR17_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR17_IPR_N3_Pos					24

	/* 0x348: Interrupt Priority Register */
	uint32_t volatile IPR18;
	/* IPR_N0 */
#define NVIC_IPR18_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR18_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR18_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR18_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR18_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR18_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR18_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR18_IPR_N3_Pos					24

	/* 0x34C: Interrupt Priority Register */
	uint32_t volatile IPR19;
	/* IPR_N0 */
#define NVIC_IPR19_IPR_N0_Msk					(0xFFu << 0)
#define NVIC_IPR19_IPR_N0_Pos					0
	/* IPR_N1 */
#define NVIC_IPR19_IPR_N1_Msk					(0xFFu << 8)
#define NVIC_IPR19_IPR_N1_Pos					8
	/* IPR_N2 */
#define NVIC_IPR19_IPR_N2_Msk					(0xFFu << 16)
#define NVIC_IPR19_IPR_N2_Pos					16
	/* IPR_N3 */
#define NVIC_IPR19_IPR_N3_Msk					(0xFFu << 24)
#define NVIC_IPR19_IPR_N3_Pos					24

};


#define FPU ((struct mcu_fpu *)0xE000EF34)

struct mcu_fpu {

	/* 0x00: Floating-point context control */
	uint32_t volatile FPCCR;
	/* LSPACT */
#define FPU_FPCCR_LSPACT					(1u << 0)
	/* USER */
#define FPU_FPCCR_USER						(1u << 1)
	/* THREAD */
#define FPU_FPCCR_THREAD					(1u << 3)
	/* HFRDY */
#define FPU_FPCCR_HFRDY						(1u << 4)
	/* MMRDY */
#define FPU_FPCCR_MMRDY						(1u << 5)
	/* BFRDY */
#define FPU_FPCCR_BFRDY						(1u << 6)
	/* MONRDY */
#define FPU_FPCCR_MONRDY					(1u << 8)
	/* LSPEN */
#define FPU_FPCCR_LSPEN						(1u << 30)
	/* ASPEN */
#define FPU_FPCCR_ASPEN						(1u << 31)

	/* 0x04: Floating-point context address */
	uint32_t volatile FPCAR;
	/* Location of unpopulated */
#define FPU_FPCAR_ADDRESS_Msk					(0x1FFFFFFFu << 3)
#define FPU_FPCAR_ADDRESS_Pos					3

	/* 0x08: Floating-point status control */
	uint32_t volatile FPSCR;
	/* Invalid operation cumulative exception */
#define FPU_FPSCR_IOC						(1u << 0)
	/* Division by zero cumulative exception */
#define FPU_FPSCR_DZC						(1u << 1)
	/* Overflow cumulative exception */
#define FPU_FPSCR_OFC						(1u << 2)
	/* Underflow cumulative exception */
#define FPU_FPSCR_UFC						(1u << 3)
	/* Inexact cumulative exception */
#define FPU_FPSCR_IXC						(1u << 4)
	/* Input denormal cumulative exception */
#define FPU_FPSCR_IDC						(1u << 7)
	/* Rounding Mode control */
#define FPU_FPSCR_RMODE_Msk					(0x3u << 22)
#define FPU_FPSCR_RMODE_Pos					22
	/* Flush-to-zero mode control */
#define FPU_FPSCR_FZ						(1u << 24)
	/* Default NaN mode control */
#define FPU_FPSCR_DN						(1u << 25)
	/* Alternative half-precision control */
#define FPU_FPSCR_AHP						(1u << 26)
	/* Overflow condition code */
#define FPU_FPSCR_V						(1u << 28)
	/* Carry condition code flag */
#define FPU_FPSCR_C						(1u << 29)
	/* Zero condition code flag */
#define FPU_FPSCR_Z						(1u << 30)
	/* Negative condition code */
#define FPU_FPSCR_N						(1u << 31)

