josuah/mcu-stm32f411/registers.h
};


#define MPU ((struct mcu_mpu *)0xE000ED90)

struct mcu_mpu {

	/* 0x00: MPU type register */
	uint32_t volatile const TYPER;
	/* Separate flag */
#define MPU_TYPER_SEPARATE					(1u << 0)
	/* Number of MPU data regions */
#define MPU_TYPER_DREGION_Msk					(0xFFu << 8)
#define MPU_TYPER_DREGION_Pos					8
	/* Number of MPU instruction */
#define MPU_TYPER_IREGION_Msk					(0xFFu << 16)
#define MPU_TYPER_IREGION_Pos					16

	/* 0x04: MPU control register */
	uint32_t volatile const CTRL;
	/* Enables the MPU */
#define MPU_CTRL_ENABLE						(1u << 0)
	/* Enables the operation of MPU during hard */
#define MPU_CTRL_HFNMIENA					(1u << 1)
	/* Enable priviliged software access to */
#define MPU_CTRL_PRIVDEFENA					(1u << 2)

	/* 0x08: MPU region number register */
	uint32_t volatile RNR;
	/* MPU region */
#define MPU_RNR_REGION_Msk					(0xFFu << 0)
#define MPU_RNR_REGION_Pos					0

	/* 0x0C: MPU region base address */
	uint32_t volatile RBAR;
	/* MPU region field */
#define MPU_RBAR_REGION_Msk					(0xFu << 0)
#define MPU_RBAR_REGION_Pos					0
	/* MPU region number valid */
#define MPU_RBAR_VALID						(1u << 4)
	/* Region base address field */
#define MPU_RBAR_ADDR_Msk					(0x7FFFFFFu << 5)
#define MPU_RBAR_ADDR_Pos					5

	/* 0x10: MPU region attribute and size */
	uint32_t volatile RASR;
	/* Region enable bit. */
#define MPU_RASR_ENABLE						(1u << 0)
	/* Size of the MPU protection */
#define MPU_RASR_SIZE_Msk					(0x1Fu << 1)
#define MPU_RASR_SIZE_Pos					1
	/* Subregion disable bits */
#define MPU_RASR_SRD_Msk					(0xFFu << 8)
#define MPU_RASR_SRD_Pos					8
	/* memory attribute */
#define MPU_RASR_B						(1u << 16)
	/* memory attribute */
#define MPU_RASR_C						(1u << 17)
	/* Shareable memory attribute */
#define MPU_RASR_S						(1u << 18)
	/* memory attribute */
#define MPU_RASR_TEX_Msk					(0x7u << 19)
#define MPU_RASR_TEX_Pos					19
	/* Access permission */
#define MPU_RASR_AP_Msk						(0x7u << 24)
#define MPU_RASR_AP_Pos						24
	/* Instruction access disable */
#define MPU_RASR_XN						(1u << 28)

};


#define STK ((struct mcu_stk *)0xE000E010)

struct mcu_stk {

	/* 0x00: SysTick control and status */
	uint32_t volatile CTRL;
	/* Counter enable */
#define STK_CTRL_ENABLE						(1u << 0)
	/* SysTick exception request */
#define STK_CTRL_TICKINT					(1u << 1)
	/* Clock source selection */
#define STK_CTRL_CLKSOURCE					(1u << 2)
	/* COUNTFLAG */
#define STK_CTRL_COUNTFLAG					(1u << 16)

	/* 0x04: SysTick reload value register */
	uint32_t volatile LOAD;
	/* RELOAD value */
#define STK_LOAD_RELOAD_Msk					(0xFFFFFFu << 0)
#define STK_LOAD_RELOAD_Pos					0

	/* 0x08: SysTick current value register */
	uint32_t volatile VAL;
	/* Current counter value */
#define STK_VAL_CURRENT_Msk					(0xFFFFFFu << 0)
#define STK_VAL_CURRENT_Pos					0

	/* 0x0C: SysTick calibration value */
	uint32_t volatile CALIB;
	/* Calibration value */
#define STK_CALIB_TENMS_Msk					(0xFFFFFFu << 0)
#define STK_CALIB_TENMS_Pos					0
	/* SKEW flag: Indicates whether the TENMS */
#define STK_CALIB_SKEW						(1u << 30)
	/* NOREF flag. */
#define STK_CALIB_NOREF						(1u << 31)

};


#define SCB ((struct mcu_scb *)0xE000ED00)

struct mcu_scb {

	/* 0x00: CPUID base register */
	uint32_t volatile const CPUID;
	/* Revision number */
#define SCB_CPUID_REVISION_Msk					(0xFu << 0)
#define SCB_CPUID_REVISION_Pos					0
	/* Part number of the */
#define SCB_CPUID_PARTNO_Msk					(0xFFFu << 4)
#define SCB_CPUID_PARTNO_Pos					4
	/* Reads as 0xF */
#define SCB_CPUID_CONSTANT_Msk					(0xFu << 16)
#define SCB_CPUID_CONSTANT_Pos					16
	/* Variant number */
#define SCB_CPUID_VARIANT_Msk					(0xFu << 20)
#define SCB_CPUID_VARIANT_Pos					20
	/* Implementer code */
#define SCB_CPUID_IMPLEMENTER_Msk				(0xFFu << 24)
#define SCB_CPUID_IMPLEMENTER_Pos				24

	/* 0x04: Interrupt control and state */
	uint32_t volatile ICSR;
	/* Active vector */
#define SCB_ICSR_VECTACTIVE_Msk					(0x1FFu << 0)
#define SCB_ICSR_VECTACTIVE_Pos					0
	/* Return to base level */
#define SCB_ICSR_RETTOBASE					(1u << 11)
	/* Pending vector */
#define SCB_ICSR_VECTPENDING_Msk				(0x7Fu << 12)
#define SCB_ICSR_VECTPENDING_Pos				12
	/* Interrupt pending flag */
#define SCB_ICSR_ISRPENDING					(1u << 22)
	/* SysTick exception clear-pending */
#define SCB_ICSR_PENDSTCLR					(1u << 25)
	/* SysTick exception set-pending */
#define SCB_ICSR_PENDSTSET					(1u << 26)
	/* PendSV clear-pending bit */
#define SCB_ICSR_PENDSVCLR					(1u << 27)
	/* PendSV set-pending bit */
#define SCB_ICSR_PENDSVSET					(1u << 28)
	/* NMI set-pending bit. */
#define SCB_ICSR_NMIPENDSET					(1u << 31)

	/* 0x08: Vector table offset register */
	uint32_t volatile VTOR;
	/* Vector table base offset */
#define SCB_VTOR_TBLOFF_Msk					(0x1FFFFFu << 9)
#define SCB_VTOR_TBLOFF_Pos					9

	/* 0x0C: Application interrupt and reset control */
	uint32_t volatile AIRCR;
	/* VECTRESET */
#define SCB_AIRCR_VECTRESET					(1u << 0)
	/* VECTCLRACTIVE */
#define SCB_AIRCR_VECTCLRACTIVE					(1u << 1)
	/* SYSRESETREQ */
#define SCB_AIRCR_SYSRESETREQ					(1u << 2)
	/* PRIGROUP */
#define SCB_AIRCR_PRIGROUP_Msk					(0x7u << 8)
#define SCB_AIRCR_PRIGROUP_Pos					8
	/* ENDIANESS */
#define SCB_AIRCR_ENDIANESS					(1u << 15)
	/* Register key */
#define SCB_AIRCR_VECTKEYSTAT_Msk				(0xFFFFu << 16)
#define SCB_AIRCR_VECTKEYSTAT_Pos				16

	/* 0x10: System control register */
	uint32_t volatile SCR;
	/* SLEEPONEXIT */
#define SCB_SCR_SLEEPONEXIT					(1u << 1)
	/* SLEEPDEEP */
#define SCB_SCR_SLEEPDEEP					(1u << 2)
	/* Send Event on Pending bit */
#define SCB_SCR_SEVEONPEND					(1u << 4)

	/* 0x14: Configuration and control */
	uint32_t volatile CCR;
	/* Configures how the processor enters */
#define SCB_CCR_NONBASETHRDENA					(1u << 0)
	/* USERSETMPEND */
#define SCB_CCR_USERSETMPEND					(1u << 1)
	/* UNALIGN_ TRP */
#define SCB_CCR_UNALIGN__TRP					(1u << 3)
	/* DIV_0_TRP */
#define SCB_CCR_DIV_0_TRP					(1u << 4)
	/* BFHFNMIGN */
#define SCB_CCR_BFHFNMIGN					(1u << 8)
	/* STKALIGN */
#define SCB_CCR_STKALIGN					(1u << 9)

