josuah/mcu-stm32f411/registers.h
	/* 0x18: System handler priority */
	uint32_t volatile SHPR1;
	/* Priority of system handler */
#define SCB_SHPR1_PRI_4_Msk					(0xFFu << 0)
#define SCB_SHPR1_PRI_4_Pos					0
	/* Priority of system handler */
#define SCB_SHPR1_PRI_5_Msk					(0xFFu << 8)
#define SCB_SHPR1_PRI_5_Pos					8
	/* Priority of system handler */
#define SCB_SHPR1_PRI_6_Msk					(0xFFu << 16)
#define SCB_SHPR1_PRI_6_Pos					16

	/* 0x1C: System handler priority */
	uint32_t volatile SHPR2;
	/* Priority of system handler */
#define SCB_SHPR2_PRI_11_Msk					(0xFFu << 24)
#define SCB_SHPR2_PRI_11_Pos					24

	/* 0x20: System handler priority */
	uint32_t volatile SHPR3;
	/* Priority of system handler */
#define SCB_SHPR3_PRI_14_Msk					(0xFFu << 16)
#define SCB_SHPR3_PRI_14_Pos					16
	/* Priority of system handler */
#define SCB_SHPR3_PRI_15_Msk					(0xFFu << 24)
#define SCB_SHPR3_PRI_15_Pos					24

	/* 0x24: System handler control and state */
	uint32_t volatile SHCRS;
	/* Memory management fault exception active */
#define SCB_SHCRS_MEMFAULTACT					(1u << 0)
	/* Bus fault exception active */
#define SCB_SHCRS_BUSFAULTACT					(1u << 1)
	/* Usage fault exception active */
#define SCB_SHCRS_USGFAULTACT					(1u << 3)
	/* SVC call active bit */
#define SCB_SHCRS_SVCALLACT					(1u << 7)
	/* Debug monitor active bit */
#define SCB_SHCRS_MONITORACT					(1u << 8)
	/* PendSV exception active */
#define SCB_SHCRS_PENDSVACT					(1u << 10)
	/* SysTick exception active */
#define SCB_SHCRS_SYSTICKACT					(1u << 11)
	/* Usage fault exception pending */
#define SCB_SHCRS_USGFAULTPENDED				(1u << 12)
	/* Memory management fault exception */
#define SCB_SHCRS_MEMFAULTPENDED				(1u << 13)
	/* Bus fault exception pending */
#define SCB_SHCRS_BUSFAULTPENDED				(1u << 14)
	/* SVC call pending bit */
#define SCB_SHCRS_SVCALLPENDED					(1u << 15)
	/* Memory management fault enable */
#define SCB_SHCRS_MEMFAULTENA					(1u << 16)
	/* Bus fault enable bit */
#define SCB_SHCRS_BUSFAULTENA					(1u << 17)
	/* Usage fault enable bit */
#define SCB_SHCRS_USGFAULTENA					(1u << 18)

	/* 0x28: Configurable fault status */
	uint32_t volatile CFSR_UFSR_BFSR_MMFSR;
	/* Instruction access violation */
#define SCB_CFSR_UFSR_BFSR_MMFSR_IACCVIOL			(1u << 1)
	/* Memory manager fault on unstacking for a */
#define SCB_CFSR_UFSR_BFSR_MMFSR_MUNSTKERR			(1u << 3)
	/* Memory manager fault on stacking for */
#define SCB_CFSR_UFSR_BFSR_MMFSR_MSTKERR			(1u << 4)
	/* MLSPERR */
#define SCB_CFSR_UFSR_BFSR_MMFSR_MLSPERR			(1u << 5)
	/* Memory Management Fault Address Register */
#define SCB_CFSR_UFSR_BFSR_MMFSR_MMARVALID			(1u << 7)
	/* Instruction bus error */
#define SCB_CFSR_UFSR_BFSR_MMFSR_IBUSERR			(1u << 8)
	/* Precise data bus error */
#define SCB_CFSR_UFSR_BFSR_MMFSR_PRECISERR			(1u << 9)
	/* Imprecise data bus error */
#define SCB_CFSR_UFSR_BFSR_MMFSR_IMPRECISERR			(1u << 10)
	/* Bus fault on unstacking for a return */
#define SCB_CFSR_UFSR_BFSR_MMFSR_UNSTKERR			(1u << 11)
	/* Bus fault on stacking for exception */
#define SCB_CFSR_UFSR_BFSR_MMFSR_STKERR				(1u << 12)
	/* Bus fault on floating-point lazy state */
#define SCB_CFSR_UFSR_BFSR_MMFSR_LSPERR				(1u << 13)
	/* Bus Fault Address Register (BFAR) valid */
#define SCB_CFSR_UFSR_BFSR_MMFSR_BFARVALID			(1u << 15)
	/* Undefined instruction usage */
#define SCB_CFSR_UFSR_BFSR_MMFSR_UNDEFINSTR			(1u << 16)
	/* Invalid state usage fault */
#define SCB_CFSR_UFSR_BFSR_MMFSR_INVSTATE			(1u << 17)
	/* Invalid PC load usage */
#define SCB_CFSR_UFSR_BFSR_MMFSR_INVPC				(1u << 18)
	/* No coprocessor usage */
#define SCB_CFSR_UFSR_BFSR_MMFSR_NOCP				(1u << 19)
	/* Unaligned access usage */
#define SCB_CFSR_UFSR_BFSR_MMFSR_UNALIGNED			(1u << 24)
	/* Divide by zero usage fault */
#define SCB_CFSR_UFSR_BFSR_MMFSR_DIVBYZERO			(1u << 25)

	/* 0x2C: Hard fault status register */
	uint32_t volatile HFSR;
	/* Vector table hard fault */
#define SCB_HFSR_VECTTBL					(1u << 1)
	/* Forced hard fault */
#define SCB_HFSR_FORCED						(1u << 30)
	/* Reserved for Debug use */
#define SCB_HFSR_DEBUG_VT					(1u << 31)

	/* 0x30 */
	uint8_t RESERVED0[0x34u-0x30u];

	/* 0x34: Memory management fault address */
	uint32_t volatile MMFAR;
	/* Memory management fault */
#define SCB_MMFAR_MMFAR_Msk					(0xFFFFFFFFu << 0)
#define SCB_MMFAR_MMFAR_Pos					0

	/* 0x38: Bus fault address register */
	uint32_t volatile BFAR;
	/* Bus fault address */
#define SCB_BFAR_BFAR_Msk					(0xFFFFFFFFu << 0)
#define SCB_BFAR_BFAR_Pos					0

	/* 0x3C: Auxiliary fault status */
	uint32_t volatile AFSR;
	/* Implementation defined */
#define SCB_AFSR_IMPDEF_Msk					(0xFFFFFFFFu << 0)
#define SCB_AFSR_IMPDEF_Pos					0

};


#define NVIC_STIR ((struct mcu_nvic_stir *)0xE000EF00)

struct mcu_nvic_stir {

	/* 0x00: Software trigger interrupt */
	uint32_t volatile STIR;
	/* Software generated interrupt */
#define NVIC_STIR_STIR_INTID_Msk				(0x1FFu << 0)
#define NVIC_STIR_STIR_INTID_Pos				0

};


#define FPU_CPACR ((struct mcu_fpu_cpacr *)0xE000ED88)

struct mcu_fpu_cpacr {

	/* 0x00: Coprocessor access control */
	uint32_t volatile CPACR;
	/* CP */
#define FPU_CPACR_CPACR_CP_Msk					(0xFu << 20)
#define FPU_CPACR_CPACR_CP_Pos					20

};


#define SCB_ACTRL ((struct mcu_scb_actrl *)0xE000E008)

struct mcu_scb_actrl {

	/* 0x00: Auxiliary control register */
	uint32_t volatile ACTRL;
	/* DISMCYCINT */
#define SCB_ACTRL_ACTRL_DISMCYCINT				(1u << 0)
	/* DISDEFWBUF */
#define SCB_ACTRL_ACTRL_DISDEFWBUF				(1u << 1)
	/* DISFOLD */
#define SCB_ACTRL_ACTRL_DISFOLD					(1u << 2)
	/* DISFPCA */
#define SCB_ACTRL_ACTRL_DISFPCA					(1u << 8)
	/* DISOOFP */
#define SCB_ACTRL_ACTRL_DISOOFP					(1u << 9)

};

#endif
